{
  "2025-10-03": {
    "Ariete": "<b>Amore:</b> Un soffio di passione accende i cuori, rivelando connessioni profonde. Segui l'istinto gentile che ti guida.\n<b>Lavoro:</b> La tua energia pionieristica apre nuove strade. Affronta le sfide con coraggio, la determinazione porta successo.\n<b>Fortuna:</b> Un'opportunità inattesa bussa alla porta. Sii audace, il destino ti sorride in un momento propizio.",
    "Toro": "<b>Amore:</b> Un tocco gentile risveglia affetti profondi. Cerca l'armonia nei legami, apprezzando la quiete condivisa che nutre l'anima.\n<b>Lavoro:</b> La tua tenacia costruisce basi solide. Concentrati sui dettagli, la perseveranza porta frutti inattesi ai tuoi sforzi.\n<b>Fortuna:</b> Un raggio di sole illumina piccoli piaceri. Accogli le opportunità latenti, la serenità è vicina e ti sorride.",
    "Gemelli": "<b>Amore:</b> Oggi, un velo di romanticismo avvolge i vostri legami, favorendo intese profonde e sorrisi complici. Ascoltate il cuore.\n<b>Lavoro:</b> La vostra mente brillante trova soluzioni innovative; un'idea può sbocciare, portando frutti inattesi. Non temete di esplorare nuove strade.\n<b>Fortuna:</b> Una scintilla inaspettata illumina il cammino, siate pronti a cogliere un piccolo, dolce dono dal destino. La vostra intuizione è la guida.",
    "Cancro": "<b>Amore:</b> Un dolce sussurro di tenerezza accarezza il vostro animo, invitandovi a connessioni profonde. Aprite il cuore senza timore.\n<b>Lavoro:</b> L'intuito è la vostra stella polare; fidatevi di esso per navigare con successo tra gli impegni e cogliere nuove opportunità.\n<b>Fortuna:</b> Una piccola sorpresa illumina la giornata, portando con sé una piacevole sensazione di serenità e benessere inaspettato.",
    "Leone": "<b>Amore:</b> La tua fiamma interiore risplende, accendendo passioni e donando calore sincero. Non temere di esprimere il tuo cuore.\n<b>Lavoro:</b> Con coraggio leonino, affronta le sfide. Le tue idee brillanti apriranno nuove strade, portandoti il meritato riconoscimento.\n<b>Fortuna:</b> Un'onda inaspettata di buona sorte ti eleva. Segui l'intuizione, un'opportunità brillante ti attende dietro l'angolo.",
    "Vergine": "<b>Amore:</b> Un filo invisibile lega i cuori, portando comprensione e dolci intese. Ascoltate il partner, troverete armonia in un gesto inatteso.\n<b>Lavoro:</b> La vostra precisione sarà la chiave. Un dettaglio curato aprirà nuove prospettive, consolidando la stima altrui. Procedete con fiducia.\n<b>Fortuna:</b> Un piccolo raggio di sole illumina il cammino. Una coincidenza fortunata o una parola amica vi guideranno verso una serena risoluzione.",
    "Bilancia": "<b>Amore:</b> Il cuore danza in armonia, un dialogo sincero rafforza i legami più cari. Lasciati guidare dalla tenerezza e dall'intesa profonda.\n<b>Lavoro:</b> Le collaborazioni fioriscono, la tua diplomazia aprirà nuove vie. Trova l'equilibrio nelle scelte, il successo è a portata di mano.\n<b>Fortuna:</b> Una piccola, piacevole sorpresa illumina la tua giornata. Sii ricettivo, un'opportunità inattesa potrebbe bussare alla porta.",
    "Scorpione": "Il cuore sussurra segreti profondi; un legame si intensifica nell'ombra. Nel <b>lavoro</b>, la tua intuizione affilata svela percorsi inattesi, portando chiarezza dove regnava l'incertezza. La <b>fortuna</b> danza inaspettata, un velo si solleva rivelando un'opportunità nascosta, forse un dono del destino. Sii ricettivo ai messaggi silenziosi che ti circondano.",
    "Sagittario": "<b>Amore:</b> Un soffio di novità accende il cuore, la comprensione reciproca fiorisce, portando armonia e serenità inattese.\n<b>Lavoro:</b> La mente è acuta, pronta a cogliere opportunità. Le vostre idee trovano terreno fertile. Un piccolo rischio può premiare.\n<b>Fortuna:</b> Le stelle sorridono, guidando i vostri passi. Un pizzico di audacia apre porte inattese. Ascoltate l'intuizione.",
    "Capricorno": "<b>Amore:</b> Nel cuore, un sussurro di tenerezza rafforza i legami, creando armonia in momenti di intesa profonda e sincera.\n<b>Lavoro:</b> La costanza apre nuovi orizzonti; la visione chiara guida verso successi concreti, premiando l'impegno costante.\n<b>Fortuna:</b> Un vento propizio porta piccoli doni inattesi. Sii ricettivo, la sorte sorride alle opportunità che nascono.",
    "Acquario": "<b>Amore:</b> Un soffio di novità ravviva legami esistenti o accende scintille in incontri inattesi. Sii aperto alle intese profonde.\n<b>Lavoro:</b> La tua mente brillante trova soluzioni innovative. Non temere di proporre idee audaci; il successo è a portata di mano.\n<b>Fortuna:</b> È un vento favorevole che spinge le tue vele. Un'intuizione improvvisa potrebbe rivelarsi preziosa.",
    "Pesci": "<b>Amore:</b> Le correnti del cuore portano armonia profonda. Un gesto inatteso o una parola sincera rafforzano i legami, creando comprensione.\n\n<b>Lavoro:</b> La tua intuizione è una bussola preziosa. Segui i lampi di genio; una soluzione creativa emergente trasforma le sfide in opportunità.\n\n<b>Fortuna:</b> Le stelle sorridono. Piccole sincronicità positive illuminano la giornata con un tocco discreto ma significativo, apri gli occhi."
  },
  "2025-10-04": {
    "Ariete": "<b>Amore:</b> Un'intesa profonda illumina i cuori, avvicinando anime con dolci parole non dette. La sensibilità regna.\n<b>Lavoro:</b> La tua energia creativa fluisce, aprendo strade nuove; osa proporre le tue idee brillanti. La perseveranza paga.\n<b>Fortuna:</b> Una coincidenza inaspettata porterà un sorriso, un piccolo dono dal destino. Sii ricettivo ai segnali.",
    "Toro": "<b>Amore</b>: Sentimenti profondi affiorano, invitandovi a nutrire i legami con tenerezza e comprensione. Cercate l'armonia interiore.\n<b>Lavoro</b>: La vostra dedizione brilla, aprendo nuove prospettive o consolidando successi recenti. Siate pazienti e costanti.\n<b>Fortuna</b>: Un velo di inaspettata buona sorte si posa sul vostro cammino, siate pronti a cogliere le opportunità che si presentano.",
    "Gemelli": "<b>Amore:</b> Un soffio di complicità avvolge il cuore, favorendo intese profonde e sorrisi condivisi. Lasciatevi guidare dall'istinto.\n<b>Lavoro:</b> Le idee brillano, la comunicazione è la chiave per superare ogni ostacolo con arguzia. Condividete i vostri pensieri.\n<b>Fortuna:</b> Piccoli doni inattesi o incontri fortuiti rendono la giornata più leggera e promettente. Accogliete le sorprese.",
    "Cancro": "<b>Amore:</b> Il tuo cuore sensibile trova armonia, le parole non dette si trasformano in dolci melodie. Connettiti profondamente, lasciandoti avvolgere da affetti sinceri.\n<b>Lavoro:</b> La tua dedizione illumina percorsi creativi. Un'intuizione sottile ti guiderà verso decisioni fruttuose; non esitare a fidarti della tua saggezza interiore.\n<b>Fortuna:</b> Le stelle allineano eventi inaspettati a tuo favore. Cogli ogni segnale, una piccola gioia ti aspetta dietro l'angolo, portando un sorriso inatteso.",
    "Leone": "<b>Amore:</b> La fiamma interiore risplende, portando calore e intesa profonda. Un gesto inatteso potrebbe accendere nuove passioni o rafforzare legami esistenti.\n<b>Lavoro:</b> La tua leadership naturale emerge. Sii audace nelle decisioni, le stelle favoriscono la crescita e il riconoscimento dei tuoi sforzi.\n<b>Fortuna:</b> Un vento propizio soffia sulla tua strada. Mantieni gli occhi aperti per un'occasione inaspettata che può cambiare il corso della giornata.",
    "Vergine": "<b>Amore</b>: Un soffio gentile ravviva le fiamme, nutrendo intese profonde con gesti sinceri. L'armonia sboccia nel dialogo.\n<b>Lavoro</b>: La tua meticolosità brilla, aprendo nuove vie alla creatività e al riconoscimento. Progetti avanzano con passo sicuro e precisione.\n<b>Fortuna</b>: Una sincronicità inattesa ti guida, offrendo un piccolo vantaggio quando meno lo aspetti. Cogli l'attimo, è favorevole.",
    "Bilancia": "Oggi, il cuore si accorda a melodie sommesse; troverai intesa profonda in uno sguardo o riscoprirai la bellezza di un legame. L'armonia ti guida. Nel tuo operato, la <b>diplomazia</b> è chiave; affronta le sfide con grazia, cercando soluzioni eque. Le collaborazioni fioriscono. Un soffio leggero di buona <b>sorte</b> ti accompagna. Sii aperto a piccole, inaspettate gioie che colorano la tua giornata.",
    "Scorpione": "<b>Amore:</b> Il cuore sussurra segreti, invitando a connessioni profonde e autentiche. Le emozioni si intensificano, rivelando legami insospettati.\n<b>Lavoro:</b> La tua acuta intuizione guida scelte sagge. Affronta le sfide con determinazione, cogliendo l'attimo per consolidare posizioni.\n<b>Fortuna:</b> Un'onda di opportunità si avvicina, portando chiarezza e nuove prospettive. Sii ricettivo ai segnali del destino.",
    "Sagittario": "<b>Amore:</b> Il cuore danza al ritmo di un nuovo incanto, portando dolci promesse di connessione profonda.\n<b>Lavoro:</b> Idee brillanti aprono sentieri inesplorati; la tua audacia segna la via del successo.\n<b>Fortuna:</b> Un raggio inatteso di sole illumina il tuo cammino, portando opportunità sorprendenti e inattese.",
    "Capricorno": "<b>Amore:</b> Un'eco gentile risuona nel cuore, portando momenti di tenerezza e una condivisione sincera che fortifica i legami.\n<b>Lavoro:</b> La tua tenacia tesse successi; una visione acuta rivela nuove opportunità e meritati riconoscimenti per l'impegno profuso.\n<b>Fortuna:</b> Un vento propizio soffia, regalando piccole gioie e una serendipità inattesa a chi ha il cuore aperto.",
    "Acquario": "<b>Amore:</b> Un soffio d'armonia accarezza i vostri legami, favorendo intese profonde e sorrisi sinceri. Lasciatevi trasportare dall'onda emotiva.\n<b>Lavoro:</b> Le idee brillano come stelle, illuminando nuove vie. Cogliete l'attimo per proposte audaci e costruttive, avranno risonanza.\n<b>Fortuna:</b> Una brezza favorevole muove le vele del destino. Siate pronti a riconoscere opportunità inattese celate nella quotidianità.",
    "Pesci": "<b>Amore:</b> I sentimenti affiorano come perle dal profondo; un legame si rafforza nel silenzio. Ascolta il cuore, ti guiderà.\n<b>Lavoro:</b> La tua creatività è una bussola, un'idea luminosa porta successo inatteso. Naviga con fiducia.\n<b>Fortuna:</b> Un'onda benevola ti culla, il momento è propizio per un piccolo, dolce desiderio."
  },
  "2025-10-05": {
    "Ariete": "<b>Amore:</b> Un soffio gentile ravviva intese profonde, o accende dolci scintille. Lascia che il cuore guidi i tuoi passi con rinnovata fiducia.\n<b>Lavoro:</b> La tua energia è un faro. Progetti in sospeso trovano slancio, e nuove idee germogliano con potenziale di successo.\n<b>Fortuna:</b> Piccoli colpi di scena positivi illuminano la giornata. Fida il tuo istinto, ti guiderà verso doni inattesi.",
    "Toro": "<b>Amore:</b> Il tuo cuore trova pace in affetti sinceri. Momenti di tenerezza rafforzano legami, portando armonia e stabilità emotiva.\n<b>Lavoro:</b> La perseveranza è la tua alleata. Ogni sforzo, per quanto piccolo, getta solide basi per successi futuri. Sii paziente e metodico.\n<b>Fortuna:</b> Un'opportunità inattesa, celata nella routine, potrebbe svelarsi. Rimani ricettivo; una sorpresa discreta illumina la tua giornata.",
    "Gemelli": "<b>Amore:</b> Un soffio di novità accende i cuori, le parole volano leggere, creando ponti inaspettati. L'intesa si rafforza con dolcezza e comprensione.\n<b>Lavoro:</b> La mente è agile, le idee brillanti. Collaborazioni fruttuose emergono, portando a successi inattesi. Sii proattivo, la strada è chiara.\n<b>Fortuna:</b> Una piccola sorpresa allieta la giornata. Affidati all'intuito per cogliere le occasioni fugaci. Un sorriso illumina il cammino.",
    "Cancro": "<b>Amore:</b> Sentimenti dolci e sinceri si intensificano. Un'onda di tenerezza avvolge il cuore, portando calore e profonda intesa nei vostri legami.\n<b>Lavoro:</b> La vostra creatività è al culmine. Le idee germogliano come fiori; dedicatevi ai progetti con cura, i frutti della vostra dedizione non tarderanno.\n<b>Fortuna:</b> Una piacevole sorpresa illumina la giornata. Una piccola gemma brilla nel sentiero, segno di un inatteso favore che vi dona un sorriso.",
    "Leone": "<b>Amore:</b> Il tuo cuore generoso irradia, attirando connessioni profonde. Un gesto inatteso accenderà nuove scintille, rafforzando i legami con passione.\n<b>Lavoro:</b> La tua leadership brilla. Le idee audaci trovano terreno fertile, portando riconoscimenti meritati. Non temere di osare con fiducia.\n<b>Fortuna:</b> Una piccola coincidenza fortunata ti sorride, illuminando il cammino. Sii ricettivo ai doni inattesi del destino.",
    "Vergine": "<b>Amore:</b> Un filo sottile unisce i cuori, tessendo intese profonde e silenzi complici. Ascolta l'eco dell'anima gemella, trovando armonia in gesti semplici.\n<b>Lavoro:</b> La mente acuta trova soluzioni innovative. Un piccolo successo illumina il percorso, valorizzando la tua dedizione e precisione.\n<b>Fortuna:</b> Un inatteso raggio di luce filtra tra le nubi, portando serenità interiore e una piacevole sorpresa che alleggerisce la giornata.",
    "Bilancia": "<b>Amore:</b> Oggi, il cuore trova armonia in sguardi condivisi e parole non dette. Un legame si rafforza con dolcezza inaspettata.\n<b>Lavoro:</b> La tua diplomazia brilla, sbloccando situazioni complesse. Idee innovative portano a progressi significativi e riconoscimento.\n<b>Fortuna:</b> Un vento leggero soffia a tuo favore, portando piccole gioie inattese e un senso di serena abbondanza.",
    "Scorpione": "<b>Amore:</b> Un velo di mistero avvolge i vostri sentimenti, rendendovi irresistibilmente magnetici. Ascoltate il cuore, la passione attende una connessione profonda.\n<b>Lavoro:</b> Con determinazione incrollabile, affronterete ogni sfida. L'intuito vi guiderà verso soluzioni efficaci, portando frutti inaspettati.\n<b>Fortuna:</b> Un'opportunità celata si palesa; la vostra acuta percezione interiore vi permetterà di coglierla al volo, trasformando il potenziale in realtà.",
    "Sagittario": "Il cuore si apre a nuove melodie, un sussurro d'intesa ravviva vecchie fiamme o accende nuove. Nel <b>lavoro</b>, la tua visione chiara illumina sentieri inesplorati, portando frutti inattesi se la dedizione è sincera. La <b>fortuna</b> ti sorride con un tocco lieve, un'opportunità fugace da cogliere al volo. Ascolta l'intuizione, è la tua guida.",
    "Capricorno": "<b>Amore:</b> Il cuore sussurra segreti dolci. Un tocco gentile o una parola sincera accenderanno fiamme inaspettate. Sii aperto alle emozioni che sbocciano.\n<b>Lavoro:</b> La tua dedizione professionale brilla. Nuove idee germogliano; presentale con fiducia. La perseveranza aprirà porte verso successi meritati.\n<b>Fortuna:</b> La sorte ti sorride con discrezione. Piccoli gesti di generosità o un aiuto inatteso possono trasformare la tua giornata. Cogli il barlume di gioia.",
    "Acquario": "<b>Amore:</b> Un'onda di connessione sottile accarezza i tuoi sentimenti; apri il cuore a nuove risonanze.\n<b>Lavoro:</b> La tua mente acuta trova soluzioni originali. Un'intuizione vincente apre nuove strade.\n<b>Fortuna:</b> Un piccolo, inatteso favore illumina la tua giornata, portando un sorriso sereno.",
    "Pesci": "Le correnti del cuore fluiscono dolci, tessendo un'intesa profonda. Permetti alle emozioni di guidarti, rafforzando legami o aprendo a nuove, tenere connessioni. <b>Lavoro:</b> Nel mare delle sfide, il tuo intuito è la bussola. Un'idea luminosa emerge dalle profondità, portando soluzioni innovative. <b>Fortuna:</b> Un velo di serendipità ti avvolge delicatamente. Piccole coincidenze favorevoli punteggiano la giornata, rivelando sprazzi di pura armonia."
  },
  "2025-10-06": {
    "Ariete": "<b>Amore:</b> Un soffio gentile accarezza il tuo cuore, portando chiarezza in relazioni significative. Un sentimento inatteso potrebbe sbocciare, o una vecchia fiamma ritrovare vigore.\n<b>Lavoro:</b> La tua energia è un faro: illumina nuove prospettive e spinge progetti avanti con audacia. Non temere di osare.\n<b>Fortuna:</b> Una piccola, luminosa stella guida i tuoi passi, offrendo un dono inatteso o una soluzione a un vecchio dilemma.",
    "Toro": "Oggi, l'<b>Amore</b> sussurra armonie delicate; i cuori si trovano in un'intesa profonda e rassicurante. Nel <b>Lavoro</b>, la tua dedizione è chiave; semina con cura le tue idee, i frutti matureranno. La <b>Fortuna</b> ti sorride con opportunità inaspettate; apri gli occhi a nuove, brillanti direzioni che si rivelano sul tuo cammino.",
    "Gemelli": "Un vento di freschezza soffia sulle tue energie.\n<b>Amore:</b> Le conversazioni fioriscono, tessendo legami più profondi. Ogni parola un passo verso l'intesa.\n<b>Lavoro:</b> La mente è acuta, pronta a generare nuove idee. La condivisione apre porte inattese.\n<b>Fortuna:</b> Un guizzo d'intuizione rivela una piccola opportunità nascosta. Cogli l'attimo con leggerezza.",
    "Cancro": "<b>Amore:</b> Un'onda di tenerezza avvolge il tuo cuore, invitandoti a condividere emozioni profonde. Le stelle sussurrano promesse dolci.\n<b>Lavoro:</b> La tua intuizione è una guida preziosa. Progetti delicati fioriscono, la dedizione ripaga con risultati inattesi. Sii attento.\n<b>Fortuna:</b> Un piccolo raggio di sole illumina la tua giornata da un gesto inatteso. Cogli la magia nelle cose semplici.",
    "Leone": "<b>Amore:</b> Il cuore ruggisce, pronto a donarsi. Un gesto sincero accende la fiamma, portando calore e intesa profonda nel tuo cammino.\n<b>Lavoro:</b> La tua luce guida le decisioni. Affronta le sfide con audacia, il tuo impegno sarà notato e premiato con successo.\n<b>Fortuna:</b> La dea bendata sorride al coraggioso. Un'occasione inaspettata bussa, cogli la sua mano con fiducia e ottimismo.",
    "Vergine": "<b>Amore:</b> Un soffio gentile accarezza il cuore, tessendo fili di comprensione e tenerezza. Lasciatevi guidare dall'intuito emotivo.\n<b>Lavoro:</b> La vostra meticolosità sarà una risorsa preziosa. Nuove prospettive si aprono, richiedendo attenzione ai dettagli e creatività.\n<b>Fortuna:</b> Un piccolo, inatteso raggio di luce illumina la giornata, suggerendo opportunità nascoste da esplorare con fiducia.",
    "Bilancia": "<b>Amore</b>: Un soffio gentile accarezza il vostro cuore, portando armonia. Ascoltate l'altro con profonda empatia, rafforzando i legami esistenti.\n<b>Lavoro</b>: L'ingegno fiorisce, guidandovi verso soluzioni innovative. Collaborate con fiducia, i vostri progetti prenderanno forma concreta e positiva.\n<b>Fortuna</b>: Una luce benevola vi avvolge. Piccoli gesti inattesi illuminano la giornata, portando serenità e qualche piacevole sorpresa inaspettata.",
    "Scorpione": "<b>Amore:</b> Un velo si solleva, rivelando intese profonde. Ascoltate il cuore, la passione guida verso legami autentici e rivelatori.\n<b>Lavoro:</b> La vostra acuta intuizione è la chiave. Superate ostacoli con astuzia, ogni sfida si trasforma in un trionfo silenzioso.\n<b>Fortuna:</b> Energie nascoste affiorano, offrendo inattese opportunità. Fidatevi del vostro istinto, vi condurrà a scoperte preziose.",
    "Sagittario": "<b>Amore:</b> Un soffio gentile accarezza il tuo cuore, portando armonia e intesa. Apriti ai dolci sussurri che il destino ti riserva.\n<b>Lavoro:</b> La tua mente è un faro, le idee brillano chiare. Un progetto attende la tua energia creativa. Agisci con fiducia.\n<b>Fortuna:</b> Un raggio di luce illumina il tuo sentiero. Piccole gioie inattese colorano la giornata, cogli l'attimo.",
    "Capricorno": "<b>Amore:</b> Un soffio di tenerezza accarezza il tuo cuore, invitandoti a condividere emozioni sincere. Un gesto inatteso porta armonia.\n<b>Lavoro:</b> La tua determinazione illumina il percorso, risolvendo ostacoli con saggezza. Nuove idee germogliano, pronte a fiorire.\n<b>Fortuna:</b> Un'opportunità inaspettata si affaccia all'orizzonte, portando un raggio di sole. Cogli l'attimo con fiducia e ottimismo.",
    "Acquario": "<b>Amore:</b> Un soffio gentile di comprensione avvolge i legami, portando chiarezza e un calore inaspettato al cuore. Apriti.\n<b>Lavoro:</b> Le tue idee brillanti trovano terreno fertile; la collaborazione apre porte inattese verso progressi significativi. Sii audace.\n<b>Fortuna:</b> Un vento favorevole soffia verso di te, portando piccole, ma preziose opportunità da cogliere al volo. Resta vigile.",
    "Pesci": "<b>Amore:</b> Onde emotive profonde accarezzano l'anima, promettendo un'intima risonanza. Lascia che il tuo intuito guidi il cammino amoroso. <b>Lavoro:</b> Nel regno professionale, la tua creatività è una bussola. Affidati alle visioni interiori per cogliere brillanti opportunità. <b>Fortuna:</b> Un sussurro del destino porta una sorpresa inattesa. La fortuna danza leggera intorno a te, sii pronto ad accoglierla."
  },
  "2025-10-07": {
    "Ariete": "<b>Amore:</b> Il cuore si apre a nuove intese, un ponte invisibile unisce anime. Lasciatevi guidare dalla tenerezza, riscoprendo la bellezza dei legami sinceri.\n<b>Lavoro:</b> Un lampo di genio illumina i progetti. La vostra determinazione porta riconoscimenti meritati. Nuove prospettive e collaborazioni fruttuose sono all'orizzonte.\n<b>Fortuna:</b> Un soffio leggero del destino porta inattese gioie. Siate aperti ai doni che la giornata offre, un sorriso illumina il cammino.",
    "Toro": "<b>Amore:</b> Un soffio gentile accarezza il cuore, rafforzando legami e promettendo dolci intese. Apritevi alla tenerezza sincera.\n<b>Lavoro:</b> La vostra dedizione porta frutti maturi. Un passo ponderato oggi consolida la strada verso il successo futuro e riconosciuto.\n<b>Fortuna:</b> Un piccolo, inatteso favore illumina la giornata, portando un sorriso dove meno lo attendete. Cogliete l'attimo propizio.",
    "Gemelli": "<b>Amore:</b> Un sussurro del cuore rende l'intesa più profonda. Il dialogo sincero apre nuove, delicate vie per rafforzare i legami.\n<b>Lavoro:</b> La mente agile trova soluzioni inattese con brillantezza. Collaborazioni fruttuose spingono avanti i vostri progetti con rinnovata energia.\n<b>Fortuna:</b> Una scintilla inaspettata illumina il percorso. Cogli l'attimo, un piccolo gesto può fare la differenza e portare un sorriso.",
    "Cancro": "<b>Amore:</b> Il cuore palpita leggero, donando e ricevendo affetto sincero. Aperture inaspettate vi attendono, accoglietele con grazia e tenerezza.\n<b>Lavoro:</b> La creatività fiorisce nelle mansioni quotidiane. Fidatevi del vostro istinto per superare ogni ostacolo, il successo è vicino.\n<b>Fortuna:</b> La buona sorte sorride in dettagli inattesi. Un'onda di serenità vi avvolge, ricaricando lo spirito e l'ambiente domestico.",
    "Leone": "<b>Amore:</b> Oggi il cuore arde di un fuoco gentile; concediti la gioia di condividere, l'amore ti sorriderà con gesti inaspettati.\n<b>Lavoro:</b> La tua luce guida illumina il cammino; non temere di mostrare la tua visione, il successo è a portata di mano.\n<b>Fortuna:</b> Ti bende gli occhi, ma non il tuo spirito audace; cogli l'attimo, una svolta inattesa è vicina.",
    "Vergine": "<b>Amore:</b> Nel cuore, un sussurro gentile invita all'apertura; lasciatevi guidare dall'intuito nelle connessioni.\n<b>Lavoro:</b> Al lavoro, la vostra mente analitica brilla, trasformando sfide complesse in successi organizzati.\n<b>Fortuna:</b> La fortuna si cela in dettagli inattesi; cogliete l'attimo, un piccolo gesto può aprire grandi porte.",
    "Bilancia": "<b>Amore</b>: Un soffio gentile accarezza il tuo cuore; condividi pensieri profondi, l'armonia sboccia nel dialogo.\n<b>Lavoro</b>: La tua innata diplomazia ti guida. Collaborazioni fruttuose emergono, portando a soluzioni eleganti e risultati apprezzabili.\n<b>Fortuna</b>: Una piccola, inaspettata brezza favorevole ti sospinge, rivelando un'opportunità o una soluzione proprio quando meno te l'aspetti.",
    "Scorpione": "Nel cuore, <b>Amore</b> svela profondità inattese; le connessioni si intensificano. Sul fronte <b>Lavoro</b>, la tua perspicacia è la chiave: affronta ogni sfida con strategia e visione. La <b>Fortuna</b> sorride discreta, celata in piccoli momenti di serendipità che illuminano il tuo percorso con una luce sottile ma potente.",
    "Sagittario": "<b>Amore:</b> Un calore avvolge il cuore, invitandovi a condividere emozioni sincere. Un dialogo profondo può rafforzare legami esistenti o aprirne di nuovi con grazia.\n<b>Lavoro:</b> La vostra mente acuta trova soluzioni inaspettate. Siate audaci nelle idee; un'opportunità di crescita si manifesta per chi sa cogliere l'attimo.\n<b>Fortuna:</b> Una brezza leggera porta un'occasione imprevista. Fidatevi dell'intuito; una piccola gioia illumina la giornata con un tocco di magia.",
    "Capricorno": "Errore API Gemini: 429 RESOURCE_EXHAUSTED. {'error': {'code': 429, 'message': 'You exceeded your current quota, please check your plan and billing details. For more information on this error, head to: https://ai.google.dev/gemini-api/docs/rate-limits.\\n* Quota exceeded for metric: generativelanguage.googleapis.com/generate_content_free_tier_requests, limit: 10\\nPlease retry in 12.15387379s.', 'status': 'RESOURCE_EXHAUSTED', 'details': [{'@type': 'type.googleapis.com/google.rpc.QuotaFailure', 'violations': [{'quotaMetric': 'generativelanguage.googleapis.com/generate_content_free_tier_requests', 'quotaId': 'GenerateRequestsPerMinutePerProjectPerModel-FreeTier', 'quotaDimensions': {'location': 'global', 'model': 'gemini-2.5-flash'}, 'quotaValue': '10'}]}, {'@type': 'type.googleapis.com/google.rpc.Help', 'links': [{'description': 'Learn more about Gemini API quotas', 'url': 'https://ai.google.dev/gemini-api/docs/rate-limits'}]}, {'@type': 'type.googleapis.com/google.rpc.RetryInfo', 'retryDelay': '12s'}]}}",
    "Acquario": "<b>Amore:</b> Un filo invisibile lega i cuori, portando comprensione profonda e sguardi complici. Apri il tuo spirito alla connessione.\n<b>Lavoro:</b> Idee brillanti emergono, trova alleati per concretizzarle. La collaborazione apre porte inattese verso il progresso.\n<b>Fortuna:</b> Una scintilla di buona sorte illumina il tuo percorso. Affidati all'istinto, ti guiderà verso opportunità velate.",
    "Pesci": "<b>Amore:</b> Un'onda gentile di comprensione avvolge il cuore, portando dolci sussurri e connessioni profonde. Lascia che l'emozione guidi i tuoi gesti.\n<b>Lavoro:</b> L'intuizione è la tua bussola; segui il flusso creativo per risolvere enigmi inattesi. Evita la fretta e fidati del tuo istinto.\n<b>Fortuna:</b> Una stella benevola ti sorride, promettendo piccole gioie inaspettate e una ritrovata serenità interiore. Abbraccia la magia del momento."
  },
  "2025-10-08": {
    "Ariete": "<b>Amore:</b> Un soffio di passione risveglia i sensi, portando intese profonde o un nuovo, frizzante incontro. Ascolta il tuo cuore ardente.\n<b>Lavoro:</b> La tua energia è magnetica. Nuove sfide si presentano, pronte ad essere affrontate con la tua audacia innata. Non temere di osare.\n<b>Fortuna:</b> Un piccolo, piacevole imprevisto rallegrerà la tua giornata. Sii aperto alle dolci sorprese che il destino ti riserva.",
    "Toro": "<b>Amore:</b> Nel cuore, armonie inattese fioriscono, portando dolci intese. Un sussurro d'anima gemella rasserena le tue giornate.\n<b>Lavoro:</b> La tua tenacia modella il successo. Idee solide trovano terreno fertile, consolidando posizioni con pragmatismo.\n<b>Fortuna:</b> La sorte ti sorride con discrezione, suggerendo percorsi benefici e inaspettati vantaggi materiali.",
    "Gemelli": "<b>Amore:</b> Un'intesa profonda illumina i vostri legami, con un tocco di giocosa leggerezza. Lasciatevi guidare dal cuore per connessioni sincere.\n\n<b>Lavoro:</b> La vostra mente vivace trova soluzioni ingegnose. La comunicazione fluida aprirà nuove vie, superando ostacoli con brillantezza.\n\n<b>Fortuna:</b> Un piccolo, inatteso dono dal destino allieta la giornata, portando un sorriso e una scintilla di speranza.",
    "Cancro": "<b>Amore</b>: La luna tesse fili sottili, invitandovi a un abbraccio sincero o a un ascolto profondo. Il cuore si apre, cercate conforto nella vicinanza.\n<b>Lavoro</b>: L'intuito è la vostra bussola migliore. Affrontate le sfide con delicatezza, le soluzioni emergono da un approccio calmo e riflessivo.\n<b>Fortuna</b>: Un piccolo gesto inatteso o una coincidenza felice illuminano la giornata. Accogliete la serenità che vi circonda.",
    "Leone": "<b>Amore:</b> Il cuore ardente trova risposte in sguardi profondi, accendendo nuove fiamme con passione sincera.\n<b>Lavoro:</b> La tua luce guida progetti audaci; non temere di brillare, le tue idee sono oro.\n<b>Fortuna:</b> Sorride in un inatteso dono o una svolta propizia, rivelando opportunità celate. Abbraccia la tua magnificenza.",
    "Vergine": "<b>Amore:</b> Il cuore oggi sussurra dolci melodie; ascolta l'eco per intime connessioni e armonia.\n<b>Lavoro:</b> La tua meticolosità brilla, rivelando soluzioni inaspettate e proficue opportunità. La dedizione ripaga.\n<b>Fortuna:</b> Un piccolo, ma significativo dono del destino ti sorriderà, portando leggerezza e un inatteso barlume di gioia.",
    "Bilancia": "<b>Amore:</b> Un soffio gentile accarezza i vostri sentimenti, favorendo intesa e armonia profonda. Condivisione e dolcezza vi guidano.\n<b>Lavoro:</b> L'equilibrio è la vostra arma segreta. Affrontate sfide con grazia diplomatica, trovando soluzioni innovative e riconosciute.\n<b>Fortuna:</b> La sorte vi sorride con piccole, inaspettate coincidenze che aprono nuove vie. Fidatevi del vostro intuito per coglierle.",
    "Scorpione": "<b>Amore:</b> La passione sorge dalle profondità, chiedendo sincerità. Un legame si rafforza con la verità condivisa, non temere l'intensità del momento.\n<b>Lavoro:</b> La tua intuizione è una guida infallibile. Svela opportunità celate, affrontando con astuzia ogni sfida. I tuoi sforzi saranno notati.\n<b>Fortuna:</b> Un vento favorevole soffia da direzioni inattese. Ascolta il tuo sesto senso, ti condurrà a una scoperta preziosa.",
    "Sagittario": "<b>Amore:</b> Un soffio gentile accarezza il cuore, portando intesa e nuove prospettive. Lasciati guidare dall'autenticità. Nuovi incontri promettenti.\n<b>Lavoro:</b> Le tue idee brillano, aprendo strade inesplorate. Agisci con fiducia, il successo è a portata di mano. Un'intuizione vincente.\n<b>Fortuna:</b> Il destino sorride, tessendo fili di inaspettate coincidenze che ti guidano verso la gioia. Un dono inatteso.",
    "Capricorno": "<b>Amore:</b> Un tocco gentile riscalda il cuore, svelando connessioni profonde. Lasciatevi avvolgere dalla tenerezza, la sincerità apre nuove porte dell'anima e rinnova i legami.\n<b>Lavoro:</b> La vostra dedizione brilla, attirando sguardi ammirati. Una sfida si trasforma in trampolino, portando riconoscimento e fertili opportunità di crescita inattese.\n<b>Fortuna:</b> Una brezza inattesa porta un sussurro di buona sorte. Fidatevi dell'intuito; una piccola sorpresa rallegrerà la giornata, illuminando il cammino con leggerezza.",
    "Acquario": "<b>Amore:</b> Un soffio gentile riscalda i legami, accendendo nuove intese. Condividi emozioni sincere, troverai riscontro.\n<b>Lavoro:</b> La tua visione unica trova terreno fertile. Non esitare a proporre idee innovative; il successo è a portata di mano.\n<b>Fortuna:</b> Un piccolo colpo di scena positivo illumina la giornata, portando un sorriso inaspettato. Sii aperto alle sorprese.",
    "Pesci": "<b>Amore:</b> Un velo di magia avvolge i legami; l'intuito guida il cuore verso intese profonde. Lasciati trasportare.\n<b>Lavoro:</b> La creatività fiorisce, portando soluzioni inaspettate. Sii pratico nelle scelte, ma segui l'ispirazione.\n<b>Fortuna:</b> Un piccolo dono del destino si palesa, cogli l'attimo con gratitudine. Sii aperto alle sorprese."
  },
  "2025-10-09": {
    "Ariete": "<b>Amore:</b> Un soffio gentile accarezza i sentimenti, invita a nuove connessioni o a riscoprire la magia di quelle esistenti. L'ascolto è la chiave.\n<b>Lavoro:</b> La tua energia è una fiamma guida. Progetti e idee trovano terreno fertile, ma la pazienza è un alleato prezioso.\n<b>Fortuna:</b> Una scintilla inattesa illumina il cammino. Sii pronto ad accogliere piccole sorprese che addolciranno la giornata.",
    "Toro": "<b>Amore:</b> Il cuore sussurra dolci intese, accendendo la fiamma della tenerezza in momenti inattesi.\n<b>Lavoro:</b> La tua costanza porta frutti inaspettati; un progetto prende la giusta direzione.\n<b>Fortuna:</b> Ti sorride con un piccolo segno, una coincidenza fortunata che rischiara la giornata. Sii aperto ai messaggi del destino.",
    "Gemelli": "<b>Amore:</b> Le stelle sussurrano armonia, portando chiarezza ai sentimenti. Un dialogo sincero rafforza i legami, accendendo nuove scintille di comprensione.\n<b>Lavoro:</b> La mente è un vulcano di idee fresche. Nuove prospettive emergono, valorizzando la tua innata versatilità. Sii audace nelle proposte.\n<b>Fortuna:</b> Un'onda lieve di buona sorte ti accompagna. Presta attenzione ai piccoli segnali del destino, nascondono opportunità inattese e vantaggi insperati.",
    "Cancro": "<b>Amore:</b> Un'onda di tenerezza avvolge il cuore, favorendo intesa e dolcezza. Ascolta l'anima gemella con profonda empatia.\n<b>Lavoro:</b> L'intuito guida le tue azioni con saggezza, trasformando ogni compito in un'opportunità creativa e proficua.\n<b>Fortuna:</b> Sorrisi inattesi ti raggiungono da luoghi sereni, portando piccole gioie e un senso di profonda pace interiore.",
    "Leone": "Il cuore brilla di una luce intensa: un gesto inatteso accende la passione. Nel <b>lavoro</b>, la tua determinazione apre nuove strade; affronta le sfide con coraggio. La <b>fortuna</b> sorride con un piccolo ma significativo aiuto, un soffio di vento favorevole che spinge le tue vele verso orizzonti promettenti. Sii audace.",
    "Vergine": "<b>Amore</b>: Un filo invisibile lega cuori, portando tenerezza e comprensione profonda. Ascolta il sussurro dell'anima gemella che ti circonda.\n<b>Lavoro</b>: La precisione è la tua alleata; un'intuizione acuta apre nuove prospettive, consolidando ogni sforzo con risultati tangibili.\n<b>Fortuna</b>: Un piccolo dono inatteso o un'opportunità velata si rivela, guidandoti verso un sereno benessere e nuove realizzazioni.",
    "Bilancia": "<b>Amore:</b> L'amore soffia una brezza gentile, portando armonia nei legami. Un dialogo sincero rafforza ogni intesa, avvicinando i cuori con delicatezza.\n\n<b>Lavoro:</b> Nel lavoro, la tua diplomazia apre nuove vie inattese. Cerca l'equilibrio nelle scelte, la chiarezza premia i tuoi sforzi.\n\n<b>Fortuna:</b> La fortuna ti sorride con piccole, inattese gioie. Segui l'intuizione, una stella guida ti illumina il percorso.",
    "Scorpione": "<b>Amore:</b> Un velo si solleva, rivelando profondità insperate nel cuore del tuo legame. Ascolta il silenzio eloquente.\n<b>Lavoro:</b> La tua acutezza strategica è un faro; affronta le sfide con determinazione, il successo è nel dettaglio.\n<b>Fortuna:</b> Un sussurro del destino ti guida. Apri la mente a opportunità inattese che portano luce e nuove prospettive.",
    "Sagittario": "<b>Amore:</b> Un soffio di passione accende il cuore, avvicinando anime in un dolce abbraccio. Lasciatevi guidare dal sentire profondo che vi unisce.\n<b>Lavoro:</b> Nuove prospettive si svelano, chiamando la vostra energia creativa. Agite con fiducia, la strada verso il successo si apre chiaramente.\n<b>Fortuna:</b> Una stella benevola illumina il vostro cammino, portando piccole gioie inattese. Apritevi alle sorprese, sono dietro l'angolo.",
    "Capricorno": "<b>Amore:</b> Nel giardino del cuore, un fiore sboccia, portando armonia e comprensione profonda nei vostri legami.\n<b>Lavoro:</b> L'impegno costante illumina il vostro percorso, le sfide si trasformano in scalini verso un successo meritato.\n<b>Fortuna:</b> Un soffio leggero di buona sorte vi accarezza, aprendo porte inaspettate a piccole, dolci sorprese.",
    "Acquario": "<b>Amore:</b> Un dialogo sincero illumina i sentimenti, rafforzando legami o aprendo a nuove, sorprendenti affinità. Lascia che il cuore ti guidi.\n<b>Lavoro:</b> La tua inventiva è al top. Idee originali risolvono ostacoli, portando riconoscimenti o nuove prospettive professionali. Non temere di osare.\n<b>Fortuna:</b> Piccoli eventi fortuiti colorano la giornata. Sii attento ai segnali, potrebbero indicare una via inaspettata. La leggerezza è tua alleata.",
    "Pesci": "<b>Amore:</b> Le acque del cuore fluiscono con tenerezza, accogliendo un'onda di comprensione profonda. Un gesto inatteso accende la scintilla.\n<b>Lavoro:</b> L'intuizione è la tua guida, svelando percorsi creativi. Affidati alla tua visione interiore per superare ogni ostacolo.\n<b>Fortuna:</b> Una serendipità sottile ti sorride, portando un dono inatteso. Apri gli occhi ai piccoli miracoli del giorno."
  },
  "2025-10-10": {
    "Ariete": "<b>Amore:</b> Un soffio gentile accarezza il tuo cuore, portando armonia o un nuovo, dolce calore. Sii aperto alle connessioni profonde.\n<b>Lavoro:</b> La tua energia brillante illumina la via. Progetti e idee trovano terreno fertile; agisci con audacia e determinazione.\n<b>Fortuna:</b> Un barlume inatteso ti guida. Cogli le opportunità che si presentano, anche le più piccole, perché nascondono grandi potenzialità.",
    "Toro": "<b>Amore:</b> Un tenero abbraccio scalda il cuore, rafforzando legami preziosi. Momenti di profonda intesa fioriscono, nutrendo l'anima con dolcezza.\n<b>Lavoro:</b> La tua perseveranza è la chiave. Ogni sforzo costante porta frutti tangibili, assicurando stabilità e riconoscimenti meritati.\n<b>Fortuna:</b> Una quieta armonia ti avvolge. Piccoli dettagli inattesi portano gioia, illuminando la giornata con serena abbondanza.",
    "Gemelli": "<b>Amore:</b> Le parole del cuore danzano, trova il momento giusto per esprimere ciò che senti. Un dialogo sincero può rafforzare un legame o accendere una nuova scintilla.\n\n<b>Lavoro:</b> La tua mente è un faro luminoso, pronta a cogliere idee innovative. Sii aperto alla collaborazione; un confronto inatteso può svelare nuove strade promettenti.\n\n<b>Fortuna:</b> Un soffio lieve di buona sorte ti accompagna. Presta attenzione ai piccoli dettagli e alle intuizioni fulminee, nascondono opportunità inaspettate.",
    "Cancro": "<b>Amore:</b> I fili del cuore si intessono con dolcezza, donando rifugio e comprensione. Ascolta le melodie più intime, un abbraccio scalderà l'anima.\n<b>Lavoro:</b> La tua intuizione illumina i percorsi. Collabora con sensibilità, trovando soluzioni creative nel gruppo. La calma ti premia.\n<b>Fortuna:</b> Un piccolo dono inatteso o una quiete domestica ti avvolge, portando una serena armonia e un sorriso spontaneo.",
    "Leone": "<b>Amore:</b> Il cuore ardente trova risonanza, un legame si rafforza con inaspettata sincerità. Osate esprimere la vostra fiamma interiore.\n<b>Lavoro:</b> La vostra luce guida decisioni importanti, un'idea brillante cattura l'attenzione. Mostrate il vostro valore intrinseco.\n<b>Fortuna:</b> Un raggio di sole illumina un percorso inatteso. Il destino sorride, cogliete l'attimo propizio con fiducia.",
    "Vergine": "<b>Amore:</b> Un tocco gentile riscalda il cuore, tessendo intese profonde. Ascolta le emozioni che sbocciano, portando armonia e vicinanza.\n<b>Lavoro:</b> La tua dedizione illumina il percorso, rivelando soluzioni ingegnose. La mente è lucida, pronta a cogliere dettagli preziosi.\n<b>Fortuna:</b> Un soffio discreto del destino apre porte inattese. Sii ricettivo ai piccoli favori che ti sorridono con grazia.",
    "Bilancia": "<b>Amore:</b> Il cuore sussurra dolci armonie, invitando alla comprensione reciproca. Un gesto inatteso accende la fiamma della connessione.\n<b>Lavoro:</b> Nel regno professionale, la tua innata diplomazia apre porte inattese, trasformando sfide in opportunità collaborative. Sii audace e giusto.\n<b>Fortuna:</b> La sorte ti sorride con piccole, inaspettate coincidenze che allineano il cammino, portando serenità e un senso di giusta ricompensa.",
    "Scorpione": "<b>Amore:</b> Un velo si solleva, rivelando profonde connessioni. Condividi sentimenti, la tua anima risplende in intime armonie.\n<b>Lavoro:</b> L'intuizione è la tua bussola. Ogni sfida nasconde un'opportunità preziosa, affrontala con acuta strategia.\n<b>Fortuna:</b> Il destino sorride da angoli inattesi. Segui il tuo istinto, sarà la tua guida più fedele e sicura oggi.",
    "Sagittario": "<b>Amore:</b> Il cuore danza in armonia, trovando dolci intese che nutrono l'anima con calore e comprensione. Un sorriso svela un legame profondo.\n<b>Lavoro:</b> L'ingegno splende, aprendo nuove rotte. Affronta le sfide con audacia: le tue idee migliori trovano oggi fertile terreno.\n<b>Fortuna:</b> Un'eco gentile dal destino ti sfiora, portando un inatteso dono o un'opportunità che illumina il tuo percorso. Sii ricettivo.",
    "Capricorno": "<b>Amore:</b> Un tenero raggio illumina i tuoi affetti, portando armonia. Ascolta il cuore, le connessioni si approfondiscono con dolcezza inattesa.\n<b>Lavoro:</b> La tua dedizione è una bussola sicura. Nuove opportunità emergono, fidati del tuo istinto e sii proattivo con saggezza.\n<b>Fortuna:</b> Piccoli doni del destino allieteranno la giornata. Un inatteso sorriso della sorte ti avvolge in una serena aura positiva.",
    "Acquario": "<b>Amore:</b> I venti portano sussurri di intesa; apri il cuore a connessioni inattese e sincere. La complicità fiorisce nella condivisione intellettuale.\n<b>Lavoro:</b> La tua mente brilla, guidando progetti innovativi. Condividi le tue visioni; saranno accolte con entusiasmo, portando avanti grandi idee.\n<b>Fortuna:</b> Un'intuizione improvvisa ti aprirà una porta segreta verso un'opportunità inattesa. Fida il tuo istinto.",
    "Pesci": "<b>Amore:</b> Le tue emozioni fluttuano come onde, portando dolci messaggi. Lascia che il cuore guidi, la tenerezza trova risposte inaspettate.\n<b>Lavoro:</b> L'intuito è la tua bussola oggi. Ascolta quella voce interiore, ti guiderà verso soluzioni creative e successi nascosti.\n<b>Fortuna:</b> Un raggio di luce illumina il tuo cammino, portando piccole sorprese. Sii aperto ai doni inattesi del destino."
  },
  "2025-10-11": {
    "Ariete": "<b>Amore</b>: Un'onda di tenerezza avvolge il tuo cuore, portando armonia e comprensione profonda. Ascolta le sfumature.\n<b>Lavoro</b>: La tua energia è magnetica. Progetti audaci trovano terreno fertile; non esitare a guidare con decisione.\n<b>Fortuna</b>: Una scintilla inattesa illumina il cammino, rivelando opportunità nascoste. Segui quell'intuizione audace.",
    "Toro": "<b>Amore</b>: Un abbraccio sincero rinsalda legami preziosi, il cuore trova stabilità in affetti consolidati. Sentimenti radicati portano gioia.\n<b>Lavoro</b>: La tua dedizione costante apre nuove opportunità. La pazienza nel dettaglio si rivela una virtù premiante.\n<b>Fortuna</b>: Una piccola, inattesa grazia allieta la giornata, portando un senso di benessere e gratitudine. Sii ricettivo.",
    "Gemelli": "<b>Amore:</b> Un soffio gentile anima il cuore, portando intese profonde. Siate aperti a nuove connessioni sincere, il dialogo vi arricchisce.\n<b>Lavoro:</b> Le idee brillano come stelle, guidando scelte astute. Collaborazioni fruttuose sono all'orizzonte, cogliete le opportunità con prontezza.\n<b>Fortuna:</b> Un velo di serendipità vi avvolge, rivelando piccole gioie inaspettate. Seguite il vostro istinto, vi condurrà a piacevoli scoperte.",
    "Cancro": "Un'aura di tenerezza avvolge il tuo spirito, rendendo le connessioni più profonde. In <b>amore</b>, un'intesa speciale si consolida, regalando momenti di pura armonia. Nel <b>lavoro</b>, la tua innata intuizione è una guida preziosa: ascoltala e vedrai progetti sbocciare con successo. La <b>fortuna</b> sorride da gesti inaspettati e dalla serenità domestica, portando gioia e un senso di pace interiore che illumina il tuo cammino.",
    "Leone": "<b>Amore:</b> La tua fiamma interiore riscalda i cuori, portando armonia e intesa profonda. Connessioni sincere fioriscono sotto il tuo sguardo radioso.\n<b>Lavoro:</b> Le tue idee brillano con forza leonina, guidando progetti verso il successo. Riconoscimenti meritati sono all'orizzonte.\n<b>Fortuna:</b> Un tocco inaspettato di buona sorte illumina il tuo cammino, aprendo porte e rivelando opportunità preziose. Abbraccia il cambiamento.",
    "Vergine": "<b>Amore:</b> Un tenero sussurro del cuore accende nuove intese. Ascolta con dolcezza, rafforzando legami o scoprendo dolci connessioni inattese.\n<b>Lavoro:</b> Il tuo ingegno brilla, illuminando dettagli cruciali. Progetti prendono forma con passi sicuri, portando un meritato progresso.\n<b>Fortuna:</b> Una brezza favorevole porta un sorriso inatteso. Cogli il momento, un piccolo dono del destino è pronto a sorprenderti.",
    "Bilancia": "Un soffio gentile accarezza il tuo <b>amore</b>, portando armonia e intesa profonda. Nel <b>lavoro</b>, la diplomazia è la tua stella guida; soluzioni eleganti aprono nuove porte. Una scintilla di <b>fortuna</b> illumina le tue scelte più ponderate, guidandoti verso esiti felici. Fidati del tuo intuito.",
    "Scorpione": "<b>Amore:</b> Un velo sottile si solleva, rivelando l'intensità di un legame. Lascia che il cuore guidi la tua profonda connessione.\n\n<b>Lavoro:</b> La tua perspicacia è la chiave. Ogni sfida si trasforma in opportunità se la affronti con astuzia e determinazione.\n\n<b>Fortuna:</b> Un'onda inaspettata porta doni. Abbraccia il cambiamento, la sorte ti è propizia, specialmente nelle scelte audaci.",
    "Sagittario": "<b>Amore:</b> Il cuore danza su note inattese. La comunicazione sincera rafforza legami o ne accende di nuovi, lasciando spazio alla spontaneità.\n<b>Lavoro:</b> Le tue idee brillano come stelle. Mostra iniziativa; l'ingegno porta frutti inaspettati e nuove strade si aprono.\n<b>Fortuna:</b> Un raggio di sole illumina sentieri nascosti. Cogli ogni opportunità, anche la più piccola, con spirito d'avventura.",
    "Capricorno": "<b>Amore:</b> Un tenero gesto o una parola sincera rafforzano i legami, creando armonia nel cuore.\n<b>Lavoro:</b> La tua concentrazione metodica porta frutti. Un'idea chiara emerge, guidandoti verso nuovi orizzonti produttivi.\n<b>Fortuna:</b> Un'intuizione sottile ti guida. Abbraccia l'inatteso, una piccola sorpresa rischiara la giornata.",
    "Acquario": "<b>Amore:</b> Il cuore vibra su frequenze inattese, cercando connessioni profonde e autentiche. Un dialogo sincero illumina la via, portando chiarezza e vicinanza.\n<b>Lavoro:</b> La mente è fertile, pronta a seminare idee brillanti. Collaborazioni innovative portano frutti inaspettati, favorendo progressi significativi.\n<b>Fortuna:</b> Una stella benevola sorride da angoli insoliti. L'intuizione guida verso opportunità nascoste, premiando l'apertura al nuovo.",
    "Pesci": "<b>Amore:</b> Un velo di intesa avvolge i cuori, rivelando sussurri d'anima. Lascia che la tenerezza guidi ogni gesto, approfondendo legami preziosi.\n\n<b>Lavoro:</b> L'intuizione si fa stella polare tra le onde delle mansioni. Segui il tuo istinto creativo; una soluzione inattesa emergerà dalla nebbia.\n\n<b>Fortuna:</b> Un piccolo, sereno imprevisto allieterà la giornata. Sii aperto ai doni del caso, essi portano un sorriso inaspettato."
  },
  "2025-10-12": {
    "Ariete": "<b>Amore:</b> La tenerezza fiorisce in conversazioni sincere. Il cuore si apre, rafforzando legami preziosi e inaspettati.\n<b>Lavoro:</b> Un'intuizione brillante illumina il tuo percorso. Affronta le sfide con audacia, il successo è a portata di mano.\n<b>Fortuna:</b> Un piccolo, inatteso gesto del destino ti sorprende, portando gioia e una ventata di leggerezza.",
    "Toro": "<b>Amore:</b> Un soffio gentile accarezza il cuore, rivelando intime armonie. Condivisione e dolcezza tessono fili di una intesa profonda.\n<b>Lavoro:</b> La tua tenacia apre varchi inaspettati. Ogni sforzo, meticoloso e paziente, ora fiorisce in stabili successi e riconoscimenti.\n<b>Fortuna:</b> Un piccolo dono del destino ti attende, un conforto che nutre l'anima e arricchisce il quotidiano.",
    "Gemelli": "<b>Amore:</b> Un soffio gentile ravviva le fiamme, le parole creano ponti. L'armonia si tesse con gesti inattesi.\n<b>Lavoro:</b> La mente agile coglie opportunità, le idee fioriscono con successo. È tempo di brillare in nuove direzioni.\n<b>Fortuna:</b> Un piccolo dono del destino illumina il tuo percorso. Sii ricettivo, una sorpresa positiva ti attende.",
    "Cancro": "<b>Amore:</b> Il tuo cuore sensibile danza in armonie sottili. Condividi la tua tenerezza; un legame prezioso si rafforza, un nuovo affetto sboccia.\n<b>Lavoro:</b> L'intuizione ti guida verso soluzioni inaspettate. La tua dedizione porta frutti dolci; non temere di mostrare la tua luce.\n<b>Fortuna:</b> Un piccolo dono del destino ti attende. Affidati ai tuoi presentimenti, ti indicheranno la via verso una serena opportunità.",
    "Leone": "<b>Amore:</b> Il cuore, un fuoco ardente, cerca calore e risposte sincere. Un gesto inaspettato scioglierà ogni dubbio, portando chiarezza e passione.\n<b>Lavoro:</b> La vostra visione chiara guida passi decisi. Un'idea brillante illumina il cammino, portando riconoscimento meritato e nuove opportunità.\n<b>Fortuna:</b> Una stella propizia veglia su di voi, offrendo un piccolo dono inatteso o la soluzione a un quesito a lungo cercato.",
    "Vergine": "<b>Amore:</b> Un soffio di tenerezza inatteso ravviva le fiamme, portando armonia. La sensibilità guida dolcemente le parole, rafforzando legami preziosi.\n<b>Lavoro:</b> La tua meticolosa attenzione ai dettagli si rivela vincente. Un'idea brillante emerge, illuminando nuove prospettive e garantendo successo.\n<b>Fortuna:</b> Una piccola sorpresa ti attende, un gesto inaspettato porta gioia. Il destino ti sorride attraverso un dettaglio quasi invisibile.",
    "Bilancia": "<b>Amore:</b> Oggi le stelle sussurrano dolci intese, trova l'equilibrio perfetto nel dare e ricevere affetto. Ascolta il cuore.\n<b>Lavoro:</b> Un'opportunità si presenta velata, la tua innata diplomazia aprirà nuove vie al successo. Sii perspicace.\n<b>Fortuna:</b> Un raggio inatteso di buona sorte illumina il cammino, portando un sorriso inatteso e leggerezza.",
    "Scorpione": "<b>Amore:</b> Le profondità dell'anima si rivelano, unendo i cuori in comprensioni silenziose e ardenti. Ascolta l'eco del desiderio.\n<b>Lavoro:</b> La tua perspicacia acuta svela opportunità nascoste. Agisci con strategia; la chiarezza porta a successi inattesi.\n<b>Fortuna:</b> Fidati del tuo istinto, è la tua guida più fedele. Un dono inatteso emerge dall'ombra, illuminando il tuo cammino.",
    "Sagittario": "<b>Amore:</b> Il cuore si apre a nuove melodie, un'intesa profonda attende la tua anima libera. Connettiti con gentilezza e passione.\n<b>Lavoro:</b> L'ingegno brilla, nuove strade si rivelano. La collaborazione porta frutti inaspettati. Sii audace nelle idee.\n<b>Fortuna:</b> Una stella propizia veglia su di te, portando un soffio di magia dove meno lo aspetti. Abbraccia l'inatteso dono del giorno.",
    "Capricorno": "<b>Amore:</b> Un soffio gentile accarezza il vostro cuore, favorendo intese profonde e sguardi complici. L'affetto si consolida in gesti inattesi.\n<b>Lavoro:</b> La vostra dedizione incrollabile porta a nuove conquiste. Un progetto riceve la giusta attenzione, pavesando il cammino.\n<b>Fortuna:</b> Piccoli doni del destino illuminano la giornata. Ascoltate l'intuizione, vi guiderà verso opportunità inaspettate.",
    "Acquario": "Oggi, il cuore trova risonanze inattese, tessendo fili d'intesa profonda. Nel <b>lavoro</b>, la mente vola alta, portando innovazione e chiarezza dove serve. La <b>fortuna</b> sorride con un sussurro gentile, guidandoti verso scoperte inaspettate. Abbraccia l'originalità che ti definisce.",
    "Pesci": "<b>Amore:</b> Le maree emotive ti accarezzano, portando dolci sussurri al cuore. Un incontro inatteso o un’intesa profonda illumina la sera.\n<b>Lavoro:</b> La tua intuizione è una bussola preziosa; fidati dei presentimenti per guidare scelte professionali sagge e innovative.\n<b>Fortuna:</b> Un velo di serendipità ti avvolge. Piccoli gesti o un colpo di fortuna aprono porte inattese, offrendo inaspettate ricompense."
  },
  "2025-10-13": {
    "Ariete": "<b>Amore:</b> Un soffio gentile ravviva fiamme antiche o ne accende di nuove. L'intesa fiorisce con dolci parole non dette. Il cuore palpita.\n<b>Lavoro:</b> Energie fresche favoriscono la creatività. Un'intuizione acuta sblocca ostacoli, portando chiarezza e progressi inaspettati. Sii proattivo.\n<b>Fortuna:</b> Un piccolo colpo di vento favorevole spinge le tue vele. Ascolta l'istinto, ti guiderà verso opportunità velate e sorrisi inattesi.",
    "Toro": "<b>Amore:</b> Nel giardino del cuore, un fiore sboccia, portando intesa profonda e calore avvolgente. Le anime si cercano con dolcezza, trovando rifugio.\n<b>Lavoro:</b> La tenacia tesse trame di successo. Progetti concreti prendono forma, e la dedizione apre vie inaspettate, portando riconoscimenti meritati.\n<b>Fortuna:</b> Una brezza leggera porta serenità inattesa, un piccolo tesoro nascosto. La buona sorte sorride con gesti semplici, donando pace e benessere.",
    "Gemelli": "<b>Amore:</b> Parole leggere e un sorriso complice accendono scintille, rafforzando i legami con delicata armonia. Dialoghi profondi aprono nuove vie.\n\n<b>Lavoro:</b> La mente è agile e vivace, pronta a cogliere sfumature e nuove prospettive. Idee innovative trovano terreno fertile.\n\n<b>Fortuna:</b> Un piccolo, inatteso gesto di gentilezza allieta la giornata, portando un raggio di luce dove meno l'aspetti.",
    "Cancro": "<b>Amore</b>: Un soffio di tenerezza avvolge il cuore, avvicinando anime con dolci parole. L'empatia è la vostra guida.\n<b>Lavoro</b>: La creatività fiorisce, portando soluzioni inaspettate. Fidatevi del vostro intuito per le decisioni importanti.\n<b>Fortuna</b>: Un piccolo raggio di sole illumina un angolo nascosto, portando una gradita sorpresa. Siate aperti al nuovo.",
    "Leone": "<b>Amore:</b> Il tuo cuore ruggisce con passione, un'intesa profonda rafforza legami o accende nuove, vibranti scintille.\n<b>Lavoro:</b> La tua innata leadership brilla. Idee audaci trovano terreno fertile, portando stima e forse un inatteso traguardo.\n<b>Fortuna:</b> Una piccola, luminosa coincidenza si profila. Sii ricettivo, un colpo di fortuna illumina la tua giornata.",
    "Vergine": "<b>Amore:</b> Un velo di tenerezza avvolge, suggerendo dolci intese. Ascoltate il cuore con gentilezza.\n<b>Lavoro:</b> La vostra precisione è una gemma preziosa. Le intuizioni guidano al successo, non temete di proporre.\n<b>Fortuna:</b> Un raggio inatteso illumina la strada, portando piccole gioie e una quieta serenità interiore.",
    "Bilancia": "<b>Amore:</b> Un soffio gentile di comprensione avvolge il tuo cuore, rafforzando legami e portando dolcezza in ogni incontro. La sintonia è palpabile.\n<b>Lavoro:</b> La tua innata diplomazia è la chiave: gestisci sfide con grazia, aprendo nuove vie al successo e all'armonia professionale.\n<b>Fortuna:</b> Piccoli, luminosi doni inattesi ti attendono, portando un sorriso e un senso di pace che illuminerà la tua giornata.",
    "Scorpione": "<b>Amore:</b> Emozioni profonde affiorano; un dialogo sincero rafforza legami. Apri il tuo cuore con coraggio.\n<b>Lavoro:</b> La tua mente strategica brilla, svelando soluzioni innovative. Affronta le sfide con astuzia.\n<b>Fortuna:</b> Un vento favorevole soffia inaspettatamente. Riconosci l'opportunità, agisci con la tua solita intensità.",
    "Sagittario": "<b>Amore:</b> Un soffio di novità accende il cuore, pronto a esplorare sentieri inesplorati con chi ami. La sincerità sarà la vostra guida.\n<b>Lavoro:</b> Le stelle favoriscono audaci iniziative. Non temere di proporre le tue idee più brillanti; un'opportunità inattesa ti attende.\n<b>Fortuna:</b> L'universo sorride alle tue scelte coraggiose. Un piccolo gesto di generosità tornerà a te moltiplicato.",
    "Capricorno": "<b>Amore:</b> Il cuore trova armonia, le parole delicate rafforzano i legami più profondi, tessendo affetti sinceri.\n<b>Lavoro:</b> I tuoi sforzi costanti attirano l'attenzione, nuove porte si aprono sul tuo percorso, promettendo frutti inattesi.\n<b>Fortuna:</b> Un velo si solleva, rivelando inaspettate occasioni che illuminano la giornata, cogliendo l'attimo fuggente.",
    "Acquario": "<b>Amore</b>: Le stelle tessono trame sottili, un'intesa profonda illumina i legami. Cogliete ogni sfumatura di affetto che vi circonda.\n<b>Lavoro</b>: La vostra inventiva è un faro; idee brillanti emergono, aprendo nuove opportunità. Fidatevi del vostro intuito.\n<b>Fortuna</b>: Un velo di serenità vi avvolge, alleggerendo il passo. Piccoli eventi fortunati rallegrano la giornata.",
    "Pesci": "Errore API Gemini: 429 RESOURCE_EXHAUSTED. {'error': {'code': 429, 'message': 'You exceeded your current quota, please check your plan and billing details. For more information on this error, head to: https://ai.google.dev/gemini-api/docs/rate-limits.\\n* Quota exceeded for metric: generativelanguage.googleapis.com/generate_content_free_tier_requests, limit: 10\\nPlease retry in 30.885638959s.', 'status': 'RESOURCE_EXHAUSTED', 'details': [{'@type': 'type.googleapis.com/google.rpc.QuotaFailure', 'violations': [{'quotaMetric': 'generativelanguage.googleapis.com/generate_content_free_tier_requests', 'quotaId': 'GenerateRequestsPerMinutePerProjectPerModel-FreeTier', 'quotaDimensions': {'location': 'global', 'model': 'gemini-2.5-flash'}, 'quotaValue': '10'}]}, {'@type': 'type.googleapis.com/google.rpc.Help', 'links': [{'description': 'Learn more about Gemini API quotas', 'url': 'https://ai.google.dev/gemini-api/docs/rate-limits'}]}, {'@type': 'type.googleapis.com/google.rpc.RetryInfo', 'retryDelay': '30s'}]}}"
  },
  "2025-10-14": {
    "Ariete": "<b>Amore:</b> Un soffio di passione ravviva scintille sopite. Lasciatevi guidare dal cuore, un incontro inatteso potrebbe fiorire con dolcezza.\n<b>Lavoro:</b> Energie fresche illuminano nuove prospettive. La vostra determinazione aprirà porte inattese, attenzione ai dettagli.\n<b>Fortuna:</b> Un piccolo dono del destino vi sorride oggi. Seguite l'istinto, vi condurrà verso una gioia inaspettata.",
    "Toro": "<b>Amore</b>: Il cuore si apre a dolci sussurri, cercando intesa e calore. Un gesto sincero rafforza legami, portando armonia profonda e vicinanza.\n\n<b>Lavoro</b>: La tua dedizione porta frutti concreti. Concentrazione acuta e pazienza svelano soluzioni inaspettate, guidando progetti con mano ferma e sicura.\n\n<b>Fortuna</b>: Un raggio di luce illumina il cammino. Accogli piccole gioie inattese, sentendoti protetto da una benevola energia che ti accompagna con leggerezza.",
    "Gemelli": "<b>Amore</b>: Un soffio di novità accarezza il cuore. Dialoghi sinceri apriranno porte inattese, rafforzando legami o accendendo nuove scintille.\n<b>Lavoro</b>: La mente è agile e pronta a cogliere sfumature. Le tue idee brillanti trovano terreno fertile; non esitare a proporle.\n<b>Fortuna</b>: Una stella propizia illumina il tuo cammino, portando piccole gioie inaspettate. Accogli le opportunità con leggerezza.",
    "Cancro": "<b>Amore</b>: Il tuo cuore trova rifugio in dolci intese, nutrendo i legami più profondi con tenerezza e comprensione. Ascolta l'eco dei sentimenti sinceri.\n\n<b>Lavoro</b>: La tua innata intuizione è una bussola affidabile oggi. Fidati del tuo istinto per superare un piccolo ostacolo o cogliere un'opportunità nascosta.\n\n<b>Fortuna</b>: Un velo di serenità ti avvolge, portando piccole gioie inattese che illuminano il tuo cammino. Sii ricettivo ai doni del destino.",
    "Leone": "<b>Amore:</b> Il tuo cuore ardente trova risonanza profonda, accendendo passioni inaspettate. Abbraccia la connessione autentica che si rivela.\n<b>Lavoro:</b> La tua luce interiore guida i progetti. Sii audace, le tue idee brillano e attraggono il successo meritato.\n<b>Fortuna:</b> Un'onda di positività ti solleva. Cogli ogni occasione con la fiducia regale che ti contraddistingue, il destino ti sorride.",
    "Vergine": "<b>Amore:</b> Un velo di comprensione avvolge i cuori, tessendo fili di armonia inaspettata. Lasciatevi guidare dall'intuizione e dalla dolcezza.\n<b>Lavoro:</b> La vostra precisione aprirà nuove vie. Un'idea brillante o un compito ben svolto porterà riconoscimento e soddisfazione.\n<b>Fortuna:</b> Un piccolo, inatteso raggio di sole illumina la giornata, portando con sé una sensazione di benessere e leggerezza interiore.",
    "Bilancia": "<b>Amore:</b> Una brezza gentile accarezza le relazioni, favorendo dialoghi sinceri e un'armonia ritrovata. Lasciati guidare dall'equilibrio del cuore.\n<b>Lavoro:</b> La tua diplomazia è una risorsa preziosa. Le collaborazioni fioriscono e le tue idee innovative portano a progressi inattesi.\n<b>Fortuna:</b> Un piccolo, inatteso dono si profila all'orizzonte, portando gioia e una sensazione di benessere.",
    "Scorpione": "<b>Amore</b>: Le profondità del tuo cuore si rivelano, intrecciando fili invisibili che rafforzano legami o ne creano di nuovi, sotto una luce inaspettata.\n<b>Lavoro</b>: La tua visione penetrante scava oltre la superficie, scoprendo opportunità nascoste e tracciando percorsi innovativi per il successo.\n<b>Fortuna</b>: Un piccolo, fortuito dettaglio o un incontro casuale può aprire porte inattese. Osserva attentamente il fluire degli eventi.",
    "Sagittario": "<b>Amore:</b> Un soffio di passione accende i cuori, avvicinando anime lontane. Ascolta il battito, nutri la connessione profonda che sboccia.\n<b>Lavoro:</b> La tua mente vola alta, portando idee brillanti. Sii audace nelle decisioni, il successo attende chi osa esplorare nuovi orizzonti.\n<b>Fortuna:</b> Un raggio inatteso illumina il cammino. Accogli i doni del caso, potrebbero celare opportunità preziose per la tua avventura.",
    "Capricorno": "<b>Amore:</b> Un soffio gentile accarezza i legami, donando chiarezza ai sentimenti condivisi. Apri il cuore a intese profonde, un abbraccio sincero attende.\n\n<b>Lavoro:</b> La perseveranza tesse trame di successo. I tuoi sforzi saranno notati, aprendo nuove vie alla crescita professionale. Un passo solido verso la vetta.\n\n<b>Fortuna:</b> Una corrente favorevole porta piccole sorprese inattese. Sii ricettivo ai doni del caso, essi illumineranno la tua giornata con serena gratitudine.",
    "Acquario": "<b>Amore:</b> Un soffio di novità ravviva i sentimenti. L'intelletto guida il cuore verso intese profonde e inattese. Apri la mente a connessioni speciali.\n<b>Lavoro:</b> Le tue idee brillano, portando soluzioni innovative. Non temere di proporre visioni audaci, troveranno terreno fertile e apprezzamento.\n<b>Fortuna:</b> Una serendipità inattesa apre nuove porte. Ascolta l'intuito, ti guiderà verso opportunità velate che promettono sviluppi positivi.",
    "Pesci": "<b>Amore:</b> Un velo di romanticismo avvolge il cuore, guidandovi verso connessioni profonde e sincere. Ascoltate l'anima, essa vi sussurra la strada.\n<b>Lavoro:</b> L'intuizione è la vostra bussola dorata oggi. Fidatevi dei lampi di genio per superare ogni ostacolo con grazia.\n<b>Fortuna:</b> Un soffio lieve di buona sorte vi accarezza, portando piccole gioie inaspettate. Siate ricettivi ai doni del giorno."
  },
  "2025-10-15": {
    "Ariete": "<b>Amore:</b> Il cuore sussurra melodie inaspettate, aprendo varchi a nuove intese o rinnovando vecchie fiamme con dolci promesse.\n<b>Lavoro:</b> La tua energia si traduce in passi audaci. Non esitare a prendere l'iniziativa; la costanza sarà premiata.\n<b>Fortuna:</b> Un vento propizio soffia leggero, portando piccole sorprese e occasioni per sorridere. Sii ricettivo ai segnali.",
    "Toro": "<b>Amore:</b> Il cuore vibra di intesa profonda. Un gesto gentile cementa legami, o una nuova scintilla illumina l'orizzonte sentimentale.\n<b>Lavoro:</b> La perseveranza è la tua bussola. Opportunità solide emergono, chiedendo attenzione e dedizione costante. Affronta con calma.\n<b>Fortuna:</b> Un inatteso raggio di sole illumina la giornata, portando piccole gioie e un senso di serena abbondanza inaspettata.",
    "Gemelli": "<b>Amore:</b> Un dialogo sincero rischiara il cuore, portando armonia e intesa. Cogli l'attimo per esprimere ciò che senti con delicatezza.\n<b>Lavoro:</b> La mente è agile, pronta a risolvere enigmi. Nuove idee sbocciano; condividile con fiducia per progressi significativi.\n<b>Fortuna:</b> Un'intuizione improvvisa ti guida verso una piccola, dolce sorpresa. Abbraccia le opportunità inattese con leggerezza.",
    "Cancro": "<b>Amore:</b> Le stelle sussurrano dolci armonie al vostro cuore sensibile. Un'intuizione guida i sentimenti, rafforzando legami o rivelando nuove profondità.\n<b>Lavoro:</b> La vostra dedizione brilla, portando frutti. Collaborazioni si rivelano proficue; ascoltate la voce interiore per decisioni sagge.\n<b>Fortuna:</b> Un piccolo raggio inatteso illumina il cammino. Fidatevi della vostra innata sensibilità per cogliere opportunità fugaci.",
    "Leone": "<b>Amore:</b> Il cuore palpita, un fuoco gentile accende intese profonde, portando calore e armonia nei legami.\n<b>Lavoro:</b> Nel tuo regno professionale, la tua luce guida. Idee brillanti trovano eco e meritato riconoscimento.\n<b>Fortuna:</b> La sorte ti sorride con tocchi inattesi, allineando eventi propizi sul tuo cammino.",
    "Vergine": "<b>Amore:</b> Un'insolita tenerezza permea i vostri incontri, tessendo fili d'intesa più profondi. Abbracciate la vulnerabilità per autentici scambi emotivi.\n<b>Lavoro:</b> La vostra acuta osservazione vi guiderà tra compiti complessi. Un approccio metodico promette risultati impeccabili.\n<b>Fortuna:</b> Un piccolo, inaspettato dono del caso illuminerà un angolo della vostra giornata, portando un sorriso sereno.",
    "Bilancia": "<b>Amore:</b> I cuori si allineano in una danza soave. Cerca l'armonia, le parole gentili apriranno nuove porte emotive.\n<b>Lavoro:</b> Un equilibrio delicato guida le tue scelte. La cooperazione è la chiave per superare ogni ostacolo con grazia.\n<b>Fortuna:</b> Una brezza leggera porta un inatteso momento di serenità, un piccolo dono dal destino.",
    "Scorpione": "Il <b>cuore</b> svela profondità inattese, l'anima risuona. La passione arde con inusitata intensità, guida ogni tuo passo. Sul fronte <b>professionale</b>, la tua acutezza è la chiave. Ogni strategia ben ponderata apre nuove porte, garantendo un successo meritato. La <b>fortuna</b> ti sorride da angoli inaspettati. Segui l'intuizione; un piccolo gesto può innescare una grande, sorprendente fortuna.",
    "Sagittario": "<b>Amore:</b> Un soffio gentile accende il cuore, portando armonia e intesa profonda. Ascolta il battito condiviso e lasciati guidare dalla tenerezza.\n<b>Lavoro:</b> Le stelle guidano passi audaci verso nuove vette. La tua visione sarà la chiave del successo; credi nelle tue intuizioni.\n<b>Fortuna:</b> Un raggio inatteso illumina il cammino, offrendo serenità e piccole, dolci sorprese. Abbraccia la leggerezza del momento.",
    "Capricorno": "<b>Amore</b>: Un delicato filo d'intesa tesse legami più profondi. Ascolta il cuore e condividi emozioni sincere, troverai risonanza.\n<b>Lavoro</b>: La tua dedizione porta frutti. Progetti a lungo termine avanzano con passi sicuri, riconosciuti e apprezzati.\n<b>Fortuna</b>: Un inatteso raggio di sole illumina la giornata, portando piccole gioie e opportunità veloci da cogliere.",
    "Acquario": "Un'aura di comprensione avvolge i vostri legami. Un sussurro inatteso potrebbe accendere nuove scintille nel cuore, o rafforzare vecchie intese.\n\nNel <b>lavoro</b>, la vostra mente brillante trova soluzioni innovative. Condividete le idee; la collaborazione è la chiave per superare ogni ostacolo.\n\nLa <b>fortuna</b> sorride su piccole, piacevoli sorprese. Un'intuizione improvvisa potrebbe guidarvi verso un vantaggio inatteso.",
    "Pesci": "<b>Amore:</b> L'onda dei sentimenti vi culla, trovando risonanza profonda. Ascoltate il cuore, un gesto gentile parla più di mille parole.\n<b>Lavoro:</b> La vostra creatività fluisce, guidando progetti con tocco ispirato. Collaborazioni armoniose apriranno nuove vie.\n<b>Fortuna:</b> Piccoli, inattesi doni illuminano il cammino. Seguite la vostra intuizione, vi condurrà alla serenità."
  },
  "2025-10-16": {
    "Ariete": "Un sussurro dolce avvolge il tuo cuore in <b>Amore</b>, tessendo fili di profonda intesa. Nel <b>Lavoro</b>, la tua audacia è premiata; un'idea brillante apre nuove porte, cogli l'attimo. La <b>Fortuna</b> brilla su decisioni rapide, guidandoti verso esiti inattesi e favorevoli. Segui l'istinto con coraggio.",
    "Toro": "<b>Amore:</b> I sussurri dell'anima trovano eco, rafforzando legami preziosi con gesti gentili. La connessione si approfondisce in armonia.\n<b>Lavoro:</b> La tua costanza porta frutti maturi; un progetto prende forma con solida precisione e dedizione. Le basi sono forti.\n<b>Fortuna:</b> Un raggio di serena fortuna illumina il cammino, portando piccole, dolci sorprese inaspettate nel quotidiano.",
    "Gemelli": "<b>Amore:</b> Un sussurro d'intesa illumina i tuoi legami, rendendo ogni scambio particolarmente prezioso. Ascolta e sarai ascoltato.\n<b>Lavoro:</b> La mente è agile; idee brillanti emergono, aprendo nuove vie di comunicazione e collaborazione. Sii proattivo.\n<b>Fortuna:</b> Una scintilla inattesa guida i tuoi passi. Abbraccia l'intuizione, poiché l'aria porta opportunità veloci e sorprendenti.",
    "Cancro": "<b>Amore:</b> Le stelle sussurrano dolci armonie; il cuore si apre a connessioni profonde. Nutrite i legami con tenerezza e presenza.\n<b>Lavoro:</b> La vostra intuizione è una guida luminosa. Affidatevi al vostro sesto senso per plasmare progetti con sensibilità.\n<b>Fortuna:</b> Una piccola onda gentile vi porta un inatteso momento di quiete, un dono nascosto nel quotidiano. Abbracciatelo.",
    "Leone": "<b>Amore:</b> Il tuo cuore ruggisce, pronto a donare e ricevere passione ardente. Sii audace, lascia che la tua luce guidi ogni emozione.\n<b>Lavoro:</b> La tua leadership brilla. Idee innovative aprono nuove strade; la perseveranza premia ogni sforzo. Non temere di osare.\n<b>Fortuna:</b> Un vento favorevole soffia, portando inattese opportunità. Afferrale con fiducia e splendore, il successo è vicino.",
    "Vergine": "<b>Amore:</b> Un filo sottile tesse intese profonde, cerca la tenerezza nascosta in sguardi e silenzi.\n<b>Lavoro:</b> La tua meticolosa dedizione illumina percorsi, piccoli successi si manifestano con chiarezza.\n<b>Fortuna:</b> Un'eco lontana porta opportunità inattese. Segui il soffio di un'ispirazione improvvisa.",
    "Bilancia": "<b>Amore:</b> Un soffio gentile accarezza i vostri legami, donando armonia e intesa profonda. Il dialogo sincero rafforza ogni ponte.\n<b>Lavoro:</b> La vostra naturale diplomazia risolve ogni incertezza, aprendo varchi inaspettati verso il successo. Collaborazioni fruttuose all'orizzonte.\n<b>Fortuna:</b> Un raggio di luce illumina il vostro percorso, guidandovi verso opportunità celate. Abbracciate le piccole gioie quotidiane.",
    "Scorpione": "<b>Amore:</b> Il cuore sussurra segreti, l'intesa si fa profonda, accendendo fiamme inaspettate.\n<b>Lavoro:</b> Nel cammino professionale, la tua acutezza svela opportunità celate, permettendoti mosse decisive.\n<b>Fortuna:</b> Guidata da un'intuizione sottile, ti sorride da angoli inattesi, portando doni silenziosi.",
    "Sagittario": "<b>Amore:</b> Un soffio gentile accende la fiamma, unendo anime in un ballo sincero. Lascia che il cuore guidi la tua voce, rivelando connessioni profonde.\n<b>Lavoro:</b> La mente agile scopre sentieri inesplorati. Un'intuizione profonda illumina il cammino, portando riconoscimento meritato e nuove prospettive.\n<b>Fortuna:</b> Stelle propizie sussurrano opportunità inattese. Sii pronto ad accogliere doni celesti, la sorte ti sorride con leggerezza.",
    "Capricorno": "<b>Amore:</b> Un legame si approfondisce, le parole non dette trovano eco nel cuore. Dona e ricevi affetto con sincerità luminosa.\n<b>Lavoro:</b> La tua perseveranza è una roccia. Affronta le sfide con metodo, un piccolo traguardo si delinea all'orizzonte.\n<b>Fortuna:</b> Un soffio leggero di buona sorte ti accarezza. Presta attenzione ai segnali, un'opportunità inattesa potrebbe apparire.",
    "Acquario": "Errore API Gemini: 429 RESOURCE_EXHAUSTED. {'error': {'code': 429, 'message': 'You exceeded your current quota, please check your plan and billing details. For more information on this error, head to: https://ai.google.dev/gemini-api/docs/rate-limits.\\n* Quota exceeded for metric: generativelanguage.googleapis.com/generate_content_free_tier_requests, limit: 10\\nPlease retry in 25.257180425s.', 'status': 'RESOURCE_EXHAUSTED', 'details': [{'@type': 'type.googleapis.com/google.rpc.QuotaFailure', 'violations': [{'quotaMetric': 'generativelanguage.googleapis.com/generate_content_free_tier_requests', 'quotaId': 'GenerateRequestsPerMinutePerProjectPerModel-FreeTier', 'quotaDimensions': {'location': 'global', 'model': 'gemini-2.5-flash'}, 'quotaValue': '10'}]}, {'@type': 'type.googleapis.com/google.rpc.Help', 'links': [{'description': 'Learn more about Gemini API quotas', 'url': 'https://ai.google.dev/gemini-api/docs/rate-limits'}]}, {'@type': 'type.googleapis.com/google.rpc.RetryInfo', 'retryDelay': '25s'}]}}",
    "Pesci": "<b>Amore:</b> Il cuore sussurra melodie profonde, ascolta i segreti dell'anima gemella. Un velo di magia avvolge i tuoi incontri, rendendoli speciali.\n<b>Lavoro:</b> L'intuizione è la tua guida più fedele; lasciati ispirare e vedrai fiorire i progetti con grazia. La creatività ti eleva.\n<b>Fortuna:</b> Un vento benevolo soffia, portando sorprese inaspettate. Sii ricettivo, un piccolo dono ti attende all'orizzonte."
  },
  "2025-10-17": {
    "Ariete": "<b>Amore:</b> Oggi, l'amore danza su corde vibranti; un incontro inatteso o una profonda connessione rinvigorirà il tuo spirito.\n<b>Lavoro:</b> La tua audacia è premiata: abbraccia nuove sfide, la leadership ti si addice, portando successi inattesi.\n<b>Fortuna:</b> Sussurra segreti al tuo orecchio, offrendo un'opportunità. Segui l'intuizione, un piccolo rischio paga grandi dividendi.",
    "Toro": "<b>Amore:</b> Un'intesa profonda illumina i tuoi legami, nutrendo il cuore con tenerezza. Nuove connessioni o vecchie fiamme si rafforzano.\n<b>Lavoro:</b> La tua tenacia è premiata; progetti e sforzi costanti portano frutti concreti. Consolida le tue posizioni con fiducia.\n<b>Fortuna:</b> Un soffio gentile ti accompagna, portando piccole gioie inattese o un senso di serena abbondanza. Afferra l'opportunità.",
    "Gemelli": "<b>Amore:</b> Un vento leggero soffia su cuori e parole, favorendo intese brillanti o nuove scintille. Ascolta e fatti ascoltare con grazia.\n<b>Lavoro:</b> Le idee fioriscono rapide; la tua agilità mentale apre porte inaspettate. Sfrutta la tua versatilità.\n<b>Fortuna:</b> Trova la tua chance nell'incontro, nella risata, in un inatteso scambio di vedute che illumina il cammino.",
    "Cancro": "<b>Amore</b>: Un'intesa profonda si tesse nell'aria, invitando il tuo cuore a fiorire in dolci confidenze e gesti sinceri.\n<b>Lavoro</b>: L'intuito è la tua stella guida; fidati delle tue percezioni per navigare con successo tra le sfide quotidiane.\n<b>Fortuna</b>: Un velo di serenità scende inaspettato, portando un piccolo raggio di luce su un sentiero finora nascosto.",
    "Leone": "<b>Amore:</b> Il cuore splende, attraendo con calore regale. Un'intesa profonda illumina la giornata, regalandoti momenti preziosi e passione ardente.\n<b>Lavoro:</b> La tua energia creativa brilla. Guida con audacia, le idee si affermano e la leadership naturale apre nuove vie al successo.\n<b>Fortuna:</b> Una ventata d'oro ti accarezza. Cogli al volo opportunità inattese; la buona sorte è al tuo fianco, pronta a stupirti con doni.",
    "Vergine": "<b>Amore:</b> Un soffio di tenerezza accarezza il cuore, invitando a gesti gentili. Le parole non dette trovano oggi la loro dolce melodia, rafforzando legami.\n\n<b>Lavoro:</b> La precisione è la tua alleata. Un dettaglio apparentemente minore può rivelarsi la chiave per sbloccare progressi significativi. Focalizzati.\n\n<b>Fortuna:</b> Le stelle sorridono discretamente. Un piccolo imprevisto si trasforma in un'opportunità inattesa se colta con saggezza e flessibilità.",
    "Bilancia": "<b>Amore:</b> Un soffio d'armonia avvolge i vostri legami; cercate l'equilibrio nelle intese più profonde.\n<b>Lavoro:</b> La collaborazione è la chiave. Ogni decisione, se condivisa con equità, porterà frutti più abbondanti e giusti.\n<b>Fortuna:</b> Una scintilla inaspettata di buona sorte brilla attraverso incontri o riconoscimenti meritati.",
    "Scorpione": "<b>Amore:</b> L'intensità guida il vostro cuore; un legame si approfondisce o una verità affiora, chiedendo coraggio.\n<b>Lavoro:</b> La vostra acuta percezione svela opportunità nascoste; siate strategici e pazienti.\n<b>Fortuna:</b> Vi sorride con inattese svolte, beneficiando chi sa adattarsi e credere nel proprio intuito.",
    "Sagittario": "<b>Amore:</b> Il cuore danzerà al ritmo di intese inattese, un filo d'oro lega anime affini. Apriti alla dolcezza.\n<b>Lavoro:</b> La mente acuta svela percorsi nuovi; la perseveranza aprirà porte insperate. Affronta le sfide con slancio.\n<b>Fortuna:</b> Un soffio gentile porterà doni celati, sii pronto ad accogliere il favore del destino. Opportunità inaspettate ti attendono.",
    "Capricorno": "<b>Amore:</b> Un soffio di tenerezza riscalda il cuore, rendendo ogni legame più profondo. Cerca la sintonia nelle piccole attenzioni.\n<b>Lavoro:</b> La tua dedizione porta frutti inaspettati. Una strategia lucida apre nuove vie, sii costante e vedrai risultati.\n<b>Fortuna:</b> Un piccolo colpo di scena positivo illumina la tua giornata, forse un aiuto insperato o una piacevole scoperta.",
    "Acquario": "<b>Amore:</b> Un vento di novità accarezza il cuore, portando dolci intese e comprensione reciproca. Apri la mente a nuove connessioni.\n<b>Lavoro:</b> Idee brillanti emergono dall'ombra, pronte a illuminare il tuo percorso. Non temere di presentare soluzioni originali.\n<b>Fortuna:</b> Una scintilla inaspettata accende la via, suggerendo opportunità da cogliere con fiducia e un pizzico di audacia.",
    "Pesci": "<b>Amore:</b> I sentimenti danzano leggeri, portando dolci armonie e comprensione profonda. Un incontro inatteso può svelare nuove emozioni sincere.\n<b>Lavoro:</b> La tua intuizione è una bussola preziosa. Segui il flusso creativo; nuove idee fioriranno con facilità, guidando i tuoi passi.\n<b>Fortuna:</b> Un piccolo segno, una felice coincidenza, illumina il tuo cammino, offrendo un inatteso spiraglio di speranza."
  },
  "2025-10-18": {
    "Ariete": "<b>Amore</b>: Un'onda di tenerezza avvolge il cuore, promettendo intese sincere e riscoperta passione. Lasciatevi guidare dall'istinto.\n<b>Lavoro</b>: Nel turbine delle idee, una chiarezza improvvisa illumina il percorso, spingendovi verso traguardi inaspettati. Osate con fiducia.\n<b>Fortuna</b>: La sorte vi sorride con un piccolo segno, una coincidenza che apre nuove prospettive o alleggerisce un peso. Cogliete l'attimo.",
    "Toro": "<b>Amore</b>: Un tocco gentile risveglia il cuore, profondo il legame che oggi vibra sereno.\n<b>Lavoro</b>: La costanza guida ogni passo, seminando successi che presto fioriranno.\n<b>Fortuna</b>: Un piccolo dono inatteso illumina il cammino, accogli la grazia del momento.",
    "Gemelli": "<b>Amore:</b> Le parole volano leggere, tessendo fili d'intesa profonda. Un dialogo sincero rafforza legami esistenti o ne accende di nuovi con grazia inaspettata.\n\n<b>Lavoro:</b> La mente è un faro di idee. Condividile apertamente; la collaborazione porta frutti inattesi. La comunicazione è la chiave del successo odierno.\n\n<b>Fortuna:</b> Un incontro casuale o una chiacchierata spensierata possono svelare un'opportunità nascosta. Sii ricettivo ai messaggi velati dal quotidiano.",
    "Cancro": "<b>Amore:</b> Un'onda di tenerezza accarezza il vostro cuore. Condividete emozioni sincere, rafforzando legami preziosi o incontrando una dolce affinità.\n<b>Lavoro:</b> L'intuizione è la vostra guida segreta; fidatevi di essa per superare sfide e cogliere opportunità inattese.\n<b>Fortuna:</b> Un soffio leggero di buona sorte vi accompagnerà. Prestare attenzione ai dettagli porterà sorprese piacevoli.",
    "Leone": "<b>Amore:</b> La passione si accende, portando calore e intesa profonda. Un gesto inaspettato parlerà al cuore, rafforzando legami preziosi.\n<b>Lavoro:</b> La tua visione guida il successo. Riconoscimenti in vista per l'impegno e la creatività, affronta le sfide con audacia regale.\n<b>Fortuna:</b> Un raggio di luce improvviso dissolve le incertezze. Una sorpresa positiva illumina il cammino, cogli l'attimo con fiducia.",
    "Vergine": "<b>Amore:</b> Un velo sottile si solleva, rivelando intese più profonde. Lasciate che il cuore parli con gesti delicati, la sincerità sarà la vostra guida.\n<b>Lavoro:</b> La vostra dedizione porta frutti. La chiarezza d'intenti guida decisioni importanti, aprendo la strada a un meritato riconoscimento.\n<b>Fortuna:</b> Un soffio gentile di casualità benevola illumina la giornata, portando piccoli, inattesi favori che rallegrano lo spirito.",
    "Bilancia": "Un soffio gentile accarezza il tuo cuore, portando momenti di <b>Amore</b> e intesa profonda. Nel <b>Lavoro</b>, le tue doti diplomatiche fioriscono, aprendo strade a collaborazioni fruttuose e decisioni equilibrate. La <b>Fortuna</b> ti sorride con piccole, inattese armonie, guidandoti verso la serenità.",
    "Scorpione": "<b>Amore:</b> Un velo si solleva, rivelando profondità insperate. Connessioni autentiche fioriscono nel silenzio, nutrite dalla verità del cuore.\n<b>Lavoro:</b> La tua intuizione è una bussola affidabile. Affronta le sfide con astuzia, scorgendo opportunità dove altri vedono ostacoli.\n<b>Fortuna:</b> Un'ombra svela un tesoro nascosto. Fidati del tuo istinto, ti guiderà verso un inatteso vantaggio.",
    "Sagittario": "<b>Amore:</b> Un vento gentile soffia sui cuori, portando scintille e nuove intese. Lascia che l'anima si apra a dolci sussurri inattesi.\n<b>Lavoro:</b> La tua visione acuta illumina il percorso. Le sfide si trasformano in opportunità, guidate dalla tua audacia e spirito libero.\n<b>Fortuna:</b> Una stella benevola ti sorride, promettendo esiti favorevoli e un tocco di magia nel quotidiano. Cogli l'attimo con fiducia.",
    "Capricorno": "<b>Amore:</b> Il cuore oggi trova un porto sicuro, la tenerezza fiorisce in gesti inattesi, rafforzando un legame prezioso.\n<b>Lavoro:</b> La tua dedizione porta frutti maturi. Nuove opportunità si delineano all'orizzonte, da cogliere con acume.\n<b>Fortuna:</b> Un pizzico di buona sorte illumina il tuo percorso. Sii attento ai doni inaspettati del destino.",
    "Acquario": "<b>Amore:</b> L'aria si carica di intesa, i legami si rafforzano con un tocco inatteso. Apri il cuore a nuove, dolci armonie, lasciandoti guidare dalla tenerezza.\n<b>Lavoro:</b> La mente brilla, generando idee innovative. Un progetto prende slancio grazie alla tua visione unica. Non temere di osare, la tua creatività è una guida.\n<b>Fortuna:</b> Una piccola coincidenza si rivela un portale verso inaspettate opportunità. Segui l'istinto, il destino ti sorride con leggerezza e promesse.",
    "Pesci": "Errore API Gemini: 429 RESOURCE_EXHAUSTED. {'error': {'code': 429, 'message': 'You exceeded your current quota, please check your plan and billing details. For more information on this error, head to: https://ai.google.dev/gemini-api/docs/rate-limits.\\n* Quota exceeded for metric: generativelanguage.googleapis.com/generate_content_free_tier_requests, limit: 10\\nPlease retry in 12.048883923s.', 'status': 'RESOURCE_EXHAUSTED', 'details': [{'@type': 'type.googleapis.com/google.rpc.QuotaFailure', 'violations': [{'quotaMetric': 'generativelanguage.googleapis.com/generate_content_free_tier_requests', 'quotaId': 'GenerateRequestsPerMinutePerProjectPerModel-FreeTier', 'quotaDimensions': {'location': 'global', 'model': 'gemini-2.5-flash'}, 'quotaValue': '10'}]}, {'@type': 'type.googleapis.com/google.rpc.Help', 'links': [{'description': 'Learn more about Gemini API quotas', 'url': 'https://ai.google.dev/gemini-api/docs/rate-limits'}]}, {'@type': 'type.googleapis.com/google.rpc.RetryInfo', 'retryDelay': '12s'}]}}"
  },
  "2025-10-19": {
    "Ariete": "<b>Amore:</b> La passione arde, un legame si fa più intenso. Lasciati guidare dal cuore per momenti di profonda connessione.\n\n<b>Lavoro:</b> La tua energia è una forza propulsiva. Affronta con audacia le sfide, un progetto prende forma con successo inaspettato.\n\n<b>Fortuna:</b> Un piccolo, piacevole imprevisto illumina la giornata, portando con sé un sorriso e una ventata di leggerezza.",
    "Toro": "<b>Amore:</b> Un soffio gentile ravviva legami antichi, portando armonia e intesa profonda. Condividi un sorriso, rafforzerai il cuore.\n<b>Lavoro:</b> La tua dedizione porta frutti concreti. Nuove opportunità si presentano, richiedendo la tua solida attenzione.\n<b>Fortuna:</b> Un piccolo dono del destino illumina la giornata, inatteso e piacevole. Sii ricettivo alle dolci sorprese.",
    "Gemelli": "<b>Amore:</b> I cuori comunicano con rara intesa, ogni parola un ponte. Lasciate che la tenerezza guidi le vostre espressioni. Un dialogo profondo vi attende.\n<b>Lavoro:</b> La mente è agile, pronta a cogliere sfumature e tessere nuove alleanze. Le idee volano alte, portando frutti inattesi. Collaborate con successo.\n<b>Fortuna:</b> Un'intuizione improvvisa illumina il cammino, rivelando un'opportunità sottile ma preziosa. Seguite quel barlume interiore.",
    "Cancro": "<b>Amore:</b> Le tue emozioni profonde risplendono, creando un'aura calda. È tempo di connettersi davvero, il cuore parla chiaro e rafforza i legami.\n<b>Lavoro:</b> La tua intuizione è una guida preziosa. Ascoltala, specialmente in decisioni che richiedono delicatezza. Un piccolo passo può fare la differenza.\n<b>Fortuna:</b> Oggi si annida negli spazi familiari, nelle piccole gioie quotidiane. Riconosci la serenità che ti circonda.",
    "Leone": "<b>Amore:</b> Un ardore antico riaccende la fiamma. Sentimenti profondi chiedono espressione sincera, apri il cuore.\n<b>Lavoro:</b> La tua leadership brilla. Opportunità inattese si presentano, cogli l'attimo con audacia e visione.\n<b>Fortuna:</b> Un raggio di sole inaspettato illumina il cammino. Fidati del tuo istinto, porta doni preziosi.",
    "Vergine": "<b>Amore:</b> Il cuore risuona di dolci armonie, un invito ad accogliere connessioni profonde e sincere.\n<b>Lavoro:</b> La tua precisione illumina sentieri complessi, rendendo chiare le sfide da affrontare con ingegno.\n<b>Fortuna:</b> Un barlume inaspettato guida i tuoi passi. Abbraccia le intuizioni, oggi sono preziosi alleati per scelte sagge.",
    "Bilancia": "Oggi il cuore trova il suo ritmo: l'<b>Amore</b> danza tra comprensione e gesti gentili, rafforzando legami o accendendo nuove scintille. Nel <b>Lavoro</b>, la collaborazione fiorisce; le tue idee portano equilibrio e soluzioni innovative. Sii aperto. La <b>Fortuna</b> ti sorride con piccole sincronicità, guidandoti verso scelte armoniose. Ascolta la tua intuizione.",
    "Scorpione": "<b>Amore:</b> Le profondità del cuore si rivelano; un legame si intensifica, o un'emozione nascosta affiora, chiedendo di essere esplorata con onestà e coraggio.\n<b>Lavoro:</b> La tua acutezza scorge soluzioni dove altri vedono ostacoli. Un progetto richiede la tua inesauribile tenacia per essere ultimato.\n<b>Fortuna:</b> Una brezza sottile porta un'opportunità inattesa; fidati del tuo istinto, la guida più vera in questo giorno sorprendente.",
    "Sagittario": "Un soffio d'amore carezza l'anima, apri il cuore alle sfumature più dolci. Nel <b>lavoro</b>, un'intuizione illumina nuove vie, segui la scintilla della creatività con fiducia. La <b>fortuna</b> danza leggera al tuo fianco, pronta a svelare doni inattesi sotto cieli sereni. Accogli le meraviglie di questo giorno.",
    "Capricorno": "<b>Amore:</b> Il cuore si apre a nuove comprensioni, rafforzando legami esistenti e accogliendo dolci affinità. Ascolta le emozioni.\n<b>Lavoro:</b> La tua perseveranza costruisce ponti solidi. Affronta le sfide con metodo, il successo è a portata di mano.\n<b>Fortuna:</b> Un piccolo, inatteso favore illumina la tua giornata, portando un tocco di leggerezza e opportunità.",
    "Acquario": "<b>Amore:</b> Un'onda di tenerezza inattesa avvolge il tuo spirito libero. Apri il cuore a nuove risonanze d'affetto, chiare e profonde.\n<b>Lavoro:</b> La tua visione unica illumina il cammino professionale. Sii audace nelle proposte, i frutti matureranno presto.\n<b>Fortuna:</b> La fortuna danza leggera, portando un dono inatteso. L'universo ti sorride, sii pronto a riceverlo.",
    "Pesci": "Errore API Gemini: 429 RESOURCE_EXHAUSTED. {'error': {'code': 429, 'message': 'You exceeded your current quota, please check your plan and billing details. For more information on this error, head to: https://ai.google.dev/gemini-api/docs/rate-limits.\\n* Quota exceeded for metric: generativelanguage.googleapis.com/generate_content_free_tier_requests, limit: 10\\nPlease retry in 13.240175304s.', 'status': 'RESOURCE_EXHAUSTED', 'details': [{'@type': 'type.googleapis.com/google.rpc.QuotaFailure', 'violations': [{'quotaMetric': 'generativelanguage.googleapis.com/generate_content_free_tier_requests', 'quotaId': 'GenerateRequestsPerMinutePerProjectPerModel-FreeTier', 'quotaDimensions': {'model': 'gemini-2.5-flash', 'location': 'global'}, 'quotaValue': '10'}]}, {'@type': 'type.googleapis.com/google.rpc.Help', 'links': [{'description': 'Learn more about Gemini API quotas', 'url': 'https://ai.google.dev/gemini-api/docs/rate-limits'}]}, {'@type': 'type.googleapis.com/google.rpc.RetryInfo', 'retryDelay': '13s'}]}}"
  },
  "2025-10-20": {
    "Ariete": "<b>Amore:</b> Un'energia vibrante accende i vostri sentimenti, favorendo incontri intensi o ravvivando la passione esistente. Seguite il vostro cuore audace.\n<b>Lavoro:</b> La determinazione è la vostra alleata; superate ogni ostacolo con slancio, nuove opportunità si delineano all'orizzonte per chi osa.\n<b>Fortuna:</b> Una brezza leggera porta con sé piccole sorprese inaspettate. Siate pronti a cogliere al volo ogni dono del destino.",
    "Toro": "<b>Amore:</b> Un soffio gentile accende intese profonde, il cuore cerca e trova armonia nelle piccole cose. <b>Lavoro:</b> La tua tenacia apre nuove strade inattese, idee brillanti germogliano. La dedizione porta a frutti concreti. <b>Fortuna:</b> Un piccolo dono inatteso o un'opportunità velata si affaccia all'orizzonte. Sii attento ai dettagli.",
    "Gemelli": "<b>Amore:</b> Un'aura di comprensione avvolge i tuoi legami, portando armonia. Ogni piccola incomprensione si dissolve con dolci sussurri, rafforzando l'intesa.\n<b>Lavoro:</b> La tua intelligenza acuta apre nuove porte. Idee brillanti attirano successi, specialmente in progetti che richiedono agilità mentale e comunicazione efficace.\n<b>Fortuna:</b> Una stella benevola ti sorride, regalando piccole coincidenze felici. Attendi sorprese inaspettate che porteranno leggerezza e sorrisi al tuo cammino.",
    "Cancro": "<b>Amore:</b> Un'onda di tenerezza accarezza il tuo cuore. Condividi emozioni sincere, la vicinanza scalderà l'anima e rinsalderà legami preziosi.\n<b>Lavoro:</b> La tua intuizione è una guida fedele. Coltiva i progetti con dedizione, i frutti matureranno grazie alla tua cura meticolosa e paziente.\n<b>Fortuna:</b> Una luce discreta ti accompagna. Trova gioia nei piccoli gesti quotidiani, la protezione è più vicina di quanto credi, serena e avvolgente.",
    "Leone": "<b>Amore:</b> La tua luce interiore attira. Un legame speciale si rafforza, scaldando il cuore con intesa profonda e gesti sinceri.\n<b>Lavoro:</b> La tua energia creativa emerge potente. Guida con coraggio; le tue idee brillanti riceveranno il meritato riconoscimento.\n<b>Fortuna:</b> Un'opportunità inaspettata si palesa. Segui l'intuizione, trasformando un semplice auspicio in un successo tangibile.",
    "Vergine": "<b>Amore:</b> Un tocco di armonia riscalda il cuore, portando comprensione inaspettata. Lasciatevi cullare dalla dolcezza dei gesti più semplici.\n<b>Lavoro:</b> La vostra precisione viene notata. Un piccolo passo avanti apre nuove prospettive; mantenete la concentrazione sui dettagli cruciali.\n<b>Fortuna:</b> Una serena coincidenza illumina la giornata, offrendo un momento di quiete e una piccola, gradita sorpresa proprio quando meno ve l'aspettate.",
    "Bilancia": "<b>Amore:</b> Nel cuore, un soffio leggero di comprensione ravviva legami, offrendo armonia e una dolce intesa.\n<b>Lavoro:</b> Sul fronte professionale, intuizioni fresche guidano scelte sagge, aprendo vie inattese al successo. Fidati del tuo equilibrio.\n<b>Fortuna:</b> La sorte sorride con piccole gioie inaspettate, un velo di ottimismo illumina il cammino. Accogli ogni dono.",
    "Scorpione": "<b>Amore:</b> I fili del destino si annodano in intese profonde. Ascolta il cuore, la passione attende chi sa osare con sincerità.\n<b>Lavoro:</b> La tua perspicacia è una bussola preziosa. Strategie silenziose portano a vittorie inattese, valorizzando ogni tuo sforzo.\n<b>Fortuna:</b> Un'onda inaspettata porta doni celati. Abbraccia il cambiamento; la resilienza attira benefici sorprendenti.",
    "Sagittario": "<b>Amore:</b> Il cuore danza su un ritmo inatteso; un sussurro gentile rafforza legami o ne accende di nuovi. Sii ricettivo alle vibrazioni.\n<b>Lavoro:</b> La mente acuta trova soluzioni originali. Un progetto richiede la tua visione, portando frutti duraturi se seminato con cura.\n<b>Fortuna:</b> Una stella discreta ti guida, rivelando opportunità celate. Fidati dell'intuito per cogliere il dono del giorno.",
    "Capricorno": "<b>Amore:</b> Senti un soffio gentile accarezzare il cuore, invito ad aprirsi a dolci intese. La sincerità crea ponti preziosi.\n\n<b>Lavoro:</b> La tua roccia si fa scala; perseveranza e chiarezza ti guidano al successo meritato. Le mete sono ora più vicine.\n\n<b>Fortuna:</b> Un velo di luce inattesa illumina il cammino, portando piccole ma preziose armonie. Accogli la serena sorpresa.",
    "Acquario": "<b>Amore:</b> Un soffio d'armonia risveglia i sensi, dialoghi sinceri tessono nuove intese. Apri il cuore a connessioni profonde.\n<b>Lavoro:</b> L'ingegno brilla, progetti audaci prendono forma. Condividi le tue visioni, l'innovazione è la tua forza.\n<b>Fortuna:</b> Una brezza favorevole sospinge le tue scelte. Fidati dell'intuito; una piccola rivelazione ti guida.",
    "Pesci": "Errore API Gemini: 429 RESOURCE_EXHAUSTED. {'error': {'code': 429, 'message': 'You exceeded your current quota, please check your plan and billing details. For more information on this error, head to: https://ai.google.dev/gemini-api/docs/rate-limits.\\n* Quota exceeded for metric: generativelanguage.googleapis.com/generate_content_free_tier_requests, limit: 10\\nPlease retry in 46.470604278s.', 'status': 'RESOURCE_EXHAUSTED', 'details': [{'@type': 'type.googleapis.com/google.rpc.QuotaFailure', 'violations': [{'quotaMetric': 'generativelanguage.googleapis.com/generate_content_free_tier_requests', 'quotaId': 'GenerateRequestsPerMinutePerProjectPerModel-FreeTier', 'quotaDimensions': {'model': 'gemini-2.5-flash', 'location': 'global'}, 'quotaValue': '10'}]}, {'@type': 'type.googleapis.com/google.rpc.Help', 'links': [{'description': 'Learn more about Gemini API quotas', 'url': 'https://ai.google.dev/gemini-api/docs/rate-limits'}]}, {'@type': 'type.googleapis.com/google.rpc.RetryInfo', 'retryDelay': '46s'}]}}"
  },
  "2025-10-21": {
    "Ariete": "<b>Amore:</b> Il cuore pulsa di nuove promesse, un dialogo sincero può schiudere orizzonti inattesi. Non temere di mostrare la tua autenticità.\n<b>Lavoro:</b> La tua determinazione è una freccia che colpisce il bersaglio. Affronta le sfide con coraggio, il successo è a portata di mano.\n<b>Fortuna:</b> Un piccolo colpo di scena positivo illumina la giornata, un'intuizione ti guiderà verso la scelta giusta.",
    "Toro": "<b>Amore:</b> Sentimenti profondi fioriscono, invitandovi a nutrire con tenerezza i legami più cari. L'armonia regna, rafforzando ogni connessione.\n<b>Lavoro:</b> La vostra risolutezza scava solchi fertili; perseveranza e pragmatismo portano frutti concreti e stabili ai vostri sforzi.\n<b>Fortuna:</b> Un'aura benevola vi accarezza, rivelando piccole opportunità inattese e una serenità che scalda l'anima.",
    "Gemelli": "<b>Amore:</b> Un filo invisibile lega i cuori; le parole scambiate portano dolci armonie e comprensione profonda.\n<b>Lavoro:</b> La mente è agile, pronta a tessere nuove idee. La collaborazione apre porte inaspettate verso il successo.\n<b>Fortuna:</b> Un leggero bacio del destino ti sfiora, portando una serena sorpresa o un momento di inattesa pace.",
    "Cancro": "<b>Amore:</b> Le acque del cuore si calmano, portando chiarezza e un abbraccio caldo. Ascolta le vibrazioni sottili di chi ti è vicino.\n\n<b>Lavoro:</b> La tua intuizione è una guida preziosa. Segui quel sesto senso per sciogliere piccoli nodi e trovare soluzioni inaspettate.\n\n<b>Fortuna:</b> Un piccolo gesto inatteso o una felice coincidenza allieterà la tua giornata, portando un sorriso discreto e un pizzico di serenità.",
    "Leone": "<b>Amore:</b> La tua fiamma interiore risplende, accendendo nuove passioni o rafforzando legami esistenti con calore e profonda intesa.\n<b>Lavoro:</b> La tua ambizione è un faro. Idee audaci trovano terreno fertile, portando riconoscimento e progressi inaspettati.\n<b>Fortuna:</b> Un vento favorevole soffia, portando chiarezza nelle decisioni e aprendo porte verso opportunità luminose.",
    "Vergine": "<b>Amore:</b> Il cuore si apre a dolci intese, un dialogo sincero rafforza legami o ne accende di nuovi, portando armonia.\n<b>Lavoro:</b> La tua precisione è un faro. Progetti complessi si svelano, e il tuo impegno costante porterà frutti e riconoscimenti meritati.\n<b>Fortuna:</b> Una brezza leggera ti sfiora. Sii attento ai piccoli segni del destino che guidano verso opportunità inattese. Cogli l'attimo.",
    "Bilancia": "<b>Amore:</b> Una brezza gentile accarezza il cuore, invitando a sguardi profondi e connessioni inattese. L'intesa si fa più forte.\n<b>Lavoro:</b> Le tue idee brillano, portando equilibrio e armonia. Le collaborazioni fluiscono con grazia, favorendo progressi significativi.\n<b>Fortuna:</b> Un velo sottile di possibilità avvolge la giornata. Fidati dell'intuizione, ti guiderà verso scelte sagge e felici.",
    "Scorpione": "<b>Amore:</b> Un velo di mistero avvolge i sentimenti, invitandoti a scoprire profondità inaspettate. L'anima gemella risponde al tuo richiamo silente.\n<b>Lavoro:</b> La tua acutezza mentale è una gemma preziosa. Fidati dell'istinto per superare ostacoli e cogliere intuizioni brillanti.\n<b>Fortuna:</b> Un sussurro del destino ti guida verso un'opportunità celata. Resta vigile, un inatteso dono è in arrivo.",
    "Sagittario": "<b>Amore:</b> Un soffio gentile accarezza il cuore, tessendo fili d'intesa. L'armonia sboccia nei dialoghi sinceri, avvicinando le anime.\n<b>Lavoro:</b> La mente è lucida, pronta a cogliere intuizioni brillanti. Semina oggi con fiducia e audacia, i frutti matureranno con pazienza.\n<b>Fortuna:</b> Un raggio inatteso illumina il cammino. Accogli i piccoli doni del caso; la sorte oggi ti sorride lievemente, porta nuove opportunità.",
    "Capricorno": "<b>Amore:</b> Un velo si solleva, rivelando affetti sinceri. Il cuore si apre a dolci intese, tessendo nuovi legami o rafforzando quelli esistenti.\n<b>Lavoro:</b> Nel lavoro, la tua dedizione illumina il cammino. Un'idea chiara emerge, conducendo i tuoi passi verso un successo tangibile e meritato.\n<b>Fortuna:</b> Una stella benevola ti sorride, portando un inatteso favore. Cogli la luce del destino che ora brilla per te.",
    "Acquario": "Errore API Gemini: 429 RESOURCE_EXHAUSTED. {'error': {'code': 429, 'message': 'You exceeded your current quota, please check your plan and billing details. For more information on this error, head to: https://ai.google.dev/gemini-api/docs/rate-limits.\\n* Quota exceeded for metric: generativelanguage.googleapis.com/generate_content_free_tier_requests, limit: 10\\nPlease retry in 9.830523975s.', 'status': 'RESOURCE_EXHAUSTED', 'details': [{'@type': 'type.googleapis.com/google.rpc.QuotaFailure', 'violations': [{'quotaMetric': 'generativelanguage.googleapis.com/generate_content_free_tier_requests', 'quotaId': 'GenerateRequestsPerMinutePerProjectPerModel-FreeTier', 'quotaDimensions': {'location': 'global', 'model': 'gemini-2.5-flash'}, 'quotaValue': '10'}]}, {'@type': 'type.googleapis.com/google.rpc.Help', 'links': [{'description': 'Learn more about Gemini API quotas', 'url': 'https://ai.google.dev/gemini-api/docs/rate-limits'}]}, {'@type': 'type.googleapis.com/google.rpc.RetryInfo', 'retryDelay': '9s'}]}}",
    "Pesci": "<b>Amore:</b> Le correnti emotive si fanno più intense, portando dolci sussurri al tuo cuore. Sii aperto alle connessioni profonde che il destino ti offre.\n<b>Lavoro:</b> La tua intuizione è una bussola preziosa. Segui i flussi creativi; un'idea sognata può ora prendere forma concreta.\n<b>Fortuna:</b> Piccoli segnali dall'universo guidano i tuoi passi. Abbraccia le coincidenze, portano doni inaspettati."
  },
  "2025-10-22": {
    "Ariete": "<b>Amore:</b> Un soffio di passione ravviva legami antichi, o ne accende di nuovi con dolce intensità. Ascolta il tuo cuore.\n<b>Lavoro:</b> Le tue idee brillano, portando riconoscimento. Affronta le sfide con audacia, il successo è a portata di mano.\n<b>Fortuna:</b> Un piccolo colpo di scena inatteso ti sorriderà, illuminando la tua giornata con un tocco di pura gioia.",
    "Toro": "<b>Amore:</b> L'affetto si veste di sfumature delicate, invitandoti a condividere o a nutrire l'armonia interiore. Sii presente, il cuore ti guiderà.\n<b>Lavoro:</b> La tua tenacia è una virtù preziosa; affronta le sfide con calma, i frutti non tarderanno. La precisione premia i tuoi sforzi.\n<b>Fortuna:</b> Un piccolo, piacevole imprevisto alleggerisce la giornata, portando un sorriso inaspettato e un tocco di leggerezza.",
    "Gemelli": "<b>Amore:</b> L'aria vibra di parole non dette, pronte a svelare un sentimento. Ascolta il cuore e lascia che la verità ti guidi verso una connessione più profonda.\n<b>Lavoro:</b> La mente è agile, tessendo trame di idee brillanti. Condividi i tuoi pensieri; una sinergia inattesa porterà frutti insperati.\n<b>Fortuna:</b> Un soffio leggero porta con sé una sorpresa gradita. Sii veloce a notarla e ad afferrare il suo dono inaspettato.",
    "Cancro": "<b>Amore:</b> Un'onda di dolcezza avvolge il cuore, favorendo connessioni autentiche e gesti di profonda cura. L'intesa si rafforza.\n<b>Lavoro:</b> L'intuito è la tua bussola più affidabile. Piccole attenzioni oggi creano solide basi per il futuro professionale.\n<b>Fortuna:</b> Una scintilla inattesa illumina dettagli sereni. Si cela in momenti di quiete, portando un sorriso dal destino.",
    "Leone": "<b>Amore:</b> Il cuore arde di un calore speciale; cercate l'intesa profonda che eleva l'anima e scalda i sensi.\n<b>Lavoro:</b> La vostra luce guida illumina il cammino. Riconoscimenti e opportunità brillano, mostrando il frutto del vostro impegno.\n<b>Fortuna:</b> Un raggio inatteso di gioia vi sorride, portando piccole, luminose sorprese a rallegrare la giornata.",
    "Vergine": "Un soffio di tenerezza riscalda il cuore, tessendo fili d'intesa profonda.\n<b>Amore:</b> Ascolta i segnali sottili, un legame fiorisce con grazia.\n<b>Lavoro:</b> La tua precisione è stella guida, portando frutti inaspettati. Ogni dettaglio conta.\n<b>Fortuna:</b> Un piccolo, sereno raggio di luce illumina il tuo cammino, portando un sorriso inatteso.",
    "Bilancia": "<b>Amore:</b> L'armonia danzerà nei vostri cuori, tessendo fili d'intesa con chi amate. Un gesto gentile accende nuove scintille.\n<b>Lavoro:</b> Collaborazioni si rivelano particolarmente proficue; la vostra diplomazia aprirà porte inaspettate. Mantenete l'equilibrio.\n<b>Fortuna:</b> Una brezza leggera porta opportunità inattese; fidatevi della vostra intuizione per coglierle al volo.",
    "Scorpione": "<b>Amore:</b> Un velo si solleva, rivelando sentimenti profondi. La sincerità rafforza legami indissolubili.\n<b>Lavoro:</b> La tua perspicacia è una guida infallibile. Decisioni oculate aprono nuove vie al successo duraturo.\n<b>Fortuna:</b> Un raggio di luce improvvisa illumina il cammino, portando piccole ma significative gioie inattese.",
    "Sagittario": "<b>Amore:</b> I vostri cuori danzano, trovando armonia in un gesto inatteso. L'intesa fiorisce, portando calore e vicinanza.\n<b>Lavoro:</b> Un'idea brillante illumina il cammino. Siate audaci, l'ingegno è la vostra guida verso nuove conquiste.\n<b>Fortuna:</b> Il vento del destino soffia a vostro favore, aprendo porte inattese. Cogliete l'attimo propizio con fiducia.",
    "Capricorno": "<b>Amore:</b> Un velo di riserbo si solleva, rivelando connessioni profonde. Lasciatevi avvolgere da dolci armonie inaspettate che nutriranno il vostro spirito.\n\n<b>Lavoro:</b> La vostra dedizione incrollabile inizia a tessere i frutti attesi. Un'intuizione acuta guiderà decisioni importanti, spianando la strada verso il successo.\n\n<b>Fortuna:</b> Un soffio propizio vi accompagna, favorendo piccoli ma significativi vantaggi. Ascoltate l'istinto, vi condurrà verso opportunità serene.",
    "Acquario": "<b>Amore:</b> Un incontro fortuito o una conversazione profonda accende scintille inaspettate, portando armonia e intesa. Apriti al sorprendente.\n<b>Lavoro:</b> Le tue idee più innovative trovano fertile terreno. Non temere di osare, la tua visione porterà frutti. Collabora con fiducia.\n<b>Fortuna:</b> Un piccolo colpo di scena positivo si avvicina, forse da una fonte inattesa. Resta vigile, il destino ti sorride.",
    "Pesci": "<b>Amore:</b> Oggi, il cuore sente melodie segrete; un abbraccio o una parola dolce riaccende la fiamma. Le connessioni si approfondiscono con tenerezza.\n<b>Lavoro:</b> L'intuito guida decisioni complesse. Fidati della tua visione interiore per navigare le sfide e trovare soluzioni creative.\n<b>Fortuna:</b> La sorte sorride inaspettatamente, portando un piccolo dono o un'opportunità velata. Sii aperto alle meraviglie del giorno."
  },
  "2025-10-23": {
    "Ariete": "<b>Amore:</b> Una scintilla accende il cuore, il dialogo sincero porta dolcezza inattesa. Ascoltate e siate ascoltati.\n<b>Lavoro:</b> Le vostre idee brillanti trovano terreno fertile. Non esitate a proporre soluzioni innovative, otterranno ascolto.\n<b>Fortuna:</b> Un piccolo, inaspettato dono vi attende. Mantenete lo sguardo aperto alle coincidenze che aprono nuove vie.",
    "Toro": "<b>Amore:</b> Un tepore avvolge il cuore, invitando a gesti sinceri. La tenerezza condivisa fiorisce, rafforzando legami profondi con stabilità.\n<b>Lavoro:</b> La tua costanza getta basi solide. Progetti prendono forma concreta, la perseveranza è ricompensata da progressi stabili e meritati.\n<b>Fortuna:</b> Un soffio gentile del destino ti tocca. Piccole gioie inattese si rivelano, portando serenità e un senso di pace interiore.",
    "Gemelli": "<b>Amore:</b> Le parole tessono ponti; esprimi il tuo cuore con chiarezza e affetto, rafforzando i legami.\n<b>Lavoro:</b> La mente brilla, portando nuove idee; la collaborazione è chiave per avanzamenti inattesi.\n<b>Fortuna:</b> Ti sorride in un piccolo incontro inatteso, un dettaglio che illumina la giornata.",
    "Cancro": "<b>Amore:</b> I sentimenti si svelano con dolcezza, creando legami più profondi. Ascolta il cuore, ti guiderà verso dolci intese.\n<b>Lavoro:</b> La tua intuizione è una bussola preziosa oggi. Segui le idee creative, apriranno nuove, promettenti strade.\n<b>Fortuna:</b> Un'onda di serenità ti avvolge, portando piccole gioie inattese e opportunità luminose sul tuo cammino.",
    "Leone": "<b>Amore:</b> Oggi il cuore pulsa di ardore. Un raggio di sole scalda i legami, riaccendendo intese o portando tenerezza inaspettata.\n\n<b>Lavoro:</b> Sul fronte professionale, la tua luce guida. Mostra audacia; idee innovative troveranno terreno fertile e porteranno riconoscimenti.\n\n<b>Fortuna:</b> La buona sorte ti sorride con un dono inatteso. Cogli le opportunità celate, un piccolo gesto può trasformarsi in grande vantaggio.",
    "Vergine": "<b>Amore:</b> Un filo sottile connette i cuori; ascolta il richiamo dell'anima e offri la tua tenerezza. Un gesto inatteso porta calore.\n<b>Lavoro:</b> La tua precisione è un faro; ogni dettaglio curato ti avvicina a un traguardo meritato. Riconoscimenti discreti in arrivo.\n<b>Fortuna:</b> Una serena armonia ti avvolge, portando piccole gioie inaspettate e pace interiore. Segui l'intuizione.",
    "Bilancia": "<b>Amore:</b> Oggi, le stelle tessono fili sottili. Un <b>gesto inatteso</b> accende scintille, portando armonia o comprensione profonda in un legame.\n\n<b>Lavoro:</b> La tua innata eleganza strategica ti guida. <b>Decisioni ponderate</b> portano frutti inaspettati, creando equilibrio dove serve. Riconoscimenti discreti sono all'orizzonte.\n\n<b>Fortuna:</b> Una <b>leggera brezza</b> di fortuna ti sfiora, portando con sé occasioni sottili. Sii attento ai dettagli, una piccola coincidenza si rivelerà preziosa.",
    "Scorpione": "Un velo si solleva, rivelando la profondità di un sentimento, mentre la passione si intensifica. Ascolta il cuore.\n\nNel <b>lavoro</b>, la tua intuizione acuta è una bussola affidabile. Approfondisci le questioni, strategie astute portano a scoperte preziose.\n\nLa <b>fortuna</b> danza inaspettata, un sussurro del destino che si manifesta in piccole, significative coincidenze che aprono nuove vie.",
    "Sagittario": "<b>Amore:</b> Un soffio gentile accende la fiamma nel cuore, parole sincere tessono intese profonde. Lascia che la verità guidi le tue emozioni.\n<b>Lavoro:</b> La mente agile scopre sentieri nuovi, un'intuizione guida il passo verso il successo. Non temere di esplorare nuove prospettive.\n<b>Fortuna:</b> Un raggio di sole inatteso illumina il cammino, la sorte sorride con un dono discreto. Cogli l'attimo con gratitudine e ottimismo.",
    "Capricorno": "<b>Amore:</b> Un sussurro gentile risveglia il cuore, portando armonia inaspettata nei legami più cari. Ascolta e rispondi con calore.\n<b>Lavoro:</b> La tua dedizione costruisce ponti solidi; riconosci le opportunità che brillano sulla tua strada. La perseveranza sarà premiata.\n<b>Fortuna:</b> Un filo d'oro si tesse nella trama del giorno, offrendo un barlume di serenità inaspettata e piccole gioie.",
    "Acquario": "<b>Amore:</b> Un velo di dolcezza avvolge le relazioni, favorendo intese profonde. Un gesto inatteso può riaccendere la scintilla, portando chiarezza e connessione.\n<b>Lavoro:</b> Le tue idee brillanti trovano terreno fertile. Non esitare a proporre soluzioni innovative; la collaborazione è vincente. Giornata propizia per progetti a lungo termine.\n<b>Fortuna:</b> Piccoli segnali positivi ti guidano. Ascolta l'intuizione, potresti scoprire un'opportunità insospettata o un aiuto inatteso che facilita il cammino.",
    "Pesci": "<b>Amore:</b> I sentimenti fluiscono come un fiume sereno, portando dolci rivelazioni. Ascolta il cuore, la sua melodia è pura e guida i tuoi passi verso l'intesa.\n<b>Lavoro:</b> La tua intuizione è una bussola preziosa. Segui i suoi sussurri per navigare tra le sfide e trovare soluzioni creative che sorprendono.\n<b>Fortuna:</b> Un piccolo gesto inatteso illumina la tua giornata, portando un tocco di magia. Sii aperto alle sorprese che il destino ti riserva."
  },
  "2025-10-24": {
    "Ariete": "<b>Amore:</b> Una scintilla riaccende il fuoco, il cuore palpita al richiamo di un'emozione inattesa. Lasciatevi guidare dal desiderio più autentico.\n<b>Lavoro:</b> Energie rinnovate spingono all'azione. Un'idea audace trova il suo momento per sbocciare, portando frutti inattesi. Non temete di osare.\n<b>Fortuna:</b> Il destino sorride, tessendo fili d'oro. Un piccolo gesto può aprire porte immense. Siate pronti a cogliere l'attimo propizio.",
    "Toro": "<b>Amore:</b> Un soffio gentile accarezza il tuo cuore, la complicità fiorisce in gesti semplici e profondi. Apriti alla dolcezza.\n<b>Lavoro:</b> La tua tenacia è premiata; un progetto prende forma solida. Non temere di osare, la stabilità è vicina.\n<b>Fortuna:</b> Un raggio inatteso illumina la giornata, cogli l'attimo di serenità. L'universo ti sorride discretamente.",
    "Gemelli": "<b>Amore:</b> Un dialogo sincero scioglie ogni nebbia, avvicinando i cuori. La comprensione reciproca fiorisce, portando dolcezza inaspettata e armonia.\n<b>Lavoro:</b> Le tue idee brillano, ma focalizza l'energia. Un tocco di precisione trasformerà l'intuizione in successo concreto, non disperdere le forze.\n<b>Fortuna:</b> Una brezza leggera ti porta un piccolo colpo di scena positivo. Sii aperto alle opportunità che si presentano con inaspettata leggerezza.",
    "Cancro": "<b>Amore:</b> Un tenero abbraccio riscalda il cuore, tessendo fili di comprensione con chi ami. Concedetevi la dolcezza della vicinanza.\n<b>Lavoro:</b> L'intuizione guida scelte sagge; segui il tuo sentire per superare ostacoli e prosperare. La calma porterà chiarezza.\n<b>Fortuna:</b> Sorride in piccole, inattese gioie domestiche, portando serenità e un senso di benessere interiore. Accoglile con gratitudine.",
    "Leone": "<b>Amore:</b> Un bagliore accende il cuore, portando gesti sinceri e intesa profonda. Lascia che la passione guidi le tue parole.\n<b>Lavoro:</b> La tua aura guida, idee brillano come stelle. È tempo di mostrare la tua leadership con progetti audaci e visionari.\n<b>Fortuna:</b> Un vento propizio sussurra, nuove vie si schiudono inattese. Sii pronto a cogliere ogni opportunità che si presenta.",
    "Vergine": "<b>Amore:</b> Un soffio di tenerezza ravviva i legami. Ascoltate il cuore, la comprensione guiderà i vostri affetti in dolci momenti di profonda connessione.\n<b>Lavoro:</b> La vostra chiarezza mentale apre nuove vie. Dedizione e organizzazione porteranno frutti inattesi, risolvendo un piccolo enigma con un'intuizione brillante.\n<b>Fortuna:</b> La sorte vi sorride in dettagli inaspettati. Un'opportunità discreta si palesa, lasciando che la luce vi trovi con un piccolo gesto del destino.",
    "Bilancia": "Oggi, il cuore trova armonie inaspettate; un sorriso sincero aprirà nuove vie all'affetto. <b>Amore</b> danza leggero. Nel <b>Lavoro</b>, le scelte ponderate portano frutti inattesi; la collaborazione è la chiave del successo. La <b>Fortuna</b> ti sorride con piccole, gioiose sorprese che illuminano la giornata.",
    "Scorpione": "<b>Amore:</b> I veli cadono, rivelando connessioni profonde. Un sussurro inatteso può riaccendere fiamme sopite, portando chiarezza e passione.\n<b>Lavoro:</b> La tua perspicacia è un faro potente. Naviga le sfide con astuzia strategica; un ostacolo diventa trampolino per nuove vette.\n<b>Fortuna:</b> Un piccolo, inatteso bagliore illumina la tua via. Fida nell'eco della tua intuizione; il cosmo ti offre un dolce segno.",
    "Sagittario": "<b>Amore:</b> Un soffio gentile accende la fiamma interiore, il cuore trova risonanze inaspettate. L'armonia avvolge i legami.\n<b>Lavoro:</b> Le stelle guidano passi audaci, intuizioni brillanti aprono nuove vie. Abbraccia il cambiamento con fiducia.\n<b>Fortuna:</b> Un raggio inatteso illumina il cammino, portando doni celesti e occasioni propizie. Sii ricettivo alle sorprese.",
    "Capricorno": "<b>Amore:</b> Un velo di tenerezza avvolge i tuoi legami, favorendo intese profonde e sincere. Ascolta il cuore, la risposta è lì. <b>Lavoro:</b> La tua costanza premia; nuove prospettive si delineano, offrendo stabilità e riconoscimento silenzioso. Sii paziente. <b>Fortuna:</b> Un soffio gentile del destino alleggerisce il cammino, rivelando piccole gioie inaspettate proprio quando servono.",
    "Acquario": "<b>Amore:</b> Oggi, le stelle tessono fili di comprensione profonda. Un incontro inaspettato o una ritrovata armonia illuminano il tuo cammino affettivo. Apri il cuore a nuove connessioni autentiche.\n<b>Lavoro:</b> La tua mente creativa è un faro. Idee innovative emergono chiare, pronte a plasmare progetti audaci. Condividi la tua visione; la collaborazione porta al successo.\n<b>Fortuna:</b> Un'onda favorevole ti solleva. Sii pronto a cogliere opportunità inaspettate. La sincronicità è tua alleata, osserva i segni.",
    "Pesci": "Errore API Gemini: 429 RESOURCE_EXHAUSTED. {'error': {'code': 429, 'message': 'You exceeded your current quota, please check your plan and billing details. For more information on this error, head to: https://ai.google.dev/gemini-api/docs/rate-limits. To monitor your current usage, head to: https://ai.dev/usage?tab=rate-limit.\\n* Quota exceeded for metric: generativelanguage.googleapis.com/generate_content_free_tier_requests, limit: 10\\nPlease retry in 1.340302086s.', 'status': 'RESOURCE_EXHAUSTED', 'details': [{'@type': 'type.googleapis.com/google.rpc.QuotaFailure', 'violations': [{'quotaMetric': 'generativelanguage.googleapis.com/generate_content_free_tier_requests', 'quotaId': 'GenerateRequestsPerMinutePerProjectPerModel-FreeTier', 'quotaDimensions': {'model': 'gemini-2.5-flash', 'location': 'global'}, 'quotaValue': '10'}]}, {'@type': 'type.googleapis.com/google.rpc.Help', 'links': [{'description': 'Learn more about Gemini API quotas', 'url': 'https://ai.google.dev/gemini-api/docs/rate-limits'}]}, {'@type': 'type.googleapis.com/google.rpc.RetryInfo', 'retryDelay': '1s'}]}}"
  },
  "2025-10-25": {
    "Ariete": "<b>Amore:</b> La passione accende scintille inaspettate. Ascolta il cuore, le parole non dette trovano oggi un'eco profonda nell'anima di chi ti è caro.\n\n<b>Lavoro:</b> Chiarezza e audacia guidano le tue scelte. Un'intuizione improvvisa svelerà una soluzione brillante; agisci con decisione.\n\n<b>Fortuna:</b> Un piccolo, inatteso gesto di gentilezza ti sorriderà. Resta vigile, un aiuto discreto è pronto ad illuminare dolcemente il tuo percorso.",
    "Toro": "<b>Amore:</b> Il cuore si apre a dolci armonie, trovando conforto in un abbraccio sincero. Lasciatevi guidare dalla tenerezza che vi circonda.\n<b>Lavoro:</b> La vostra dedizione porta frutti concreti. Un progetto richiede attenzione, ma il successo è a portata di mano. Perseverate con fiducia.\n<b>Fortuna:</b> Piccoli doni inattesi illuminano la giornata, portando un sorriso e nuove, piacevoli prospettive.",
    "Gemelli": "Una scintilla illumina il tuo cielo affettivo; <b>Amore</b> fiorisce nella comunicazione sincera. Sul <b>Lavoro</b>, le idee fluide portano a piccoli ma significativi progressi; la collaborazione è la tua forza. La <b>Fortuna</b> ti sorride inaspettatamente, un piccolo colpo di scena che rallegra la giornata. Sii aperto.",
    "Cancro": "Un'onda di tenerezza avvolge il tuo spirito. Condividi <b>Amore</b> e ogni gesto sarà un balsamo per l'anima. Nel <b>Lavoro</b>, la tua intuizione è bussola fedele: segui quel sussurro interiore per scelte sagge e produttive. La <b>Fortuna</b> ti sorride con un raggio inatteso; sii aperto alle sorprese, anche le più minute, che illumineranno la giornata.",
    "Leone": "Oggi, l'ardore del cuore accende nuove scintille. <b>Amore</b> pulsa in dialoghi profondi, riscoprendo un'intesa speciale. Nel <b>Lavoro</b>, la tua leadership naturale emerge, portando chiarezza e successo a progetti importanti. Riconoscimenti inaspettati potrebbero giungere. La <b>Fortuna</b> ti sorride con un'opportunità velata, cogli l'attimo.",
    "Vergine": "<b>Amore:</b> Un filo sottile lega i cuori, tessendo intese profonde. Ascolta il sussurro dell'anima, la tenerezza oggi è un dono prezioso.\n<b>Lavoro:</b> La mente acuta illumina sentieri complessi. Dettagli rivelano soluzioni inaspettate, la precisione apre nuove porte al successo.\n<b>Fortuna:</b> Una piccola gemma inattesa brilla sul cammino. Sii ricettivo, il fato sorride con gesti gentili e opportunità veloci.",
    "Bilancia": "<b>Amore:</b> Il cuore trova melodie inaspettate; un incontro sincero o un gesto dolce riaccende la fiamma, portando armonia.\n<b>Lavoro:</b> La diplomazia è la tua arma segreta, bilanciando opinioni con grazia per soluzioni equilibrate e produttive.\n<b>Fortuna:</b> Sussurra segreti in piccole coincidenze inattese, portando un sorriso sereno e una piacevole leggerezza.",
    "Scorpione": "<b>Amore:</b> Un'onda profonda accende il cuore, portando intuizioni che legano anime. Abbraccia la passione autentica che si rivela.\n<b>Lavoro:</b> La tua acutezza svela percorsi inattesi. Concentrazione e strategia aprono porte verso un successo nascosto.\n<b>Fortuna:</b> Sussurra, celata tra le pieghe del destino. Fidati del tuo istinto affinato, ti guiderà verso opportunità inattese.",
    "Sagittario": "<b>Amore:</b> L'arco del cuore si tende verso orizzonti nuovi; un'intesa profonda o un volto sconosciuto può illuminare il cammino. Sii audace nei sentimenti.\n<b>Lavoro:</b> La freccia della tua ambizione vola alta, superando ogni ostacolo. Nuove idee germogliano, portando frutti inaspettati nel tuo percorso professionale.\n<b>Fortuna:</b> Un soffio divino ti accompagna, portando leggerezza e serendipità. Affidati all'istinto, un piccolo miracolo è in attesa di rivelarsi.",
    "Capricorno": "<b>Amore:</b> Un velo di tenerezza avvolge i tuoi legami, invitando all'ascolto profondo e alla condivisione sincera che rafforza i cuori.\n<b>Lavoro:</b> La tua determinazione trova terreno fertile; nuove prospettive si aprono, ma valuta ogni passo con oculatezza per un successo duraturo.\n<b>Fortuna:</b> Un inatteso soffio di fortuna sfiora la tua giornata, portando piccole, dolci sorprese che illuminano il cammino.",
    "Acquario": "<b>Amore:</b> I sentimenti danzano leggeri, rivelando connessioni inaspettate. Ascoltate il cuore, si aprono nuove intese e una dolce armonia vi avvolge.\n<b>Lavoro:</b> La vostra mente brillante genera idee innovative. Condividete le visioni, il successo è nel coraggio di osare e proporre.\n<b>Fortuna:</b> Un sussurro del destino vi guida, affidatevi all'intuito per piccole ma significative svolte positive e inattese gioie.",
    "Pesci": "<b>Amore</b>: Le stelle tessono fili d'oro, connettendo cuori in un'intesa profonda. Lasciati guidare dall'emozione, scoprirai nuove armonie.\n<b>Lavoro</b>: La tua intuizione è una bussola preziosa. Fluisci con i compiti, le soluzioni creative emergono quando meno te lo aspetti.\n<b>Fortuna</b>: Una brezza gentile porta un dono inatteso. Apriti al cambiamento, la serenità ti avvolge in un abbraccio caldo."
  },
  "2025-10-26": {
    "Ariete": "<b>Amore:</b> Un filo invisibile lega i cuori, rivelando tenerezze inaspettate. Ascolta il sussurro dell'anima gemella.\n<b>Lavoro:</b> L'energia impulsiva trova rotta, guidando progetti con audace visione. Non temere di osare.\n<b>Fortuna:</b> Un barlume di gioia inattesa illumina il cammino, portando piccole ma significative vittorie. Accogli il dono del caso.",
    "Toro": "<b>Amore</b>: Un sussurro d'affetto rischiara il cuore, un legame si rafforza con dolcezza e comprensione profonda.\n<b>Lavoro</b>: La tenacia porta frutti inattesi. Concentrazione e dedizione aprono nuove, promettenti vie.\n<b>Fortuna</b>: Una scintilla di buona sorte illumina il cammino, cogli l'occasione con saggezza e fiducia.",
    "Gemelli": "<b>Amore:</b> Un sussurro del cuore svela nuove intese, le parole creano ponti d'oro. Apri l'anima.\n<b>Lavoro:</b> Le idee brillano, la comunicazione fluisce, cogli l'attimo per esprimere il tuo ingegno. Collabora con fiducia.\n<b>Fortuna:</b> Una coincidenza inattesa illumina il cammino, fidati dell'istinto leggero. Ascolta i segnali.",
    "Cancro": "<b>Amore:</b> Il cuore si apre a dolci sussurri, consolidando legami preziosi. Ascolta l'eco delle emozioni.\n<b>Lavoro:</b> La tua innata intuizione è una bussola affidabile; fiducia nelle collaborazioni e nei progressi costanti.\n<b>Fortuna:</b> Un raggio di luce inatteso illumina una piccola gioia. Abbraccia la serenità interiore che ti guida.",
    "Leone": "<b>Amore:</b> La tua luce interiore attira affetto, rafforzando legami. Un gesto tenero parlerà più di mille parole, accendendo una passione vibrante nel cuore.\n<b>Lavoro:</b> Le tue idee brillano. Conquisterai riconoscimenti con audacia e leadership, trasformando ogni sfida in un trionfo personale.\n<b>Fortuna:</b> Una ventata d'oro porta opportunità inaspettate. Sii audace nel cogliere l'attimo, il destino ti sorride con generosità.",
    "Vergine": "<b>Amore:</b> Un tocco di gentilezza illumina i legami, cerca l'intesa profonda nei piccoli gesti. L'ascolto attento rafforza ogni unione.\n<b>Lavoro:</b> La tua precisione metodica è una stella guida. Nuove idee germogliano, pronte a essere coltivate con saggezza e dedizione.\n<b>Fortuna:</b> Un'intuizione sottile ti guida verso piccole sorprese. Affidati al tuo sesto senso, ti condurrà a un felice imprevisto.",
    "Bilancia": "Il cuore si apre a nuove comprensioni, tessendo fili d'oro con chi ami. La comunicazione fluida porta armonia. Nel <b>lavoro</b>, la tua diplomazia brilla, risolvendo nodi e guidando progetti con grazia. Un'idea inaspettata può sbloccare un successo. La <b>fortuna</b> ti sorride in piccoli gesti, un'intuizione chiara o un incontro fortuito. Abbraccia la leggerezza del momento.",
    "Scorpione": "Oggi, <b>l'amore</b> fiorisce in profondità inattese, un legame invisibile si rafforza. Nel <b>lavoro</b>, la tua acutezza strategica apre porte prima celate, rivelando percorsi di successo. La <b>fortuna</b>, un soffio leggero, ti guida verso un vantaggio inatteso. Fidati del tuo sentire per abbracciare il dono del giorno.",
    "Sagittario": "<b>Amore:</b> Il cuore si apre a nuove melodie, un incontro d'anime o un'intesa profonda illumina il tuo cammino. Lasciati guidare dall'intuito.\n<b>Lavoro:</b> Nel labirinto del dovere, idee brillanti affiorano. Collaborazioni fruttuose ti spingono oltre ogni confine, cogli l'opportunità.\n<b>Fortuna:</b> La sorte ti sorride con un tocco lieve, un aiuto inatteso o un'occasione dorata si palesa. Resta attento ai segnali.",
    "Capricorno": "<b>Amore:</b> I legami si rafforzano nel silenzio di un'intesa profonda, nutrendo la fiamma con gesti sinceri e pacata dedizione.\n<b>Lavoro:</b> La tua dedizione metodica apre porte inaspettate; la costanza è la chiave per brillanti risultati e meritata stima.\n<b>Fortuna:</b> Un'onda sottile di opportunità ti sfiora, sii pronto a coglierla con saggezza e fiducia serena nel tuo cammino.",
    "Acquario": "<b>Amore:</b> Un soffio di tenerezza accarezza le tue connessioni, rivelando la profondità dei sentimenti. Oggi il cuore pulsa di armonia.\n<b>Lavoro:</b> La scintilla della tua mente innovativa accende nuove idee. Segui il flusso creativo; il successo è a portata di mano.\n<b>Fortuna:</b> Un sussurro del destino ti indica una piccola, ma significativa, opportunità da cogliere con intuizione.",
    "Pesci": "Errore API Gemini: 429 RESOURCE_EXHAUSTED. {'error': {'code': 429, 'message': 'You exceeded your current quota, please check your plan and billing details. For more information on this error, head to: https://ai.google.dev/gemini-api/docs/rate-limits. To monitor your current usage, head to: https://ai.dev/usage?tab=rate-limit.\\n* Quota exceeded for metric: generativelanguage.googleapis.com/generate_content_free_tier_requests, limit: 10\\nPlease retry in 28.178094219s.', 'status': 'RESOURCE_EXHAUSTED', 'details': [{'@type': 'type.googleapis.com/google.rpc.QuotaFailure', 'violations': [{'quotaMetric': 'generativelanguage.googleapis.com/generate_content_free_tier_requests', 'quotaId': 'GenerateRequestsPerMinutePerProjectPerModel-FreeTier', 'quotaDimensions': {'location': 'global', 'model': 'gemini-2.5-flash'}, 'quotaValue': '10'}]}, {'@type': 'type.googleapis.com/google.rpc.Help', 'links': [{'description': 'Learn more about Gemini API quotas', 'url': 'https://ai.google.dev/gemini-api/docs/rate-limits'}]}, {'@type': 'type.googleapis.com/google.rpc.RetryInfo', 'retryDelay': '28s'}]}}"
  },
  "2025-10-27": {
    "Ariete": "Oggi il cuore pulsa con ardore. In <b>Amore</b>, un gesto audace aprirà nuove porte o rinnoverà una fiamma. Non temere di esprimere ciò che senti. Nel <b>Lavoro</b>, la tua energia è contagiosa; prendi l'iniziativa, guida il gruppo. Un progetto attende la tua visione. La <b>Fortuna</b> ti sorride attraverso l'azione: un rischio calcolato porterà frutti inaspettati. Sii coraggioso.",
    "Toro": "<b>Amore:</b> Un tenero sospiro del cuore avvicina anime affini. Condividi dolci momenti, rafforzando legami preziosi con gesti concreti.\n<b>Lavoro:</b> La tua dedizione porta frutti silenziosi. Un piccolo passo oggi apre strade sicure per domani. Procedi con fiducia.\n<b>Fortuna:</b> Un'intuizione improvvisa ti guida verso un vantaggio inatteso. Cogli l'attimo, la sorte ti sorride discreta.",
    "Gemelli": "<b>Amore:</b> Un soffio gentile accarezza i sentimenti, rivelando intese sottili; ascolta il cuore.\n<b>Lavoro:</b> Nel campo professionale, la tua mente brillante semina idee innovative che fioriranno.\n<b>Fortuna:</b> La buona sorte si manifesta in un inatteso spiraglio, seguendo il tuo intuito. Abbraccia il cambiamento.",
    "Cancro": "<b>Amore:</b> Un tocco gentile riscalda il cuore, rafforzando legami preziosi con profonda tenerezza. La connessione fiorisce in momenti dolci.\n<b>Lavoro:</b> La tua intuizione guida decisioni sagge; nuove opportunità si aprono grazie alla tua dedizione. Sii proattivo e concentrato.\n<b>Fortuna:</b> Una piccola sorpresa illumina la giornata, nata da un'inattesa coincidenza. Segui il tuo istinto per scoprirla.",
    "Leone": "<b>Amore:</b> La fiamma interiore risplende, portando calore e intesa profonda. Connessioni sincere si rafforzano sotto un cielo benevolo.\n<b>Lavoro:</b> La tua visione guida, aprendo nuove strade al successo. Riconoscimenti inattesi potrebbero illuminare il tuo percorso.\n<b>Fortuna:</b> Un raggio di sole inaspettato dissolve ogni ombra, portando con sé un'opportunità dorata. Sii pronto a coglierla.",
    "Vergine": "<b>Amore:</b> Un velo sottile si dirada, permettendo al cuore di esprimere e ricevere affetto con candore inatteso. L'armonia sboccia.\n<b>Lavoro:</b> La tua meticolosa attenzione ai dettagli apre sentieri inesplorati. La dedizione porta frutti concreti e le nuove idee germogliano con successo.\n<b>Fortuna:</b> Una leggera brezza porta con sé una piacevole sorpresa, un piccolo dono dal destino che illumina la giornata con inaspettata gioia.",
    "Bilancia": "<b>Amore</b>: Oggi, l'amore danza in un respiro condiviso, un'armonia che si svela in gesti gentili e comprensione profonda.\n<b>Lavoro</b>: La tua innata equità apre nuove vie, tessendo soluzioni eleganti e collaborative con saggezza.\n<b>Fortuna</b>: Ti sorride con una brezza inattesa, un tocco leggero che illumina il tuo cammino, portando serenità.",
    "Scorpione": "<b>Amore:</b> Un velo si solleva, rivelando connessioni profonde. Lascia che il cuore parli in silenzio, la sintonia è palpabile.\n<b>Lavoro:</b> Con astuzia e dedizione, superi ogni ostacolo. Le tue strategie portano frutti inattesi, la perseveranza è premiata.\n<b>Fortuna:</b> Un sussurro del destino ti guida. Ascolta l'intuito, un piccolo dono inatteso è in arrivo.",
    "Sagittario": "<b>Amore:</b> Il cuore si apre a connessioni profonde, un balsamo per l'anima o una nuova, dolce melodia. L'onestà rafforza ogni legame prezioso.\n<b>Lavoro:</b> La mente acuta trova sentieri inesplorati. Le tue idee brillano, portando frutti inattesi e riconoscimenti meritati. Non temere l'innovazione.\n<b>Fortuna:</b> Un raggio inatteso illumina il cammino, offrendo piccole, piacevoli sorprese. Sii aperto alle opportunità che si celano nel quotidiano.",
    "Capricorno": "<b>Amore:</b> Un soffio di tenerezza riscalda il cuore, tessendo fili d'intesa profonda. Lasciate che l'affetto fiorisca in gesti sinceri.\n<b>Lavoro:</b> La vostra dedizione porta frutti. Un'intuizione acuta svela la via per superare ostacoli minori, rafforzando la vostra posizione.\n<b>Fortuna:</b> Gemme inattese emergono dalla routine. Osservate attentamente le piccole sincronicità che guidano verso un sereno benessere.",
    "Acquario": "<b>Amore:</b> Il cuore si apre a nuove risonanze. Una melodia inattesa vi avvolge, rendendo i legami più profondi e autentici.\n<b>Lavoro:</b> La mente è un faro di idee brillanti. Condividetele con coraggio, il terreno è fertile per seminare progetti innovativi. La collaborazione porta frutti.\n<b>Fortuna:</b> Un soffio inaspettato accarezza il vostro cammino. Prestate attenzione ai segnali lievi, potrebbero celare opportunità preziose. La sorte vi sorride discreta.",
    "Pesci": "<b>Amore:</b> Un'onda di profonda empatia vi avvolge, rendendo i legami più intensi. Ascoltate il cuore, le parole non dette riveleranno verità preziose.\n<b>Lavoro:</b> La vostra creatività fluisce libera, ispirando soluzioni intuitive. Non esitate a seguire quel sesto senso; porterà a progressi inattesi.\n<b>Fortuna:</b> Una sincronicità inattesa illumina il cammino. Siate aperti ai segnali del destino, un piccolo dono è in arrivo."
  },
  "2025-10-28": {
    "Ariete": "<b>Amore:</b> Un soffio di passione accende il cuore, rendendo dolci gli incontri e profonde le intese. Momenti teneri inaspettati.\n<b>Lavoro:</b> La tua energia travolgente porta chiarezza. Un'idea audace trova il suo momento per brillare, portando riconoscimento.\n<b>Fortuna:</b> Un piccolo segno del destino ti guida, offrendo una svolta inaspettata o un aiuto prezioso proprio quando serve.",
    "Toro": "<b>Amore:</b> Il cuore, oggi, vibra di dolci armonie. L'intesa con chi ami si fa più profonda, regalandoti momenti di pura e serena tenerezza.\n<b>Lavoro:</b> La tua tenacia è la chiave del successo. Ogni sforzo è ben riposto, costruendo solide basi per il futuro. Non temere di osare con saggezza.\n<b>Fortuna:</b> Un soffio di vento favorevole accarezza i tuoi passi. Riconoscimenti inattesi e piccole gioie quotidiane illuminano la tua strada. Accogli con gratitudine.",
    "Gemelli": "<b>Amore:</b> Un soffio di primavera risveglia cuori silenti, portando dialoghi inattesi e sguardi complici. L'intesa si rafforza.\n<b>Lavoro:</b> La mente, agile e brillante, trova soluzioni innovative. Le stelle favoriscono scambi e collaborazioni fruttuose.\n<b>Fortuna:</b> Una stella benevola illumina il cammino, favorendo piccole vincite o incontri propizi. Cogli l'attimo con leggerezza.",
    "Cancro": "<b>Amore:</b> La luna veglia sui tuoi sentimenti; un gesto tenero rafforza i legami più cari. Ascolta il cuore.\n<b>Lavoro:</b> La tua intuizione è una guida preziosa. Piccoli passi costanti portano a successi inaspettati.\n<b>Fortuna:</b> Una brezza leggera ti accarezza, portando una serena sorpresa o una piccola, dolce gioia inattesa.",
    "Leone": "<b>Amore:</b> Il cuore pulsa di nuove armonie, accendendo fiamme sopite o rafforzando dolci legami. L'ardore guida i tuoi passi.\n<b>Lavoro:</b> La tua luce interiore brilla, trasformando ogni sfida in un'opportunità aurea. Riconoscimenti in vista.\n<b>Fortuna:</b> Una stella benevola ti sorride, spargendo petali di fortuna inaspettata. Goditi le piccole, dolci sorprese.",
    "Vergine": "Affetti sinceri risplendono, chiedendo un piccolo atto di fede. Aprite il cuore senza timore, la dolcezza vi attende in un inatteso scambio, portando armonia.\n\n<b>Lavoro:</b>\nImpegno e acume svelano nuove prospettive. Non sottovalutate un'intuizione legata ai dettagli; la vostra meticolosità sarà premiata con chiarezza e successo.\n\n<b>Fortuna:</b>\nUna stella benevola vi accompagna nelle decisioni minori. Fidatevi del vostro giudizio pratico; un piccolo gesto vi darà un inaspettato vantaggio oggi.",
    "Bilancia": "<b>Amore:</b> Un soffio gentile di comprensione avvolge i vostri legami. Cercate l'armonia, ascoltando le sfumature del cuore e condividendo tenerezza.\n<b>Lavoro:</b> La vostra innata diplomazia sarà una chiave preziosa. Collaborate, le idee brillanti fioriranno dalla condivisione.\n<b>Fortuna:</b> Un'onda lieve di buona sorte vi sfiora. Fidatevi del vostro intuito per cogliere le opportunità inattese che si presentano.",
    "Scorpione": "<b>Amore:</b> Le correnti del cuore si fanno profonde, rivelando un legame più intenso. Ascolta il sussurro dell'anima.\n<b>Lavoro:</b> La tua perspicacia traccia sentieri inesplorati. Un ostacolo si dissolve con strategia e acume.\n<b>Fortuna:</b> Un filo invisibile di buona sorte ti guida. Fida nel tuo intuito per cogliere un'opportunità silente.",
    "Sagittario": "<b>Amore:</b> Un soffio gentile accarezza il tuo spirito avventuroso, aprendo strade a nuove o rinnovate affinità. Ascolta il cuore.\n<b>Lavoro:</b> Le stelle illuminano i tuoi progetti. Con audacia, puoi concretizzare idee brillanti e ottenere riconoscimento meritato.\n<b>Fortuna:</b> Una scintilla inattesa porta un sorriso. Il destino ti sorride con piccole, gioiose sorprese lungo il tuo cammino.",
    "Capricorno": "<b>Amore:</b> Il cuore sussurra dolci armonie; un legame si rafforza, portando nuova luce ai tuoi affetti più cari.\n<b>Lavoro:</b> La tenacia traccia nuove vie; idee brillanti aprono orizzonti insperati, il successo è vicino.\n<b>Fortuna:</b> Un soffio propizio vela piccole gioie; cogli l'attimo con saggezza, la sorte ti sorride discreta.",
    "Acquario": "<b>Amore:</b> Un'onda di comprensione avvolge i legami, rafforzando l'intesa con chi vibra sulla tua stessa frequenza. La sincerità oggi è la chiave.\n<b>Lavoro:</b> La tua visione unica guida progetti audaci. Collaborazioni inattese aprono nuove vie, rendendo fecondo ogni sforzo innovativo.\n<b>Fortuna:</b> Un vento favorevole sospinge le tue vele. Ascolta l'intuizione; piccoli gesti oggi seminano grandi fortune domani.",
    "Pesci": "<b>Amore:</b> Oggi, le tue emozioni fluiscono come un fiume sereno. Un'intuizione profonda guida i tuoi gesti, creando armonia e comprensione con chi ami. La tenerezza regna sovrana.\n<b>Lavoro:</b> La creatività è la tua bussola. Affronta le sfide con delicatezza, la tua visione unica aprirà nuove porte. Collaborazioni inattese portano frutti.\n<b>Fortuna:</b> Ascolta la voce interiore; ti condurrà a opportunità inaspettate. Un senso di pace pervade la giornata, donandoti serenità e piccole, dolci sorprese."
  },
  "2025-10-29": {
    "Ariete": "<b>Amore:</b> Un'onda di affetto ravviva i legami. Ascolta il cuore, un sorriso può dischiudere nuove intese o consolidare vecchi amori.\n<b>Lavoro:</b> La tua risolutezza apre nuove porte. Un'idea brillante trova terreno fertile, agisci con fiducia e visione.\n<b>Fortuna:</b> Un soffio di buona sorte illumina la giornata. Segui l'istinto, potresti scoprire un piccolo tesoro inatteso.",
    "Toro": "Il cuore si apre a nuove melodie, un tocco gentile o uno sguardo profondo illumina la via delle emozioni condivise. Nel <b>Lavoro</b>, la tua tenacia è una virtù; progetti stabili avanzano con passo sicuro, portando frutti meritati. Un'opportunità inattesa può celarsi dietro l'angolo. La <b>Fortuna</b> ti sorride con piccole, dolci sorprese, un raggio di sole inatteso che accarezza i tuoi piani. Sii ricettivo.",
    "Gemelli": "Nell'<b>Amore</b>, un soffio leggero porta chiarezza, le parole si fanno ponte tra cuori. Nel <b>Lavoro</b>, la tua mente brillante accende nuove idee; sii audace, le opportunità ti attendono. La <b>Fortuna</b> sorride in un incontro inatteso, un piccolo dono dal destino. Accogli ogni momento con apertura.",
    "Cancro": "<b>Amore:</b> Il tuo cuore naviga in acque serene, intessendo fili d'oro di armonia. Goditi la profonda intesa, ogni sentimento è un dono prezioso.\n<b>Lavoro:</b> Intuizione e dedizione aprono nuove porte. Le tue idee brillanti fioriscono, portando successi inaspettati. Abbraccia la tua creatività.\n<b>Fortuna:</b> Una dolce brezza ti sorride, portando piccole gioie inaspettate. Sii ricettivo ai doni del destino, oggi la sorte ti è amica.",
    "Leone": "<b>Amore:</b> Il cuore, ardente, brama connessioni profonde. Un sussurro dolce può riaccendere fiamme sopite o rafforzare legami esistenti, donando calore.\n<b>Lavoro:</b> La tua luce interiore guida progetti ambiziosi. Leadership e creatività aprono nuove strade inaspettate, non esitare a brillare con decisione.\n<b>Fortuna:</b> Una stella benevola ti sorride dall'alto. Un incontro inatteso o un'intuizione fulminea ti porteranno un piccolo, piacevole vantaggio.",
    "Vergine": "<b>Amore:</b> Un filo invisibile lega cuori, sussurrando dolci promesse. Ascolta con tenerezza, le connessioni si approfondiscono.\n<b>Lavoro:</b> La tua precisione è una gemma, oggi brilla portando chiarezza dove serve. Piccoli passi, grandi risultati in attesa.\n<b>Fortuna:</b> Una brezza leggera porta con sé opportunità inattese. Cogli il momento con saggezza serena, un piccolo dono ti attende.",
    "Bilancia": "<b>Amore:</b> Un soffio gentile accarezza il cuore, promettendo intese profonde e armonia. I legami si rafforzano con dolcezza.\n<b>Lavoro:</b> L'equilibrio guida le tue scelte, portando chiarezza in progetti e collaborazioni. Ascolta la tua voce interiore.\n<b>Fortuna:</b> Un raggio inatteso illumina il cammino, rivelando piccole, dolci sorprese che rallegrano la giornata.",
    "Scorpione": "<b>Amore</b>: Il cuore pulsa forte; un incontro inatteso o una verità profonda si rivela. Ascolta l'eco dell'anima.\n<b>Lavoro</b>: La tua tenacia è premiata. Strategie astute portano a successi insperati. Agisci con decisione.\n<b>Fortuna</b>: Un velo si solleva, rivelando opportunità nascoste. La tua intuizione è una guida preziosa oggi.",
    "Sagittario": "<b>Amore:</b> Un soffio gentile accarezza l'anima, portando armonia e comprensione profonda. I legami si rinsaldano, illuminati da una nuova tenerezza.\n<b>Lavoro:</b> La mente è un faro che guida verso soluzioni brillanti. Abbraccia le sfide, poiché celano opportunità inaspettate per la tua crescita.\n<b>Fortuna:</b> Ascolta l'intuizione; ti condurrà a un piccolo dono del cosmo, forse un incontro o una felice coincidenza.",
    "Capricorno": "<b>Amore:</b> Un velo di tenerezza avvolge i cuori, favorendo intese silenziose e carezzevoli affetti. Ascoltate l'eco delle emozioni più pure.\n<b>Lavoro:</b> La vostra dedizione porta frutti inattesi; le sfide si trasformano in opportunità con lucida visione e ferma mano.\n<b>Fortuna:</b> Una brezza leggera porta con sé un'inattesa armonia, piccole coincidenze vi sorridono, illuminando il cammino con discreta grazia.",
    "Acquario": "<b>Amore:</b> Un soffio gentile muove le corde del cuore, tessendo connessioni inattese. Apri l'anima alla dolcezza e all'intesa profonda che si svela.\n<b>Lavoro:</b> Le tue visioni audaci trovano eco. Semina idee innovative con fiducia; la collaborazione porta frutti inaspettati.\n<b>Fortuna:</b> Una stella guida illumina sentieri nuovi. Confida nelle coincidenze, portano doni preziosi quando meno te lo aspetti.",
    "Pesci": "<b>Amore:</b> I sentimenti fluiscono come un fiume silente, portando tenerezza e comprensione. Apri il cuore a nuove risonanze.\n<b>Lavoro:</b> La creatività è la tua bussola, guidandoti attraverso compiti complessi. Fidati dell'intuito per soluzioni inaspettate.\n<b>Fortuna:</b> Una brezza leggera ti spinge verso opportunità celate. Ascolta i sussurri del destino."
  },
  "2025-10-30": {
    "Ariete": "Oggi, l'<b>amore</b> sussurra dolci promesse, il cuore si apre a nuove emozioni. Nel <b>lavoro</b>, la tua energia è un faro: progetti audaci trovano terreno fertile. La <b>fortuna</b> gioca a tuo favore, portando un inatteso raggio di sole a illuminare la giornata. Accogli ogni dono.",
    "Toro": "Per il cuore, un'armonia sottile vibra nell'aria, invitando a gesti teneri che rafforzano i legami. Nel <b>lavoro</b>, la tua perseveranza è una guida sicura; le sfide si trasformano in opportunità concrete, portando frutti tangibili. La <b>fortuna</b>, discreta ma presente, sussurra promesse inaspettate, specie se segui il tuo intuito.",
    "Gemelli": "<b>Amore:</b> Le parole danzano, creando ponti emotivi. Un dialogo sincero rafforza legami o ne accende di nuovi, illumina il cuore.\n<b>Lavoro:</b> La tua agilità mentale è un faro. Idee brillanti trovano ascolto, la comunicazione fluida spiana la strada ai successi.\n<b>Fortuna:</b> Un sussurro del destino ti raggiunge, portando una piccola gioia inattesa. Accogli ogni segno con leggerezza.",
    "Cancro": "<b>Amore:</b> Un'onda di tenero affetto avvolge il tuo cuore, favorendo intime connessioni e dolci comprensioni.\n<b>Lavoro:</b> L'intuizione è la tua bussola; segui quella voce interiore per decisioni chiare e progetti fruttuosi.\n<b>Fortuna:</b> Una piccola, inattesa scintilla di gioia illumina il tuo cammino, portando serena gratitudine.",
    "Leone": "<b>Amore:</b> La passione arde, illuminando legami esistenti o accendendo nuove scintille. Un gesto inatteso porta tenerezza e comprensione profonda.\n<b>Lavoro:</b> La tua innata leadership brilla. Opportunità di mostrare il tuo valore si presentano, portando riconoscimenti meritati e progressi significativi.\n<b>Fortuna:</b> Un vento favorevole soffia, portando piccole ma preziose sorprese. Sii aperto alle intuizioni, un dettaglio può cambiare la prospettiva.",
    "Vergine": "<b>Amore:</b> Un filo sottile connette i cuori, la comprensione fiorisce in gesti dolci. Ascoltate il silenzio dell'anima che parla.\n<b>Lavoro:</b> La vostra dedizione brilla, un'idea prende forma con precisione meticolosa. Riconoscimenti sottili sono in arrivo.\n<b>Fortuna:</b> Una piccola coincidenza apre una porta inattesa. Seguite l'intuizione leggera che vi guida con delicatezza.",
    "Bilancia": "<b>Amore:</b> Oggi, nel cuore, un vento leggero sussurra dolci promesse. Le relazioni fioriscono sotto un cielo sereno, portando armonia e intesa profonda.\n<b>Lavoro:</b> Sul fronte professionale, la tua diplomazia è la chiave: sii mediatore e vedrai aprirsi nuove, promettenti porte.\n<b>Fortuna:</b> La sorte ti sorride con piccole, inaspettate coincidenze che rallegrano la giornata. Mantieni l'equilibrio.",
    "Scorpione": "<b>Amore:</b> La passione si accende, rivelando profondità inattese. Ascolta il cuore, le connessioni sono intense e significative.\n<b>Lavoro:</b> La tua acuta intuizione guida scelte sagge. Affronta le sfide con determinazione, il successo è a portata di mano.\n<b>Fortuna:</b> Un velo di buona sorte ti avvolge, portando opportunità inaspettate. Sii ricettivo ai segnali.",
    "Sagittario": "<b>Amore:</b> Il cuore, nomade ardente, trova dimora in sguardi profondi o nuove promesse. Lasciati guidare dall'istinto più puro.\n<b>Lavoro:</b> Un'idea audace fiorisce, portando slancio a progetti fermi. Non temere di osare, la tua visione è chiara e vincente.\n<b>Fortuna:</b> Sorrisi inaspettati illuminano il cammino. Un piccolo gesto o un incontro fortuito apriranno porte insperate.",
    "Capricorno": "<b>Amore:</b> Un sussurro del cuore trova oggi ascolto inaspettato. Lascia che la tenerezza guidi i tuoi gesti, rafforzando legami preziosi con autenticità.\n<b>Lavoro:</b> La tua tenacia apre sentieri inesplorati. Un'intuizione acuta illumina il percorso verso obiettivi concreti, portando riconoscimenti meritati.\n<b>Fortuna:</b> Un piccolo, sereno dono del destino si manifesta discretamente. Sii ricettivo ai segnali, un raggio inatteso rischiara la tua giornata.",
    "Acquario": "<b>Amore:</b> Un soffio gentile accarezza il tuo cuore, portando armonia. Le connessioni si approfondiscono con una dolcezza inattesa.\n<b>Lavoro:</b> La mente brilla di intuizioni; condividi le tue visioni. L'azione è la chiave per aprire porte inaspettate.\n<b>Fortuna:</b> Un'onda favorevole ti solleva, rivelando opportunità celate. Affidati all'istinto, il destino oggi ti sorride.",
    "Pesci": "<b>Amore:</b> Ascolta il sussurro del cuore; le affinità si rafforzano con dolce comprensione. Un gesto sincero apre nuove profondità emotive.\n<b>Lavoro:</b> La tua intuizione è una bussola preziosa. Affronta le sfide con creatività, un progetto latente può ora sbocciare con successo.\n<b>Fortuna:</b> Un'onda inattesa porta opportunità serene. Segui il flusso, il destino ti sorride con piccole, gioiose sorprese che illuminano la giornata."
  },
  "2025-10-31": {
    "Ariete": "<b>Amore:</b> Un'onda di calore avvolge i tuoi affetti, approfondendo la comprensione e accendendo la scintilla. Ascolta il cuore.\n<b>Lavoro:</b> La tua energia proattiva sblocca progressi inaspettati. Sii audace, le tue iniziative sono ben viste.\n<b>Fortuna:</b> Un sussurro del destino ti indica la via giusta; fidati del tuo istinto per cogliere un vantaggio.",
    "Toro": "<b>Amore:</b> Un soffio gentile accarezza i tuoi legami, portando armonia e intesa. Condividi momenti preziosi con chi ami.\n<b>Lavoro:</b> La tua costanza è premiata; un progetto prende slancio grazie alla tua dedizione. Non temere di osare.\n<b>Fortuna:</b> Un piccolo, inatteso dono illumina il tuo cammino oggi. Sii ricettivo alle sorprese che la sorte ti riserva.",
    "Gemelli": "<b>Amore:</b> Nel cuore, un'eco di tenerezza vi invita a parlare chiaro, sciogliendo ogni nodo con un sorriso. Un abbraccio sincero apre nuove porte.\n<b>Lavoro:</b> Le idee fluiscono come un fiume, portando opportunità. Ascoltate e collaborate, il successo è nel dialogo e nella vostra versatilità.\n<b>Fortuna:</b> Un soffio leggero di buona sorte vi sfiora, portando piccole gioie inattese che colorano la giornata con un tocco di brio.",
    "Cancro": "<b>Amore:</b> Le correnti del cuore fluiscono dolcemente; esprimi con tenerezza ciò che senti, rafforzando legami preziosi e sinceri.\n<b>Lavoro:</b> L'intuito guida le tue mani, rendendo l'ambiente più accogliente. Piccoli aggiustamenti portano grandi armonie.\n<b>Fortuna:</b> Un sussurro di buona sorte ti avvolge, portando serenità in gesti quotidiani inattesi e confortevoli.",
    "Leone": "<b>Amore:</b> Un ardore antico si risveglia, illuminando cuori e sguardi. Condividi la tua luce.\n<b>Lavoro:</b> La tua visione guida, le tue idee brillano. Conquiste a portata di mano, sii audace.\n<b>Fortuna:</b> Una stella benevola ti sorride, portando opportunità inattese. Afferra il momento.",
    "Vergine": "<b>Amore:</b> I sentimenti affiorano lievi, un sussurro d'intesa con chi ti è caro. Apriti a gesti gentili che nutrono l'anima.\n<b>Lavoro:</b> La tua meticolosità è una stella guida; ogni dettaglio curato ti aprirà nuove vie di chiarezza e successo.\n<b>Fortuna:</b> Risiede in un piccolo, inatteso chiarore, un barlume di gioia trovato nella quiete e nell'osservazione attenta.",
    "Bilancia": "<b>Amore:</b> Un soffio delicato accarezza il vostro cuore. Cercate armonia, nutrite i legami con gesti gentili. La comprensione reciproca fiorisce.\n<b>Lavoro:</b> La vostra innata equità illumina ogni scelta. Collaborazioni proficue attendono. La diplomazia apre vie inaspettate al successo.\n<b>Fortuna:</b> Le stelle sorridono, inclinando la bilancia. Un piccolo dono inatteso vi sorprende. Fidatevi della vostra intuizione.",
    "Scorpione": "Il cuore sussurra segreti, l'intimità si approfondisce o una nuova fiamma illumina la tua via. <b>Amore</b> richiede autenticità.\nNel <b>Lavoro</b>, la tua mente acuta decifra enigmi; una strategia vincente emerge. Agisci con determinazione.\nLa <b>Fortuna</b> ti sorride attraverso intuizioni fulminanti. Ascolta il tuo sesto senso per cogliere un'occasione inattesa.",
    "Sagittario": "<b>Amore:</b> Un soffio gentile accende braci sopite, riavvicinando cuori. Ascolta la melodia segreta che unisce le anime in un abbraccio.\n<b>Lavoro:</b> La tua visione audace guida passi decisi. Nuove strade si aprono all'orizzonte, la perseveranza sarà premiata con successi.\n<b>Fortuna:</b> Un raggio inatteso illumina il cammino, portando doni silenziosi e sorprese. Fidati dell'istinto che ti guida.",
    "Capricorno": "<b>Amore:</b> Un soffio gentile accarezza i legami, invitandoti a nutrire l'intesa con gesti sinceri. Il cuore si apre a nuove comprensioni.\n<b>Lavoro:</b> La tua proverbiale disciplina è la chiave. Ogni sforzo porta frutti, le sfide si trasformano in opportunità di crescita solida.\n<b>Fortuna:</b> Una piccola coincidenza fortunata illumina il tuo cammino, offrendo una prospettiva inattesa. Accoglila con fiducia.",
    "Acquario": "<b>Amore:</b> Un'onda di tenerezza avvolge i legami, favorendo dialoghi sinceri che rafforzano l'intesa. Lasciatevi guidare dal cuore.\n<b>Lavoro:</b> La mente è un faro per nuove idee; la collaborazione apre strade inattese verso il successo. Siate aperti al cambiamento.\n<b>Fortuna:</b> Un piccolo, inatteso favore illumina il cammino, portando un sorriso nel cuore e leggerezza allo spirito.",
    "Pesci": "<b>Amore</b>: Il cuore sussurra melodie segrete; ascoltale per un'intesa profonda che illumina la giornata.\n<b>Lavoro</b>: La creatività fluisce, guidandoti verso soluzioni inaspettate. Condividere le tue visioni porterà frutti.\n<b>Fortuna</b>: Una corrente invisibile ti spinge dolcemente. Fidati del tuo istinto, ti condurrà alla gioia inattesa."
  },
  "2025-11-01": {
    "Ariete": "<b>Amore</b>: I sentimenti danzano leggeri, pronti a intrecciare nuove, dolci melodie. Lascia che il tuo cuore guidi la strada.\n<b>Lavoro</b>: La tua energia infiamma le idee, trasformando ogni compito in un trionfo. Abbraccia la tua audacia.\n<b>Fortuna</b>: Un velo di inattese opportunità si solleva, rivelando sentieri dorati. Sii pronto a coglierli.",
    "Toro": "Oggi, il cuore si apre a dolci promesse; <b>Amore</b> fiorisce in gesti sinceri, la sensualità guida intese profonde. Nel <b>Lavoro</b>, la tua tenacia costruisce ponti solidi verso il successo; un progetto richiede attenzione costante. La <b>Fortuna</b> sorride con piccole gioie inattese, portando serenità e stabilità nei tuoi passi quotidiani. Goditi la calma.",
    "Gemelli": "<b>Amore:</b> Un soffio leggero accarezza i vostri legami, portando comprensione e sorrisi inaspettati. L'armonia sboccia con un semplice gesto.\n<b>Lavoro:</b> Le idee brillano come stelle cadenti, guidandovi verso soluzioni innovative. Condividete la vostra luce e sorprendete.\n<b>Fortuna:</b> Un piccolo dono del destino vi attende, un'eco felice nel frastuono quotidiano. Apritevi al nuovo.",
    "Cancro": "<b>Amore:</b> La luna illumina i vostri sentimenti più profondi. Un gesto tenero rafforza i legami, creando un'atmosfera di calda intesa e comprensione reciproca.\n<b>Lavoro:</b> Concentratevi sui dettagli, la vostra intuizione è una guida preziosa. Un piccolo successo silenzioso vi attende nel pomeriggio, frutto della vostra dedizione.\n<b>Fortuna:</b> Una brezza leggera porta chiarezza e serenità. Trovate conforto in un momento di quiete inaspettata, che vi ricarica l'anima.",
    "Leone": "<b>Amore</b>: Il cuore oggi risplende, un faro guida tra le braccia amate. Nuovi incontri portano calore inaspettato.\n<b>Lavoro</b>: La tua grinta è contagiosa, progetti avanzano con slancio. Non temere di osare, la leadership è la tua forza.\n<b>Fortuna</b>: Un piccolo gesto si trasforma in grande opportunità. Sii attento ai dettagli, la sorte sorride in silenzio.",
    "Vergine": "<b>Amore:</b> Un soffio gentile accarezza i legami, l'intesa profonda rafforza i cuori. L'ascolto apre nuove vie.\n<b>Lavoro:</b> La tua mente acuta svela nodi intricati. La dedizione porta frutti inattesi, aprendo nuove prospettive.\n<b>Fortuna:</b> Un raggio inatteso illumina il cammino, la sorte sorride con piccole, dolci sorprese. Cogli l'attimo.",
    "Bilancia": "<b>Amore:</b> Un soffio gentile accarezza i tuoi legami, invitandoti a coltivare l'armonia. L'intesa fiorisce nel dialogo sincero.\n<b>Lavoro:</b> La tua innata diplomazia apre nuove porte. Le scelte richiedono un'attenta ponderazione per un successo duraturo.\n<b>Fortuna:</b> Una stella benevola ti sorride, illuminando sentieri inattesi. Ascolta l'intuizione, essa ti guiderà verso opportunità velate.",
    "Scorpione": "<b>Amore:</b> Un soffio di passione accende il cuore, invitando a gesti audaci. Profondità emotive emergono, rafforzando legami o aprono a nuove connessioni.\n<b>Lavoro:</b> La tua intuizione è un faro prezioso. Non temere percorsi insoliti; il successo sorride a chi osa esplorare nuove vie.\n<b>Fortuna:</b> Una stella benevola veglia, portando piccole, ma significative opportunità. Sii attento ai segnali che ti circondano.",
    "Sagittario": "<b>Amore</b>: Un soffio di tenerezza avvolge il cuore, portando armonia e intesa profonda. Una scintilla accende il desiderio di connessione.\n<b>Lavoro</b>: La tua visione acuta svela nuove opportunità. Concentrazione e intuito guidano verso successi inattesi.\n<b>Fortuna</b>: Ti sorride con piccole gioie inaspettate. Semi di prosperità germogliano silenziosi nel tuo cammino.",
    "Capricorno": "<b>Amore:</b> Un'onda di tenerezza sfiora l'anima, invitando a gesti sinceri. Lascia che il cuore si apra a una profonda connessione.\n<b>Lavoro:</b> La tua perseveranza è una guida luminosa. Strategie ponderate portano frutti inaspettati; sii ricettivo a nuove idee.\n<b>Fortuna:</b> Un sussurro del destino ti indica una via inattesa. Un piccolo dettaglio può trasformarsi in una serena opportunità.",
    "Acquario": "<b>Amore:</b> Un dialogo inatteso apre sentieri del cuore, tessendo fili di comprensione profonda. Le connessioni si approfondiscono con dolce risonanza.\n<b>Lavoro:</b> La tua mente brilla di idee audaci, attirando sguardi ammirati. Collaborazioni innovative promettono un raccolto abbondante.\n<b>Fortuna:</b> Un'intuizione improvvisa squarcia il velo, guidandoti verso un'occasione d'oro. Fidati del tuo istinto, porta a esiti inattesi.",
    "Pesci": "Errore API Gemini: 429 RESOURCE_EXHAUSTED. {'error': {'code': 429, 'message': 'You exceeded your current quota, please check your plan and billing details. For more information on this error, head to: https://ai.google.dev/gemini-api/docs/rate-limits. To monitor your current usage, head to: https://ai.dev/usage?tab=rate-limit. \\n* Quota exceeded for metric: generativelanguage.googleapis.com/generate_content_free_tier_requests, limit: 10\\nPlease retry in 43.243342454s.', 'status': 'RESOURCE_EXHAUSTED', 'details': [{'@type': 'type.googleapis.com/google.rpc.Help', 'links': [{'description': 'Learn more about Gemini API quotas', 'url': 'https://ai.google.dev/gemini-api/docs/rate-limits'}]}, {'@type': 'type.googleapis.com/google.rpc.QuotaFailure', 'violations': [{'quotaMetric': 'generativelanguage.googleapis.com/generate_content_free_tier_requests', 'quotaId': 'GenerateRequestsPerMinutePerProjectPerModel-FreeTier', 'quotaDimensions': {'location': 'global', 'model': 'gemini-2.5-flash'}, 'quotaValue': '10'}]}, {'@type': 'type.googleapis.com/google.rpc.RetryInfo', 'retryDelay': '43s'}]}}"
  },
  "2025-11-02": {
    "Ariete": "<b>Amore:</b> Il cuore si apre a nuove profondità, accogliendo tenerezza e passione. Un legame speciale si rafforza, portando armonia.\n<b>Lavoro:</b> La tua energia è al culmine, spingendoti verso obiettivi ambiziosi. Concentrazione e creatività aprono nuove strade.\n<b>Fortuna:</b> Un vento favorevole soffia sulla tua giornata, portando opportunità inaspettate e momenti di pura gioia.",
    "Toro": "<b>Amore:</b> Un soffio gentile accarezza i sentimenti, rendendo i legami più profondi e sinceri.\n<b>Lavoro:</b> La tua tenacia si rivela una guida sicura, ogni sforzo trova la sua giusta ricompensa.\n<b>Fortuna:</b> Un raggio inaspettato illumina la giornata, portando armonia e serenità.",
    "Gemelli": "L'aria vibra di dolci intese; un <b>Amore</b> inatteso può sbocciare o un legame consolidarsi con nuove parole. Nel <b>Lavoro</b>, la tua mente acuta trova soluzioni innovative; non esitare a condividere la tua visione. La <b>Fortuna</b> ti sorride in piccoli gesti inaspettati, fidati del tuo intuito. Una giornata di ispirazione e leggerezza.",
    "Cancro": "<b>Amore:</b> Le stelle sussurrano dolci armonie; un gesto inatteso o una parola sincera rafforzano i legami. Ascolta il cuore.\n<b>Lavoro:</b> La tua sensibilità è una risorsa preziosa. L'intuito ti guida attraverso le sfide, portando chiarezza e successo.\n<b>Fortuna:</b> Un senso di pace interiore ti avvolge. Trova gioia nelle piccole cose e nell'accoglienza, illuminando la tua giornata.",
    "Leone": "<b>Amore:</b> Un soffio ardente accende i cuori, portando tenerezza e passione inaspettata. Lascia che la tua luce interiore guidi le parole.\n<b>Lavoro:</b> La tua visione audace trova terreno fertile. Riconoscimenti inattesi o nuove sfide stimolanti adornano il tuo percorso.\n<b>Fortuna:</b> Le stelle si allineano con benevolenza, offrendo un'occasione d'oro che illumina il cammino. Sii pronto ad accoglierla.",
    "Vergine": "<b>Amore</b>: Oggi, danza in un sussurro, un filo d'oro lega i cuori. Un gesto gentile accende la scintilla.\n<b>Lavoro</b>: La tua dedizione fiorisce, portando chiarezza e nuove, brillanti prospettive. Riconoscimenti in arrivo.\n<b>Fortuna</b>: Si manifesta in piccole, inattese armonie, guidandoti con gentilezza verso un sereno equilibrio interiore.",
    "Bilancia": "<b>Amore:</b> L'armonia dei sentimenti si manifesta, un dialogo sincero rafforza ogni legame, portando pace nel cuore.\n<b>Lavoro:</b> Le tue doti conciliatrici aprono strade inaspettate. La collaborazione porta frutti preziosi e avanzamenti.\n<b>Fortuna:</b> Un'onda di serenità ti avvolge, portando piccole, dolci sorprese inaspettate che illuminano la giornata.",
    "Scorpione": "<b>Amore:</b> Un vento gentile soffia sui vostri cuori, portando armonia e comprensione profonda. Apritevi senza timore.\n<b>Lavoro:</b> La vostra acuta intuizione guida decisioni sagge. Nuove opportunità emergono dall'ombra, attendendo il vostro tocco.\n<b>Fortuna:</b> Un inatteso raggio di sole illumina il cammino, rivelando piccole, preziose gioie nascoste. Siate ricettivi.",
    "Sagittario": "<b>Amore:</b> La scintilla dell'affetto illumina sentieri inaspettati. Segui l'istinto, le connessioni si approfondiscono con sincerità.\n<b>Lavoro:</b> Le stelle favoriscono iniziative audaci. Con chiarezza e focus, trasforma le sfide in trampolini verso nuovi orizzonti.\n<b>Fortuna:</b> Un velo di buona sorte ti avvolge. Sii pronto a cogliere doni inattesi, la serendipità sorride.",
    "Capricorno": "<b>Amore:</b> Un velo di tenerezza avvolge il cuore, cerca la profondità sincera. Le stelle invitano a condividere emozioni.\n<b>Lavoro:</b> La tua costanza getta basi solide, piccoli passi porteranno a grandi risultati insperati. La dedizione ripaga.\n<b>Fortuna:</b> Un'eco gentile di opportunità si manifesta per chi sa attendere con pazienza. Osserva i dettagli.",
    "Acquario": "<b>Amore:</b> Un vento di novità soffia sui legami, portando comprensione e passione rinnovata. Ascolta il cuore. <b>Lavoro:</b> La tua creatività è una guida luminosa; non temere di proporre idee audaci che porteranno frutti inattesi. <b>Fortuna:</b> Una scintilla di opportunità brilla all'orizzonte, attendendo solo il tuo sguardo attento per essere colta.",
    "Pesci": "<b>Amore:</b> Oggi il cuore si apre a nuove melodie. Un'intesa silenziosa rafforza i legami, o un nuovo sguardo promette dolci scoperte.\n<b>Lavoro:</b> La tua sensibilità è una bussola preziosa: segui l'istinto per superare gli ostacoli e brillare con la tua creatività.\n<b>Fortuna:</b> Ti sorride attraverso piccole, inaspettate coincidenze che alleggeriscono il cammino. Sii ricettivo."
  },
  "2025-11-03": {
    "Ariete": "<b>Amore:</b> Un filo sottile lega i cuori, offrendo dolci intese e passione rinnovata. Apri l'anima alla connessione.\n<b>Lavoro:</b> Energia vibrante guida i tuoi passi, trasformando ostacoli in opportunità. Agisci con determinazione e fiducia.\n<b>Fortuna:</b> Una stella benevola illumina il cammino, portando piccole gioie inaspettate. Sii ricettivo alle sorprese.",
    "Toro": "<b>Amore:</b> Un soffio gentile accarezza i vostri legami, portando comprensione e dolci intese. Aprite il cuore con fiducia.\n<b>Lavoro:</b> La perseveranza è la vostra guida. Nuove sfide si presentano, affrontatele con calma e determinazione costante.\n<b>Fortuna:</b> Una stella benevola vi illumina, offrendo piccole opportunità inaspettate. Siate pronti a coglierle con gratitudine.",
    "Gemelli": "<b>Amore:</b> Le parole volano, tessendo ponti tra i cuori. Un dialogo sincero accende nuove scintille o rafforza legami esistenti, donando leggerezza all'anima.\n<b>Lavoro:</b> La tua mente è agile, pronta a cogliere nuove sfide. Le idee fluiscono, portando soluzioni brillanti e inattese opportunità, sfrutta la tua versatilità.\n<b>Fortuna:</b> Un soffio leggero ti guida verso piccole, ma significative, sincronicità. Sii attento ai segnali, l'universo sussurra un segreto.",
    "Cancro": "<b>Amore:</b> La luna accarezza i vostri sentimenti, favorendo dolci intese e profonde connessioni. Ascoltate il cuore, si riveleranno momenti preziosi.\n<b>Lavoro:</b> L'intuito è la vostra guida più fedele. Le collaborazioni fioriscono, portando stabilità e piccole, gratificanti scoperte.\n<b>Fortuna:</b> Un inatteso raggio di sole illumina la vostra casa o un gesto gentile vi regala serenità. Abbracciate la tranquillità.",
    "Leone": "<b>Amore:</b> La tua passione risplende, attirando sguardi e cuori. Un'intesa profonda può fiorire inaspettata.\n<b>Lavoro:</b> Le tue idee brillano, aprendo strade verso il successo. Affronta le sfide con audacia e determinazione.\n<b>Fortuna:</b> Un'onda di energia positiva ti accompagna, offrendo piccole gioie e opportunità velate. Sii ricettivo.",
    "Vergine": "<b>Amore:</b> Oggi i cuori si intrecciano con dolcezza inattesa. Ascolta e sarai ascoltato, trovando armonia in gesti e parole sincere.\n\n<b>Lavoro:</b> La tua dedizione porta frutti inaspettati. Concentrati sui dettagli, una piccola svolta precisa è all'orizzonte.\n\n<b>Fortuna:</b> Una serena intuizione ti guida verso un inatteso, piccolo favore. Abbi fiducia nel tuo istinto silenzioso.",
    "Bilancia": "Un delicato influsso celeste avvolge i vostri affetti. <b>Amore</b>: Le parole non dette trovano un eco, nutrite la vicinanza con gesti semplici ma sentiti. <b>Lavoro</b>: La vostra innata diplomazia vi guida, un'intuizione vi schiude nuove prospettive. Siate aperti al dialogo. <b>Fortuna</b>: Una piccola sorpresa allieta la giornata, un soffio di leggerezza vi accompagna, portando opportunità inattese.",
    "Scorpione": "<b>Amore:</b> Un'onda emotiva profonda ti avvolge, rivelando desideri nascosti. La passione si accende, porta rivelazioni.\n<b>Lavoro:</b> Il tuo acume strategico è affinato. Decisioni prese con intuito apriranno nuove, inaspettate, strade.\n<b>Fortuna:</b> Energie sottili ti guidano. Fida il tuo istinto; un piccolo rischio oggi può generare grandi ricompense inattese.",
    "Sagittario": "<b>Amore:</b> Il cuore danza al ritmo di un'intesa profonda; le parole sincere aprono nuovi orizzonti di affetto e comprensione.\n<b>Lavoro:</b> La mente è acuta, pronta a cogliere sfide e trasformarle in successi brillanti. L'energia creativa fluisce liberamente.\n<b>Fortuna:</b> Una scintilla inattesa illumina il cammino, portando piccoli doni dal destino e sorrisi spontanei.",
    "Capricorno": "<b>Amore:</b> Un filo d'oro lega i cuori, rivelando intese profonde in sguardi teneri e momenti di quiete. <b>Lavoro:</b> La tua dedizione plasma orizzonti; un seme piantato oggi fiorirà con promesse chiare e stabili. <b>Fortuna:</b> Una lieve brezza porta doni inattesi, sussurrando opportunità. La serenità è la tua più luminosa stella guida.",
    "Acquario": "<b>Amore:</b> Oggi i cuori si allineano, portando chiarezza in un abbraccio inatteso. Lasciatevi guidare dal flusso gentile delle emozioni, troverete conforto e comprensione.\n<b>Lavoro:</b> La vostra ingegnosità brilla, svelando soluzioni innovative. Collaborazioni fruttuose aprono nuove vie, portando riconoscimento al vostro impegno.\n<b>Fortuna:</b> Un velo di serendipità vi avvolge. Fidatevi dell'intuito, vi condurrà verso piccole ma significative vittorie e momenti di gioia inaspettata.",
    "Pesci": "Oggi, <b>Amore</b> sussurra segreti dolci, unendo i cuori in comprensione profonda. Nel <b>Lavoro</b>, la tua intuizione è una guida luminosa; segui il flusso per superare ogni ostacolo. La <b>Fortuna</b> ti sorride con piccole, inaspettate armonie che portano serenità interiore."
  },
  "2025-11-04": {
    "Ariete": "<b>Amore:</b> Un'intesa profonda illumina i tuoi legami, lasciando spazio alla tenerezza. Comunica apertamente.\n<b>Lavoro:</b> Le idee brillano e le sfide si trasformano in opportunità. Concentra la tua energia sui nuovi progetti.\n<b>Fortuna:</b> Un'onda positiva ti avvolge, portando con sé inaspettate occasioni di crescita e gioia.",
    "Toro": "<b>Amore:</b> Un soffio gentile accarezza il tuo cuore, portando calore e stabilità. Condividi un momento di pura intimità, la tenerezza è la tua forza.\n<b>Lavoro:</b> La tua perseveranza svela nuove vie. Concentrati sui dettagli pratici, il progresso costante porta frutti duraturi.\n<b>Fortuna:</b> Una scintilla inaspettata illumina la tua giornata, frutto della tua salda dedizione. Goditi i piccoli piaceri.",
    "Gemelli": "<b>Amore:</b> Un dialogo sincero rischiara i cuori, portando chiarezza e affetto. Cogli l'attimo per esprimere ciò che senti con delicatezza.\n\n<b>Lavoro:</b> La tua creatività è un faro. Nuove idee brillano, favorendo collaborazioni e successi inaspettati. Sii audace nelle tue proposte.\n\n<b>Fortuna:</b> Un velo di magia avvolge la giornata, con piccole, inattese gioie che colorano il cammino. Resta aperto alle sorprese.",
    "Cancro": "<b>Amore:</b> Il tuo cuore, profondo come l'oceano, trova oggi dolci rive. Un gesto di affetto porta calore e comprensione reciproca.\n<b>Lavoro:</b> L'intuizione è la tua bussola migliore; affidati a essa per navigare le sfide e cogliere nuove opportunità.\n<b>Fortuna:</b> Un'energia serena ti avvolge. Lasciati guidare dalla corrente, un piccolo imprevisto si rivelerà un dono.",
    "Leone": "<b>Amore:</b> Un raggio di passione illumina i legami, favorendo intime conversazioni che rafforzano il cuore e l'intesa.\n<b>Lavoro:</b> Il tuo spirito ardente attira nuove opportunità. Idee brillanti aprono la strada, portando un riconoscimento meritato.\n<b>Fortuna:</b> Un velo di fortuna ti avvolge, rivelando piccoli vantaggi e inattesi sorrisi. Confida nel tuo cammino.",
    "Vergine": "<b>Amore:</b> I sentimenti sbocciano nella comprensione reciproca. Un tocco gentile o una parola sincera rafforza i legami.\n<b>Lavoro:</b> La tua dedizione porta frutti inaspettati. Concentrazione e precisione aprono nuove prospettive.\n<b>Fortuna:</b> Un piccolo aiuto dal destino ti guida verso opportunità sottili ma significative. Sii attento ai segnali.",
    "Bilancia": "<b>Amore:</b> L'armonia dei cuori risuona, portando comprensione e vicinanza. Momenti di profonda connessione rafforzano i legami esistenti.\n<b>Lavoro:</b> La tua diplomazia brilla, risolvendo questioni e favorendo accordi. Le collaborazioni si rivelano fruttuose, porta equilibrio.\n<b>Fortuna:</b> Un vento gentile soffia a tuo favore, portando piccoli piaceri inaspettati. Trovi serenità in un equilibrio ritrovato.",
    "Scorpione": "Un'eco lontana risveglia il cuore, portando <b>amore</b> inaspettato o un'intesa più profonda. Nel <b>lavoro</b>, le tue intuizioni guidano decisioni sagge, spianando la strada al successo. La <b>fortuna</b> ti sorride con opportunità celate, pronte a rivelarsi. Cogli l'attimo, il destino ti è propizio.",
    "Sagittario": "Un soffio gentile accarezza il tuo cuore, portando armonia e intesa nelle relazioni. Nel <b>lavoro</b>, idee brillanti aprono nuove prospettive; la tua energia creativa è la chiave del successo. La <b>fortuna</b> ti sorride con piccole, inaspettate gioie, tessendo un filo d'oro nella tua giornata.",
    "Capricorno": "<b>Amore:</b> Un soffio gentile accarezza l'anima, rendendo i legami più profondi e sinceri. Non esitare a condividere i tuoi sentimenti.\n<b>Lavoro:</b> La tua dedizione illumina il percorso; un compito complesso trova finalmente la sua risoluzione. Persisti con saggezza.\n<b>Fortuna:</b> Un piccolo dono inatteso o un'intuizione fortunata ti sorriderà, portando leggerezza e un tocco di gioia alla giornata.",
    "Acquario": "Oggi, l'amore danza leggero, portando comprensione inaspettata e unione profonda. Nel <b>lavoro</b>, la tua mente brillante fiorisce con idee innovative; condividile, saranno apprezzate. La <b>fortuna</b> sorride in piccoli, sereni momenti di pace interiore, guidandoti con discreta benevolenza.",
    "Pesci": "<b>Amore</b>: Il tuo cuore sussurra melodie antiche, ascolta il suo canto. Connessioni profonde ti avvolgono, lasciati trasportare dalla corrente emotiva.\n\n<b>Lavoro</b>: La creatività fluisce, guidandoti in acque tranquille. Fida il tuo istinto per risolvere dilemmi, la tua visione è una risorsa preziosa.\n\n<b>Fortuna</b>: Un velo di magia ti circonda. Piccoli gesti portano grandi sorrisi, abbraccia la serendipità e la pace interiore."
  },
  "2025-11-05": {
    "Ariete": "<b>Amore:</b> Il tuo cuore audace cerca verità; le stelle accendono passioni inattese o rinsaldano legami. Sii sincero.\n<b>Lavoro:</b> L'energia propulsiva trova terreno fertile. Le sfide odierne stimolano l'ingegno, un passo avanti premia la tua determinazione.\n<b>Fortuna:</b> Una brezza favorevole soffia verso di te. Riconosci le opportunità nascoste, un piccolo rischio potrebbe portare grandi frutti.",
    "Toro": "<b>Amore:</b> Un soffio di tenerezza rinfresca i legami, portando comprensione e vicinanza. Lasciati avvolgere dall'affetto sincero.\n<b>Lavoro:</b> La tua dedizione porta frutti. Un'idea brillante illumina il percorso, promettendo avanzamenti stabili.\n<b>Fortuna:</b> Un piccolo colpo di scena inaspettato ti regala un sorriso e alleggerisce il cuore. Cogli l'attimo.",
    "Gemelli": "<b>Amore:</b> I venti della passione soffiano lievi, portando messaggi segreti tra i cuori. Ascolta l'eco delle emozioni.\n<b>Lavoro:</b> Un'idea brillante illumina il tuo percorso. Collaborazioni inaspettate possono aprire nuove porte verso il successo.\n<b>Fortuna:</b> Il destino ti sorride con una piccola, dolce sorpresa. Sii pronto a cogliere l'attimo di pura gioia.",
    "Cancro": "<b>Amore:</b> I sentimenti affiorano, nutrendo legami preziosi. Un gesto gentile rafforza la connessione.\n<b>Lavoro:</b> La tua intuizione è una guida fidata; ascoltala per avanzare con saggezza.\n<b>Fortuna:</b> Trova serenità nei piccoli piaceri domestici e nel calore familiare. Un momento di pace ti ricarica.",
    "Leone": "<b>Amore:</b> Il cuore si accende di nuove fiamme, o vecchie passioni rinascono. Esprimi i tuoi sentimenti con ardore, il cosmo ti ascolta.\n<b>Lavoro:</b> La tua energia creativa è al culmine. Guida con visione, le tue idee brillano e ottengono riconoscimento meritato.\n<b>Fortuna:</b> Un sussurro del destino ti guida verso un inatteso, piccolo dono. Segui l'istinto per cogliere l'attimo propizio.",
    "Vergine": "<b>Amore:</b> Un'armonia sottile fiorisce nel cuore, invitandoti a condividere emozioni sincere e profondi silenzi con chi ami.\n<b>Lavoro:</b> La tua acutezza analitica brilla, svelando soluzioni innovative. Non temere di proporre le tue idee con fiducia.\n<b>Fortuna:</b> Si cela in dettagli inattesi; un incontro fortuito o un'intuizione improvvisa possono aprire nuove e promettenti strade.",
    "Bilancia": "<b>Amore:</b> L'armonia dimora nei cuori, e il dialogo aprirà nuove dolci vie. Condividi le emozioni più pure, rafforzando i legami con tenerezza.\n\n<b>Lavoro:</b> Le tue idee brillano, portando chiarezza. Accetta collaborazioni e prendi decisioni con saggezza, il successo ti sorride.\n\n<b>Fortuna:</b> Un soffio leggero ti guida. Segui l'intuito per piccole ma piacevoli sorprese che renderanno la giornata più serena.",
    "Scorpione": "<b>Amore:</b> Il cuore ascolta echi profondi, avvicinando anime con sussurri sinceri. La passione trova nuove espressioni.\n<b>Lavoro:</b> La mente acuta decifra enigmi, forgiando opportunità nel crogiolo dell'impegno. La determinazione porta risultati inattesi.\n<b>Fortuna:</b> Un velo di benevolenza si posa lieve, illuminando piccole gioie con bagliori improvvisi. Sii ricettivo ai doni inattesi.",
    "Sagittario": "<b>Amore:</b> Il cuore si apre a nuove melodie, lasciando spazio a incontri inattesi o a dolci intese. La passione si accende.\n<b>Lavoro:</b> La tua visione chiara guida i passi. Collaborazioni fortunate portano a risultati sorprendenti, superando ogni ostacolo.\n<b>Fortuna:</b> Un raggio inaspettato illumina la giornata, portando piccole gioie e occasioni da cogliere al volo. Fidati del tuo intuito.",
    "Capricorno": "<b>Amore:</b> Un filo invisibile lega cuori, approfondendo legami esistenti o accendendo una scintilla nuova e promettente. Lasciatevi guidare dal sentire.\n<b>Lavoro:</b> La vostra dedizione porta frutti. Un'opportunità inaspettata emerge, richiedendo la vostra acuta visione. Agite con risolutezza.\n<b>Fortuna:</b> Il destino sorride. Piccole coincidenze si allineano, portando un inatteso raggio di luce sulla vostra giornata.",
    "Acquario": "<b>Amore</b>: Un soffio gentile avvicina i cuori, rivelando connessioni profonde. Lascia che l'armonia guidi le tue parole.\n<b>Lavoro</b>: La tua mente brilla di idee innovative. Non temere di proporle; il successo è a portata di mano per chi osa.\n<b>Fortuna</b>: Una sincronicità inattesa ti sorriderà, portando un raggio di luce e una serena consapevolezza interiore.",
    "Pesci": "Errore API Gemini: 429 RESOURCE_EXHAUSTED. {'error': {'code': 429, 'message': 'You exceeded your current quota, please check your plan and billing details. For more information on this error, head to: https://ai.google.dev/gemini-api/docs/rate-limits. To monitor your current usage, head to: https://ai.dev/usage?tab=rate-limit. \\n* Quota exceeded for metric: generativelanguage.googleapis.com/generate_content_free_tier_requests, limit: 10\\nPlease retry in 9.089957123s.', 'status': 'RESOURCE_EXHAUSTED', 'details': [{'@type': 'type.googleapis.com/google.rpc.Help', 'links': [{'description': 'Learn more about Gemini API quotas', 'url': 'https://ai.google.dev/gemini-api/docs/rate-limits'}]}, {'@type': 'type.googleapis.com/google.rpc.QuotaFailure', 'violations': [{'quotaMetric': 'generativelanguage.googleapis.com/generate_content_free_tier_requests', 'quotaId': 'GenerateRequestsPerMinutePerProjectPerModel-FreeTier', 'quotaDimensions': {'location': 'global', 'model': 'gemini-2.5-flash'}, 'quotaValue': '10'}]}, {'@type': 'type.googleapis.com/google.rpc.RetryInfo', 'retryDelay': '9s'}]}}"
  },
  "2025-11-06": {
    "Ariete": "<b>Amore:</b> Un barlume inaspettato accende il cuore, tessendo fili di intesa profonda. Lasciati guidare dalla dolcezza, un abbraccio rassicura.\n<b>Lavoro:</b> La tua energia focosa illumina la strada. Un'intuizione brillante porta a scelte vincenti. Agisci con coraggio, il successo è vicino.\n<b>Fortuna:</b> Stelle propizie sussurrano opportunità. Un piccolo gesto o evento aprirà porte inattese. Sii pronto ad accogliere la buona sorte.",
    "Toro": "<b>Amore:</b> Un soffio gentile accarezza i vostri sentimenti, favorendo momenti di tenera intesa e connessioni profonde. Lasciatevi guidare dal cuore.\n<b>Lavoro:</b> Con mano ferma coltivate i vostri progetti; la costanza oggi porta frutti inaspettati e riconoscimenti meritati. Non desistete.\n<b>Fortuna:</b> Una piccola scintilla illumina il cammino, portando una serena sorpresa o un'intuizione preziosa. Fidatevi del vostro istinto.",
    "Gemelli": "<b>Amore:</b> Il cuore è un giardino che attende cura, un dialogo sincero fiorirà con dolcezza e nuove intese.\n<b>Lavoro:</b> La mente è agile, pronta a tessere nuove trame; scegli con saggezza dove indirizzare i tuoi fili per il successo.\n<b>Fortuna:</b> Una brezza inaspettata sussurra opportunità; ascolta l'intuizione, ti condurrà a una piacevole scoperta.",
    "Cancro": "<b>Amore:</b> Il cuore sussurra melodie antiche, trovando eco in sguardi complici. L'affetto si rafforza, tessendo fili d'oro preziosi.\n<b>Lavoro:</b> La tua dedizione illumina sentieri inesplorati. Un'intuizione guida i tuoi passi verso orizzonti produttivi e sereni.\n<b>Fortuna:</b> Una stella benevola sorride su di te. Aspettati un piccolo, inatteso dono dal destino, guidato dalla tua sensibilità.",
    "Leone": "<b>Amore:</b> Un calore regale avvolge i tuoi affetti. Esprimi sentimenti profondi, l'intesa fiorirà in gesti indimenticabili.\n<b>Lavoro:</b> La tua luce interiore guida progetti ambiziosi. Con determinazione, supererai ostacoli e otterrai riconoscimenti meritati.\n<b>Fortuna:</b> Stelle propizie illuminano il tuo cammino. Sii audace, un piccolo rischio potrebbe portare a grandi ricompense inattese.",
    "Vergine": "<b>Amore:</b> Un soffio di tenerezza riscalda il cuore, portando armonia e comprensione. Condividete momenti sereni che rafforzano i legami.\n<b>Lavoro:</b> La precisione è la vostra alleata; un dettaglio, apparentemente minore, può svelare nuove opportunità o risolvere un enigma.\n<b>Fortuna:</b> Un piccolo ma significativo colpo di fortuna vi attende, forse celato in un incontro inaspettato o in una notizia sorprendente.",
    "Bilancia": "<b>Amore:</b> Un soffio gentile di comprensione ravviva legami. La tua grazia attira armonia, risolvendo vecchie incertezze con un sorriso sincero.\n<b>Lavoro:</b> La diplomazia è la tua stella guida. Negoziati e collaborazioni fioriscono sotto il tuo tocco equilibrato. Evita decisioni affrettate.\n<b>Fortuna:</b> Incontri inaspettati portano nuove prospettive, aprendo porte su sentieri sereni e gratificanti. Confida nell'equilibrio cosmico.",
    "Scorpione": "<b>Amore:</b> Il cuore si apre a nuove profondità, rivelando un legame intenso. La passione fiorisce sotto una luce intima e vera.\n<b>Lavoro:</b> La tua perspicacia trionfa. Strategie astute portano a successi inattesi, trasformando ostacoli in opportunità preziose.\n<b>Fortuna:</b> Un'onda invisibile ti sostiene. Segui l'istinto, ti guiderà verso un inaspettato prospero destino.",
    "Sagittario": "<b>Amore:</b> Un soffio di complicità avvolge il cuore, rendendo ogni sguardo un ponte. Ascolta le sfumature emotive.\n<b>Lavoro:</b> La tua mente brilla con idee fresche. Non esitare a condividerle, potrebbero aprire nuove strade inaspettate.\n<b>Fortuna:</b> Un piccolo, inatteso dono dell'universo si manifesta. Sii ricettivo e cogli l'attimo con gratitudine.",
    "Capricorno": "<b>Amore:</b> Un soffio gentile accarezza i legami; sii presente, le parole non dette contano.\n<b>Lavoro:</b> La tua costanza porta frutti inattesi. Non temere di osare, la precisione è la tua forza.\n<b>Fortuna:</b> Un piccolo dono del destino ti attende. Osserva i dettagli, lì risiede la chiave.",
    "Acquario": "<b>Amore:</b> I legami si rafforzano, un sussurro di tenerezza avvolge il vostro cuore. Ascoltate l'intuizione, vi guiderà.\n<b>Lavoro:</b> Le vostre idee brillano, portando soluzioni originali. La creatività è la vostra forza oggi, osate proporre.\n<b>Fortuna:</b> Una brezza favorevole soffia inaspettata. Siate ricettivi, una piccola, piacevole sorpresa potrebbe illuminare la giornata.",
    "Pesci": "Errore API Gemini: 429 RESOURCE_EXHAUSTED. {'error': {'code': 429, 'message': 'You exceeded your current quota, please check your plan and billing details. For more information on this error, head to: https://ai.google.dev/gemini-api/docs/rate-limits. To monitor your current usage, head to: https://ai.dev/usage?tab=rate-limit. \\n* Quota exceeded for metric: generativelanguage.googleapis.com/generate_content_free_tier_requests, limit: 10\\nPlease retry in 47.548598611s.', 'status': 'RESOURCE_EXHAUSTED', 'details': [{'@type': 'type.googleapis.com/google.rpc.Help', 'links': [{'description': 'Learn more about Gemini API quotas', 'url': 'https://ai.google.dev/gemini-api/docs/rate-limits'}]}, {'@type': 'type.googleapis.com/google.rpc.QuotaFailure', 'violations': [{'quotaMetric': 'generativelanguage.googleapis.com/generate_content_free_tier_requests', 'quotaId': 'GenerateRequestsPerMinutePerProjectPerModel-FreeTier', 'quotaDimensions': {'location': 'global', 'model': 'gemini-2.5-flash'}, 'quotaValue': '10'}]}, {'@type': 'type.googleapis.com/google.rpc.RetryInfo', 'retryDelay': '47s'}]}}"
  },
  "2025-11-07": {
    "Ariete": "<b>Amore:</b> Un soffio gentile accarezza il cuore, portando armonia e intesa profonda con chi ami. Apriti alla tenerezza.\n<b>Lavoro:</b> Le tue idee brillano, trova il coraggio di esprimerle. La dedizione di oggi prepara frutti succosi per il tuo domani.\n<b>Fortuna:</b> Un'onda inaspettata ti solleva, guidandoti verso lidi sereni. Segui l'intuizione, è la tua bussola più fidata.",
    "Toro": "<b>Amore:</b> L'amore fiorisce in gesti semplici e sinceri, portando calore e intesa profonda. Lasciatevi avvolgere da dolci certezze.\n<b>Lavoro:</b> Il lavoro procede con passo fermo; la vostra tenacia costruirà basi solide. Le sfide si affrontano con pragmatismo.\n<b>Fortuna:</b> Si manifesta in piccole, inattese gioie che rasserenano l'animo e confermano la direzione.",
    "Gemelli": "<b>Amore</b>: Un soffio gentile porta chiarezza nei sentimenti. Dialoghi aperti rafforzano i legami, rivelando nuove e dolci prospettive.\n<b>Lavoro</b>: La tua mente è una scintilla, accendi idee brillanti. La collaborazione oggi fiorisce, portando frutti inattesi.\n<b>Fortuna</b>: Piccole sincronicità colorano la giornata. Segui il tuo intuito, ti guiderà verso piacevoli sorprese e armonie inattese.",
    "Cancro": "<b>Amore:</b> Il cuore si apre a tenerezze inattese, trova conforto sincero in gesti gentili. Lascia che le emozioni ti guidino dolcemente.\n<b>Lavoro:</b> L'intuito è la tua bussola oggi, guidando decisioni sagge e chiare in progetti attuali. Fidati della tua percezione.\n<b>Fortuna:</b> Un'onda serena ti accarezza, rivelando opportunità inaspettate nel tuo rifugio. La tranquillità porta doni.",
    "Leone": "<b>Amore:</b> La passione illumina i tuoi legami. Un gesto di generosità rafforza i sentimenti, portando calore inatteso nel tuo cuore radioso.\n<b>Lavoro:</b> La tua leadership brilla. Le idee audaci trovano terreno fertile, preparandoti a raccogliere frutti di successo e ammirazione. Mostra la tua luce.\n<b>Fortuna:</b> Un raggio inatteso ti sorride. Sii pronto a cogliere le opportunità che il destino ti presenta con un dono propizio e meritato.",
    "Vergine": "<b>Amore:</b> Un soffio d'armonia avvolge i legami; la comprensione reciproca fiorisce in dialoghi sinceri e costruttivi.\n\n<b>Lavoro:</b> L'attenzione al dettaglio rivela nuove opportunità. La tua dedizione sarà notata, aprendo strade inattese verso il successo.\n\n<b>Fortuna:</b> Un raggio discreto illumina piccole gioie quotidiane. Ascolta l'intuizione per cogliere momenti propizi e inaspettati.",
    "Bilancia": "<b>Amore:</b> Una brezza gentile accarezza il cuore, intessendo armonia e profonda intesa. Connessioni sincere fioriscono inattese.\n<b>Lavoro:</b> La tua innata diplomazia guida scelte sagge. Collaborazioni fruttuose ti attendono, chiarendo il percorso con grazia.\n<b>Fortuna:</b> Un raggio inatteso illumina il cammino, portando serenità e piccole, dolci sorprese. Segui la tua intuizione.",
    "Scorpione": "<b>Amore:</b> Oggi, un velo si solleva, rivelando profondità inaspettate. Ascolta il sussurro del cuore; un'intesa si fa più forte, illuminando percorsi comuni.\n<b>Lavoro:</b> La tua acuta percezione guida ogni passo. Affronta le sfide con astuzia; un progetto complesso si svela, portando riconoscimento e chiarezza.\n<b>Fortuna:</b> L'universo ti sorride con sottili indizi. Fidati del tuo intuito, ti condurrà verso un'opportunità inattesa o una soluzione liberatoria.",
    "Sagittario": "<b>Amore:</b> Un soffio gentile accarezza i vostri legami, portando chiarezza e passione. Condividete momenti preziosi, il cuore trova risposte in un abbraccio sincero.\n<b>Lavoro:</b> La mente è acuta, pronta a cogliere nuove prospettive. Affrontate le sfide con slancio, la vostra visione aprirà porte inaspettate. Siate audaci.\n<b>Fortuna:</b> Un piccolo raggio di sole illumina il cammino. Fidatevi dell'istinto, un evento fortuito può portarvi una gioia inattesa o una soluzione attesa.",
    "Capricorno": "<b>Amore:</b> Un soffio gentile accarezza i legami, donando profondità e comprensione reciproca. Ascolta il cuore, nutri la vicinanza.\n<b>Lavoro:</b> La tua dedizione strategica porta frutti stabili. Riconoscimenti inattesi potrebbero illuminare il tuo cammino. Sii tenace.\n<b>Fortuna:</b> Una piccola sorpresa positiva si annuncia, portando serenità inaspettata. Abbraccia l'ottimismo discreto.",
    "Acquario": "<b>Amore:</b> Una brezza gentile soffia, portando armonia. Connessioni profonde si rafforzano, o nuove scintille accendono il cuore. Sii aperto alle emozioni che fluiscono.\n<b>Lavoro:</b> La tua visione unica è un faro. Idee innovative trovano terreno fertile. Sii audace nel proporre e collaborare, il successo è vicino.\n<b>Fortuna:</b> Le stelle si allineano favorevolmente. Piccole opportunità inattese possono svelarsi. Segui l'intuizione, è la tua guida migliore.",
    "Pesci": "<b>Amore</b>: Le correnti emotive si fanno più dolci, portando intesa e vicinanza inaspettata. Lasciatevi guidare dal cuore per connessioni profonde.\n<b>Lavoro</b>: La vostra intuizione è una bussola preziosa. Seguitela per navigare tra le sfide e scoprire nuove soluzioni creative.\n<b>Fortuna</b>: Un velo di serenità vi avvolge, rivelando piccole gioie e inattese benedizioni lungo il cammino. Abbracciate la tranquillità."
  },
  "2025-11-08": {
    "Ariete": "<b>Amore:</b> Oggi il cuore si apre a nuove melodie; un legame si rafforza con dolcezza. Lasciati guidare dall'intuito, la passione risplende.\n<b>Lavoro:</b> Le sfide si trasformano in opportunità. Con coraggio e determinazione, supererai ostacoli, mostrando la tua vera forza.\n<b>Fortuna:</b> Un vento favorevole soffia sulla tua strada. Mantieni gli occhi aperti per un'occasione inattesa che può illuminare la giornata.",
    "Toro": "<b>Amore:</b> La quiete del cuore porta armonia. Un gesto gentile rafforza legami, riscopri la bellezza della condivisione profonda.\n<b>Lavoro:</b> La tua costanza apre nuove vie. Una visione chiara illumina i tuoi passi, affronta le sfide con serena determinazione.\n<b>Fortuna:</b> Ascolta la voce interiore. Ti condurrà a inattese opportunità, un'energia positiva ti avvolge.",
    "Gemelli": "<b>Amore:</b> Un soffio di intesa ravviva i legami, portando chiarezza e connessioni più profonde. Ascolta il cuore, vibrerà di armonia.\n<b>Lavoro:</b> La tua mente brilla, generando idee innovative che aprono nuove opportunità. Collaborazioni fruttuose ti aspettano.\n<b>Fortuna:</b> Un piccolo colpo di scena inatteso ti sorride, guidato da un'intuizione felice. Segui quel sentiero luminoso.",
    "Cancro": "<b>Amore:</b> Un'onda di tenerezza avvolge il tuo cuore. Le connessioni si approfondiscono, trova dolcezza nelle parole non dette e nei gesti sinceri.\n<b>Lavoro:</b> La tua intuizione è una bussola preziosa. Affronta le sfide con creatività, nuove idee fioriscono se coltivate con cura.\n<b>Fortuna:</b> Piccoli doni inaspettati rallegreranno la giornata. Sii aperto alle sorprese, la serenità è a portata di mano.",
    "Leone": "<b>Amore:</b> Una scintilla accende il cuore, portando intese profonde e sguardi che parlano. Lasciatevi guidare dalla passione.\n<b>Lavoro:</b> La vostra determinazione apre nuove vie. Progetti importanti avanzano, portando riconoscimento e successo.\n<b>Fortuna:</b> Un raggio di luce illumina il cammino, offrendo piccole gioie inattese e soluzioni sorprendenti.",
    "Vergine": "<b>Amore:</b> Un sussurro d'affetto rischiara il tuo cielo interiore, invitandoti a un momento di profonda connessione.\n<b>Lavoro:</b> La tua innata precisione sarà la chiave; affronta i dettagli con cura, e il riconoscimento arriverà.\n<b>Fortuna:</b> Una piccola, inattesa coincidenza disegna nuove opportunità, fidati del flusso degli eventi.",
    "Bilancia": "<b>Amore:</b> L'armonia bussa alla tua porta, invita a dialoghi che rafforzano i cuori. Trova equilibrio nel dare e ricevere.\n<b>Lavoro:</b> La tua innata giustizia guida scelte importanti. Collabora, cerca il consenso: il successo è nel condiviso.\n<b>Fortuna:</b> Un sussurro inatteso dal destino ti guida. Sii ricettivo, una piccola sorpresa può illuminare il tuo cammino con grazia.",
    "Scorpione": "<b>Amore:</b> Sentimenti profondi affiorano, invitandoti a connessioni autentiche. Lascia che la passione guidi le tue scelte con onestà e verità.\n<b>Lavoro:</b> La tua mente strategica brilla, superando ostacoli con acume. Sii astuto, le opportunità si celano tra le sfide apparenti.\n<b>Fortuna:</b> Un'intuizione improvvisa ti mostra la via migliore. Fidati della tua saggezza interiore; il destino sorride ai coraggiosi.",
    "Sagittario": "<b>Amore:</b> Un soffio di complicità avvolge i cuori, rivelando intese profonde. Ascolta e rispondi con tenerezza sincera.\n<b>Lavoro:</b> Le idee brillano, portando chiarezza e nuove direzioni. Sfrutta questa energia per avanzare con coraggio.\n<b>Fortuna:</b> Un'onda inaspettata di buon auspicio illumina il cammino. Accogli i doni del caso con gratitudine e apertura.",
    "Capricorno": "Oggi, l'<b>Amore</b> sussurra armonie inattese; apri il cuore alla comprensione, non alla mera logica. Nel <b>Lavoro</b>, la tua instancabile dedizione si manifesta in progressi tangibili; persevera con fiducia. La <b>Fortuna</b> ti sorride con piccole, preziose ricompense, frutto del tuo impegno. Cogli ogni attimo.",
    "Acquario": "<b>Amore:</b> Un'onda di comprensione avvolge i vostri legami, invitando a dialoghi profondi e connessioni autentiche. Lasciatevi guidare dal cuore.\n<b>Lavoro:</b> La vostra mente brillante è un faro. Idee uniche fioriscono; condividetele. La collaborazione apre nuove, inattese porte.\n<b>Fortuna:</b> Piccoli, luminosi serendipity vi attendono. L'intuizione è la vostra bussola, fidatevi dei segnali che la vita vi offre.",
    "Pesci": "Errore API Gemini: 429 RESOURCE_EXHAUSTED. {'error': {'code': 429, 'message': 'You exceeded your current quota, please check your plan and billing details. For more information on this error, head to: https://ai.google.dev/gemini-api/docs/rate-limits. To monitor your current usage, head to: https://ai.dev/usage?tab=rate-limit. \\n* Quota exceeded for metric: generativelanguage.googleapis.com/generate_content_free_tier_requests, limit: 10\\nPlease retry in 1.140755619s.', 'status': 'RESOURCE_EXHAUSTED', 'details': [{'@type': 'type.googleapis.com/google.rpc.Help', 'links': [{'description': 'Learn more about Gemini API quotas', 'url': 'https://ai.google.dev/gemini-api/docs/rate-limits'}]}, {'@type': 'type.googleapis.com/google.rpc.QuotaFailure', 'violations': [{'quotaMetric': 'generativelanguage.googleapis.com/generate_content_free_tier_requests', 'quotaId': 'GenerateRequestsPerMinutePerProjectPerModel-FreeTier', 'quotaDimensions': {'location': 'global', 'model': 'gemini-2.5-flash'}, 'quotaValue': '10'}]}, {'@type': 'type.googleapis.com/google.rpc.RetryInfo', 'retryDelay': '1s'}]}}"
  },
  "2025-11-09": {
    "Ariete": "<b>Amore:</b> La passione si riaccende, offrendo un'intesa profonda con chi ami. Un gesto inatteso porta tenerezza e vicinanza.\n<b>Lavoro:</b> Concentrazione acuta rivela soluzioni brillanti. Cogli l'opportunità di mostrare il tuo valore con determinazione e coraggio.\n<b>Fortuna:</b> Una brezza favorevole soffia verso te, illuminando il cammino. Fida nell'intuizione, sarà la tua guida migliore.",
    "Toro": "<b>Amore:</b> Il cuore sussurra melodie tenere, invitandovi a un abbraccio sincero. Condividete la dolcezza trovando conforto nella vicinanza.\n<b>Lavoro:</b> La vostra tenacia trova terreno fertile. Piccoli passi portano a grandi risultati, con chiarezza di intenti e stabilità nelle azioni.\n<b>Fortuna:</b> Una brezza leggera vi accompagna, favorendo incontri inattesi o intuizioni preziose. Cogliete ogni piccolo segno.",
    "Gemelli": "<b>Amore:</b> Le stelle tessono fili d'oro nei tuoi dialoghi, accendendo scintille d'intesa profonda che rafforzano cuori e passioni.\n<b>Lavoro:</b> La tua agile mente è una fonte di luce; idee brillanti sbocciano, guidandoti verso orizzonti di successo inattesi.\n<b>Fortuna:</b> Un vento propizio porta sussurri di buona sorte. Resta attento, un incontro casuale o un messaggio inatteso nasconde una gemma preziosa.",
    "Cancro": "<b>Amore:</b> Un'onda di tenerezza avvolge il cuore, favorendo intese profonde e sussurri d'anima. L'armonia regna nei legami.\n<b>Lavoro:</b> La tua intuizione guida passi sicuri verso nuove opportunità. Concentrazione e creatività portano a risultati gratificanti.\n<b>Fortuna:</b> Un piccolo gesto del destino illumina la giornata, portando un raggio di sole inatteso. Fidati delle coincidenze.",
    "Leone": "<b>Amore:</b> Un'intesa profonda illumina i tuoi legami. La passione e la comprensione fioriscono, rafforzando i sentimenti.\n<b>Lavoro:</b> La tua visione guida. Prendi l'iniziativa, i tuoi sforzi saranno notati e porteranno a riconoscimenti meritati.\n<b>Fortuna:</b> Un'opportunità inattesa potrebbe bussare alla tua porta. Segui il tuo intuito, ti guiderà verso la prosperità.",
    "Vergine": "Oggi, l'<b>Amore</b> fiorisce in gesti delicati e parole sincere, rafforzando legami. Nel <b>Lavoro</b>, la tua meticolosità è una guida preziosa; apriti a nuove idee che portano successo. La <b>Fortuna</b> sorride inaspettatamente, ascolta l'intuizione; ti condurrà verso una piacevole sorpresa.",
    "Bilancia": "<b>Amore:</b> Oggi i cuori trovano armonia, un dialogo gentile rinsalda legami. Lasciati guidare dalla bellezza delle piccole attenzioni che nutrono l'anima.\n<b>Lavoro:</b> La tua diplomazia brilla, risolvendo nodi con grazia. Nuove idee germogliano dalla collaborazione. Sii equo e deciso nelle tue scelte.\n<b>Fortuna:</b> Un vento leggero porta opportunità inattese. Ascolta l'intuizione, ti condurrà verso un sereno equilibrio e piacevoli scoperte.",
    "Scorpione": "<b>Amore:</b> Profondità inattese affiorano, invitandoti a esplorare legami con autenticità e passione. Condividi il tuo vero sé senza timore.\n<b>Lavoro:</b> La tua visione acuta è un dono prezioso; usala per navigare sfide e cogliere traguardi con strategia. Sii determinato.\n<b>Fortuna:</b> Un sussurro interiore ti indica la via. Fidati delle tue intuizioni, possono rivelare un'opportunità velata.",
    "Sagittario": "<b>Amore:</b> Un soffio gentile accarezza il cuore, portando armonia e intesa profonda con chi ami. Apri l'anima alla tenerezza.\n<b>Lavoro:</b> Le idee brillano e trovano fertile terreno. Segui l'ispirazione, un nuovo percorso si svela promettente.\n<b>Fortuna:</b> Sorrisi inattesi illuminano la giornata. Una piccola coincidenza apre porte, guidandoti con leggerezza.",
    "Capricorno": "<b>Amore:</b> Un soffio gentile riscalda il cuore, svelando armonie inaspettate. La condivisione profonda rafforza legami, portando tenerezza.\n<b>Lavoro:</b> La tua dedizione apre porte. Un progetto prende forma, promettendo frutti duraturi. Non temere nuove sfide.\n<b>Fortuna:</b> Un piccolo, inatteso dono ti sorride. Afferra l'attimo di serena pace, fonte di ispirazione e benessere.",
    "Acquario": "<b>Amore:</b> Le stelle sussurrano armonie, apri il cuore a connessioni inattese e sincere. Ascolta l'eco dei sentimenti più profondi.\n<b>Lavoro:</b> La tua mente brilla; nuove idee attendono di essere condivise. Non temere di osare e innovare con fiducia.\n<b>Fortuna:</b> Un soffio cosmico ti spinge avanti. Cogli le occasioni nascenti, il destino sorride ai tuoi passi più audaci.",
    "Pesci": "Errore API Gemini: 429 RESOURCE_EXHAUSTED. {'error': {'code': 429, 'message': 'You exceeded your current quota, please check your plan and billing details. For more information on this error, head to: https://ai.google.dev/gemini-api/docs/rate-limits. To monitor your current usage, head to: https://ai.dev/usage?tab=rate-limit. \\n* Quota exceeded for metric: generativelanguage.googleapis.com/generate_content_free_tier_requests, limit: 10\\nPlease retry in 52.59859369s.', 'status': 'RESOURCE_EXHAUSTED', 'details': [{'@type': 'type.googleapis.com/google.rpc.Help', 'links': [{'description': 'Learn more about Gemini API quotas', 'url': 'https://ai.google.dev/gemini-api/docs/rate-limits'}]}, {'@type': 'type.googleapis.com/google.rpc.QuotaFailure', 'violations': [{'quotaMetric': 'generativelanguage.googleapis.com/generate_content_free_tier_requests', 'quotaId': 'GenerateRequestsPerMinutePerProjectPerModel-FreeTier', 'quotaDimensions': {'location': 'global', 'model': 'gemini-2.5-flash'}, 'quotaValue': '10'}]}, {'@type': 'type.googleapis.com/google.rpc.RetryInfo', 'retryDelay': '52s'}]}}"
  },
  "2025-11-10": {
    "Ariete": "<b>Amore:</b> Un barlume di passione illumina il cuore, rendendo dolci le parole e profondi gli sguardi. Lasciatevi guidare dall'istinto.\n<b>Lavoro:</b> La vostra energia è un faro. Affrontate le sfide con audacia, nuove porte si apriranno grazie alla vostra iniziativa.\n<b>Fortuna:</b> Una piccola sorpresa inaspettata vi sorride, portando leggerezza e un tocco di gioia in questa giornata.",
    "Toro": "<b>Amore:</b> Un soffio di sensualità avvolge il cuore, invitandoti a coltivare la tenerezza e la stabilità affettiva.\n<b>Lavoro:</b> La tua perseveranza è una roccia. Oggi, la dedizione concreta apre nuove vie al successo.\n<b>Fortuna:</b> La serenità dimora nei piccoli piaceri. Accogli l'abbondanza discreta che ti circonda.",
    "Gemelli": "<b>Amore:</b> Un soffio di complicità avvolge i vostri legami, favorendo intese profonde e conversazioni sincere. Lasciatevi guidare dalla tenerezza.\n<b>Lavoro:</b> Le idee sbocciano con grazia; la collaborazione apre nuove vie inaspettate. Siate aperti al confronto costruttivo.\n<b>Fortuna:</b> Un'intuizione sottile vi guida, portando piccole ma significative opportunità. Fidatevi del vostro istinto.",
    "Cancro": "<b>Amore:</b> Il cuore sussurra melodie sincere, avvicinando anime con tenerezza inaspettata. Un abbraccio scalda l'anima.\n<b>Lavoro:</b> La tua intuizione guida passi sicuri; nuove prospettive si aprono con chiarezza, premiando la dedizione.\n<b>Fortuna:</b> Una piccola coincidenza sorride, illuminando il cammino e portando un dono inatteso.",
    "Leone": "<b>Amore:</b> La passione fiorisce, portando intese profonde e momenti di pura felicità condivisa. Sii autentico nel donare e ricevere.\n<b>Lavoro:</b> La tua creatività è una guida luminosa, apre nuove porte e genera meritati riconoscimenti. Non temere di osare.\n<b>Fortuna:</b> Ascolta l'intuito; ti condurrà a una scoperta inattesa o a un aiuto provvidenziale. Le stelle sono dalla tua parte.",
    "Vergine": "<b>Amore:</b> Un filo invisibile lega i cuori, portando dolcezza e comprensione inaspettata. Lasciati guidare dall'intuito.\n<b>Lavoro:</b> La tua meticolosità è una stella polare. Ogni dettaglio curato apre nuove vie al successo e al riconoscimento.\n<b>Fortuna:</b> Si cela nelle piccole cose, in un sorriso o un gesto inatteso. Raccogli i doni silenziosi del destino con gratitudine.",
    "Bilancia": "<b>Amore:</b> Un delicato soffio accarezza i vostri legami, portando armonia e intesa profonda. Ascoltate il cuore.\n<b>Lavoro:</b> La diplomazia è la vostra chiave. Troverete l'equilibrio ideale nelle collaborazioni, risolvendo con grazia ogni sfida.\n<b>Fortuna:</b> Una piccola, inattesa scintilla illumina il cammino. Un esito equo vi sorriderà, portando pace interiore.",
    "Scorpione": "<b>Amore:</b> Un velo si solleva, rivelando profondità emotive. I cuori si connettono oltre le parole, intessendo legami più forti e sinceri.\n<b>Lavoro:</b> La tua strategia affina ogni passo, superando ostacoli con acume. La determinazione porta frutto, consolidando la tua posizione con successo.\n<b>Fortuna:</b> Un colpo di scena inatteso può aprirti vie nuove. Fidati dell'intuito, è la bussola per tesori nascosti che aspettano di essere scoperti.",
    "Sagittario": "<b>Amore:</b> Un soffio d'armonia accarezza il tuo cuore, portando leggerezza e comprensione. Apri le tue ali all'affetto.\n<b>Lavoro:</b> Le tue idee brillano come stelle guida. Segui l'intuizione; un progetto ambizioso può spiccare il volo.\n<b>Fortuna:</b> Un piccolo, inatteso raggio di sole illumina il tuo cammino. Sii ricettivo/a ai doni del giorno.",
    "Capricorno": "<b>Amore:</b> Il cuore sussurra melodie antiche, invitando all'ascolto profondo e alla comprensione reciproca. Una gentilezza inattesa rinforza i legami.\n<b>Lavoro:</b> La tua dedizione instancabile illumina ogni compito. Una sfida apparente si rivela un'opportunità grazie alla tua saggezza pratica.\n<b>Fortuna:</b> Un piccolo, inatteso raggio di sole attraversa le nuvole, portando con sé una serena leggerezza e un motivo per sorridere.",
    "Acquario": "<b>Amore:</b> Un velo di tenerezza avvolge i tuoi incontri, rendendo ogni parola un sussurro prezioso. Ascolta il cuore, ti guiderà.\n<b>Lavoro:</b> Le tue idee brillano come stelle nascenti. Non esitare a proporle; la creatività è la tua forza oggi, porta frutti.\n<b>Fortuna:</b> Un piccolo, inaspettato bagliore illumina il tuo cammino. Sii ricettivo ai doni del caso, potrebbero sorprenderti.",
    "Pesci": "Errore API Gemini: 429 RESOURCE_EXHAUSTED. {'error': {'code': 429, 'message': 'You exceeded your current quota, please check your plan and billing details. For more information on this error, head to: https://ai.google.dev/gemini-api/docs/rate-limits. To monitor your current usage, head to: https://ai.dev/usage?tab=rate-limit. \\n* Quota exceeded for metric: generativelanguage.googleapis.com/generate_content_free_tier_requests, limit: 10\\nPlease retry in 41.515800928s.', 'status': 'RESOURCE_EXHAUSTED', 'details': [{'@type': 'type.googleapis.com/google.rpc.Help', 'links': [{'description': 'Learn more about Gemini API quotas', 'url': 'https://ai.google.dev/gemini-api/docs/rate-limits'}]}, {'@type': 'type.googleapis.com/google.rpc.QuotaFailure', 'violations': [{'quotaMetric': 'generativelanguage.googleapis.com/generate_content_free_tier_requests', 'quotaId': 'GenerateRequestsPerMinutePerProjectPerModel-FreeTier', 'quotaDimensions': {'location': 'global', 'model': 'gemini-2.5-flash'}, 'quotaValue': '10'}]}, {'@type': 'type.googleapis.com/google.rpc.RetryInfo', 'retryDelay': '41s'}]}}"
  },
  "2025-11-11": {
    "Ariete": "<b>Amore:</b> Il cuore si apre a nuove intese, donando calore e passione sincera. Ascolta l'eco dei sentimenti profondi.\n<b>Lavoro:</b> Energia vibrante ti spinge avanti. Un'idea brillante potrebbe emergere, portando frutti inattesi. Concentrati.\n<b>Fortuna:</b> Le stelle sorridono, offrendo un tocco di magia. Cogli le opportunità fugaci con audacia e fiducia.",
    "Toro": "<b>Amore:</b> Il cuore trova pace in un gesto inatteso, un sussurro che riscalda l'anima. Le connessioni si approfondiscono con dolcezza.\n<b>Lavoro:</b> La tua costanza porta frutti silenziosi; procedi con determinazione. Il successo è vicino, mantieni la rotta con fiducia.\n<b>Fortuna:</b> Un piccolo imprevisto si rivela una benedizione inattesa, aprendo una nuova strada. Sii ricettivo ai cambiamenti.",
    "Gemelli": "<b>Amore:</b> Un soffio di novità rinfresca i legami, portando chiarezza e passione. Apri il cuore a connessioni più profonde.\n<b>Lavoro:</b> La mente agile trova soluzioni inattese. È il momento di presentare le tue idee più brillanti, saranno accolte con entusiasmo.\n<b>Fortuna:</b> Un raggio inatteso illumina il cammino. Sii aperto alle sorprese, la leggerezza ti guiderà verso opportunità inattese.",
    "Cancro": "<b>Amore:</b> Il cuore si apre a nuove tenerezze. Condividi un sussurro, un gesto che lega le anime con dolcezza profonda.\n<b>Lavoro:</b> La tua intuizione è una bussola fedele. Piccoli passi ponderati portano a grandi, silenziose conquiste.\n<b>Fortuna:</b> Un raggio inatteso illumina la giornata. Accogli la serendipità con gratitudine.",
    "Leone": "<b>Amore:</b> Un raggio tiepido illumina il tuo cuore, favorendo intesa e passione. Sii aperto alle connessioni profonde.\n<b>Lavoro:</b> La tua energia è un faro. Affronta le sfide con audacia; il tuo ingegno aprirà nuove strade al successo.\n<b>Fortuna:</b> Le stelle ti sorridono, specialmente nelle decisioni intuitive. Segui l'istinto, ti guiderà verso esiti felici.",
    "Vergine": "<b>Amore:</b> I cuori si allineano in sintonia; un gesto gentile rafforza legami. Ascolta l'intuizione del partner.\n<b>Lavoro:</b> La tua precisione è un faro. Opportunità sottili emergono da progetti familiari, cogli l'attimo con saggezza.\n<b>Fortuna:</b> Un piccolo colpo di scena inaspettato porta un sorriso. Segui la tua bussola interiore per scoperte inattese.",
    "Bilancia": "<b>Amore</b>: Un'armonia sottile avvolge i vostri legami, favorendo intese profonde e gesti gentili. Lasciatevi guidare dal cuore.\n<b>Lavoro</b>: La vostra perspicacia sarà preziosa. Nelle collaborazioni, cercate il giusto equilibrio; una decisione chiara porterà avanzamenti.\n<b>Fortuna</b>: Un vento leggero di opportunità vi sfiora. Siate aperti a sorprese inaspettate che portano un tocco di gioia.",
    "Scorpione": "<b>Amore:</b> Un velo si solleva, rivelando profondità insperate. Il cuore cerca connessioni autentiche, ascolta il suo richiamo silenzioso.\n\n<b>Lavoro:</b> La tua visione acuta guida ogni passo. Strategie sottili portano a successi inattesi. Non temere di agire con decisione.\n\n<b>Fortuna:</b> Un'intuizione ti illumina il cammino. Segui quel filo invisibile, ti condurrà dove meno te lo aspetti, verso un piccolo trionfo.",
    "Sagittario": "<b>Amore:</b> Un soffio di libertà rinnova i legami, portando comprensione e passione inattese. Ascolta il cuore, la sua guida è pura.\n<b>Lavoro:</b> Le tue idee audaci trovano terreno fertile. Non temere di esplorare nuove vie; il progresso è a portata di mano.\n<b>Fortuna:</b> Un'opportunità inaspettata bussa alla porta. Apri gli occhi, la fortuna ti sorride attraverso un piccolo gesto.",
    "Capricorno": "<b>Amore:</b> Un'intesa profonda si rafforza, tessendo fili d'oro tra i cuori. Ascolta e condividi con tenerezza ogni emozione.\n<b>Lavoro:</b> La tua dedizione aprirà nuove porte, costruendo ponti solidi verso il successo atteso. Procedi con fiducia e metodo.\n<b>Fortuna:</b> Un raggio inatteso di luce illumina il tuo percorso, portando piccole ma preziose gioie e soluzioni opportune.",
    "Acquario": "<b>Amore:</b> I venti del destino soffiano nuove melodie, il tuo cuore risuona con inaspettate armonie. <b>Lavoro:</b> La tua mente creativa è una stella guida; condividi le tue visioni, il successo ti sorrida. <b>Fortuna:</b> Un raggio di luce improvviso illumina il tuo sentiero, una sorpresa attende al vero.",
    "Pesci": "<b>Amore:</b> I sentimenti affiorano come onde gentili. Condividi la tua profondità, ma ricorda i confini sottili. L'intesa fiorisce nella comprensione reciproca.\n<b>Lavoro:</b> L'intuizione guida i tuoi passi in progetti creativi. Ascolta quella voce interiore per navigare sfide. Collaborazione porta frutti inattesi.\n<b>Fortuna:</b> Un sussurro del destino ti indica la via. Fidati delle coincidenze e delle piccole gioie che illuminano il tuo cammino."
  },
  "2025-11-12": {
    "Ariete": "<b>Amore:</b> Un soffio di passione ravviva legami esistenti o accende scintille inattese. Il cuore guida le tue scelte con dolcezza.\n<b>Lavoro:</b> Affronta ogni compito con ardore; la tua determinazione aprirà nuove vie e opportunità brillanti. Sii intraprendente.\n<b>Fortuna:</b> Una mano invisibile ti sorregge, portando un piccolo miracolo o una svolta positiva proprio quando meno te l'aspetti.",
    "Toro": "<b>Amore:</b> Un tocco di armonia avvolge i vostri legami, invitandovi alla tenerezza e a una comprensione più profonda. Il cuore trova pace.\n<b>Lavoro:</b> La vostra dedizione porta frutti. Un'idea chiara emerge, guidandovi con passo sicuro verso la stabilità desiderata.\n<b>Fortuna:</b> Ascoltate l'intuizione; un piccolo segno inaspettato potrebbe svelare un'opportunità o una piacevole sorpresa.",
    "Gemelli": "<b>Amore:</b> Un vento leggero sussurra dolci verità al vostro cuore, portando chiarezza in un legame o un nuovo inizio emozionante.\n<b>Lavoro:</b> La mente è fertile, pronta a seminare idee innovative. Non temete di osare, il successo è vicino.\n<b>Fortuna:</b> Una svolta inattesa illumina il cammino, un dono del destino vi aspetta dietro l'angolo.",
    "Cancro": "<b>Amore:</b> Senti un'armonia sottile vibrare nel cuore, avvicinando chi ami con dolcezza e comprensione profonda. Lascia che le emozioni fluiscano liberamente.\n\n<b>Lavoro:</b> La tua intuizione è una guida luminosa; fidati delle sensazioni per navigare le sfide e trovare soluzioni creative e inaspettate.\n\n<b>Fortuna:</b> Una ventata di fortuna discreta ti sorride, portando piccole gioie e inattesi doni nel tuo cammino. Resta aperto ai segnali.",
    "Leone": "<b>Amore:</b> Il cuore ruggisce di passione, un legame si rafforza sotto il sole. Condividi la tua luce.\n<b>Lavoro:</b> La tua energia creativa brilla, portando riconoscimenti inaspettati. Guida con fiducia.\n<b>Fortuna:</b> Una stella propizia ti sorride, donando audacia per cogliere un'opportunità unica. Fidati del tuo istinto.",
    "Vergine": "<b>Amore:</b> Un velo di tenerezza avvolge il cuore, portando chiarezza e connessione profonda. Ascoltate l'intuizione.\n<b>Lavoro:</b> La vostra precisione è un dono prezioso; un compito complesso trova oggi la sua risoluzione brillante grazie a voi.\n<b>Fortuna:</b> Un piccolo, inaspettato vantaggio emerge da un dettaglio minore. Mantenete lo sguardo attento.",
    "Bilancia": "<b>Amore:</b> L'armonia cerca il suo spazio; un gesto gentile aprirà porte inattese. Ascolta e rispondi con il cuore per connessioni più profonde.\n<b>Lavoro:</b> Le collaborazioni fioriscono. Trova l'equilibrio tra le tue idee e quelle altrui per un progresso sereno e condiviso.\n<b>Fortuna:</b> Un piccolo allineamento cosmico favorisce incontri o scoperte leggere che rallegrano la giornata e l'umore.",
    "Scorpione": "<b>Amore:</b> Un velo di mistero avvolge i cuori, rivelando passioni sopite. L'intesa profonda si rafforza con sguardi e gesti intensi.\n<b>Lavoro:</b> Le acque si muovono, portando ispirazioni inattese. Affronta le sfide con intuito acuto, la determinazione è la tua guida più fedele.\n<b>Fortuna:</b> Un'ombra di buona sorte si profila all'orizzonte, un'occasione sottile ma potente attende di essere colta con discernimento.",
    "Sagittario": "<b>Amore:</b> Sinceri dialoghi portano chiarezza. Il cuore si apre a dolci intese, rafforzando legami o accogliendo nuove aurore.\n<b>Lavoro:</b> Un faro guida i tuoi passi audaci. Le idee brillano, portando progressi. Non temere di osare, le opportunità attendono.\n<b>Fortuna:</b> Una stella benevola ti sorride. Piccoli favori inattesi illuminano la giornata, aprendo strade insperate. L'ottimismo è la chiave.",
    "Capricorno": "<b>Amore:</b> Un velo di comprensione avvolge i cuori, favorendo intese profonde. Ascolta e sarai ascoltato, in un abbraccio di calore sincero.\n<b>Lavoro:</b> La tua dedizione porta frutti inaspettati. Una nuova prospettiva illumina i tuoi progetti, guidandoti verso la soluzione perfetta.\n<b>Fortuna:</b> Un'intuizione improvvisa ti svela un percorso inatteso. Cogli le piccole opportunità che oggi ti si presentano con grazia.",
    "Acquario": "<b>Amore:</b> Un soffio gentile accarezza il cuore, promettendo intese profonde o scintille inattese. Apriti all'emozione.\n<b>Lavoro:</b> La mente brilla, fertile di idee innovative. Segui l'intuizione, ti condurrà a soluzioni brillanti e progressi inattesi.\n<b>Fortuna:</b> Le stelle sorridono, portando un tocco di fortuna imprevista. Cogli l'attimo fuggente, la buona sorte è con te.",
    "Pesci": "<b>Amore:</b> Sogni e intuizioni guidano il cuore. Un gesto inatteso accende la tenerezza, rafforzando legami o suggerendo nuove connessioni.\n\n<b>Lavoro:</b> La tua creatività fluisce, risolvendo enigmi con facilità. Fidati del tuo istinto; ti condurrà verso soluzioni brillanti.\n\n<b>Fortuna:</b> Una piccola coincidenza ti sorride, portando leggerezza e un'opportunità inattesa che merita la tua attenzione."
  },
  "2025-11-13": {
    "Ariete": "<b>Amore:</b> Un soffio d'ardore rinnova i legami, accendendo scintille in sguardi inattesi. Lascia che il cuore ti guidi verso nuove, profonde connessioni.\n<b>Lavoro:</b> La tua energia spiana la strada a nuove opportunità. Idee brillanti trovano ascolto, portando frutti inaspettati. Sii audace nelle tue scelte.\n<b>Fortuna:</b> Una brezza favorevole porta sorprese. Segui l'intuizione; un piccolo passo può aprire grandi porte, rivelando percorsi insperati.",
    "Toro": "<b>Amore:</b> Un tocco gentile rafforza i legami, portando armonia e intesa profonda. Permetti alla dolcezza di guidarti.\n<b>Lavoro:</b> La tua perseveranza apre nuove porte. I frutti della dedizione sono a portata di mano, sii paziente e fiducioso.\n<b>Fortuna:</b> Una serena coincidenza illumina il tuo percorso, offrendo un inaspettato momento di quiete e chiarezza.",
    "Gemelli": "<b>Amore:</b> Le parole fluttuano con grazia, tessendo fili preziosi. Un dialogo sincero porta maggiore comprensione e una dolce vicinanza oggi.\n<b>Lavoro:</b> La vostra mente acuta trova soluzioni brillanti. Sfruttate la versatilità per navigare compiti complessi con inaspettata leggerezza e successo.\n<b>Fortuna:</b> Un piccolo colpo di scena inatteso illumina il pomeriggio, rivelando un'opportunità o una piacevole sorpresa. Siate ricettivi.",
    "Cancro": "<b>Amore:</b> Un'onda di tenerezza avvolge il cuore, favorendo intese profonde e sincere. Ascolta l'eco dell'anima.\n<b>Lavoro:</b> L'intuito è la tua bussola oggi, guidandoti verso scelte sagge e progressi discreti ma significativi.\n<b>Fortuna:</b> La buona sorte risiede nella serenità interiore, svelando piccole, inattese benedizioni lungo il cammino.",
    "Leone": "<b>Amore:</b> Il tuo cuore arde di nuova passione; cerca la connessione profonda che alimenta l'anima.\n<b>Lavoro:</b> La tua leadership brilla, ma ascolta attentamente le voci altrui per un successo maggiore.\n<b>Fortuna:</b> Ti sorride attraverso intuizioni inaspettate; fidati del tuo istinto. Un'energia propizia ti avvolge con grazia.",
    "Vergine": "<b>Amore:</b> Oggi il cuore si apre a dolci intese. Un dialogo sincero porta maggiore vicinanza, rafforzando legami o accendendo nuove scintille inaspettate.\n<b>Lavoro:</b> La tua mente analitica è al suo apice. Affronta le sfide con lucidità e precisione, raccogliendo frutti di un impegno costante e attento.\n<b>Fortuna:</b> Un velo di buona sorte ti accompagna in piccoli momenti. Sii attento ai dettagli; lì si nasconde una piacevole e discreta sorpresa.",
    "Bilancia": "<b>Amore:</b> La brezza del sentimento accarezza i cuori, portando armonia e intesa profonda. Condividi momenti di connessione.\n<b>Lavoro:</b> Il tuo innato equilibrio guida le scelte. Le collaborazioni fioriscono, portando frutti inaspettati e apprezzamento.\n<b>Fortuna:</b> Piccole gioie inattese colorano la giornata. Accogli la serenità che nasce dalla tranquillità interiore.",
    "Scorpione": "<b>Amore:</b> Le correnti sotterranee del cuore oggi si rivelano, portando profondità e intensità. Un legame si rinforza nell'intimità.\n<b>Lavoro:</b> La tua perspicacia ti guida verso soluzioni ingegnose. Afferra le opportunità nascoste, la tua determinazione è vincente.\n<b>Fortuna:</b> Un sussurro del destino ti indica la via. Sii ricettivo ai segni, un inatteso beneficio è in arrivo.",
    "Sagittario": "<b>Amore:</b> Il tuo spirito avventuroso trova eco in sguardi complici. Lasciati guidare dall'intuito del cuore.\n<b>Lavoro:</b> Oggi le tue idee brillano, proponi con audacia: i semi piantati daranno presto frutti.\n<b>Fortuna:</b> Una corrente favorevole soffia inaspettata, porta con sé occasioni d'oro. Sii pronto ad accoglierle.",
    "Capricorno": "<b>Amore</b>: Le stelle tessono fili d'intesa, rafforzando un legame o accendendo una nuova scintilla. Apri il cuore alla dolcezza.\n<b>Lavoro</b>: La tua dedizione è una guida sicura. Affronta le sfide con metodo, il successo è a portata di mano.\n<b>Fortuna</b>: Un vento propizio soffia inaspettato, portando opportunità da cogliere con prontezza e fiducia.",
    "Acquario": "<b>Amore:</b> Il tuo cuore vibra, pronto a cogliere sfumature emotive profonde. Ascolta e lasciati guidare dall'autenticità dei legami.\n<b>Lavoro:</b> Le tue idee brillano, portando luce su progetti innovativi. La collaborazione apre nuove porte al successo inatteso.\n<b>Fortuna:</b> Un'opportunità inaspettata si presenta come un dono del cielo. Sii pronto ad accoglierla con entusiasmo e fiducia.",
    "Pesci": "Errore API Gemini: 429 RESOURCE_EXHAUSTED. {'error': {'code': 429, 'message': 'You exceeded your current quota, please check your plan and billing details. For more information on this error, head to: https://ai.google.dev/gemini-api/docs/rate-limits. To monitor your current usage, head to: https://ai.dev/usage?tab=rate-limit. \\n* Quota exceeded for metric: generativelanguage.googleapis.com/generate_content_free_tier_requests, limit: 10\\nPlease retry in 59.338634445s.', 'status': 'RESOURCE_EXHAUSTED', 'details': [{'@type': 'type.googleapis.com/google.rpc.Help', 'links': [{'description': 'Learn more about Gemini API quotas', 'url': 'https://ai.google.dev/gemini-api/docs/rate-limits'}]}, {'@type': 'type.googleapis.com/google.rpc.QuotaFailure', 'violations': [{'quotaMetric': 'generativelanguage.googleapis.com/generate_content_free_tier_requests', 'quotaId': 'GenerateRequestsPerMinutePerProjectPerModel-FreeTier', 'quotaDimensions': {'location': 'global', 'model': 'gemini-2.5-flash'}, 'quotaValue': '10'}]}, {'@type': 'type.googleapis.com/google.rpc.RetryInfo', 'retryDelay': '59s'}]}}"
  },
  "2025-11-14": {
    "Ariete": "<b>Amore:</b> Oggi, il cuore palpita al ritmo di nuove connessioni, o rinnova fiamme sopite con gesti inattesi. Apriti alla tenerezza, essa sarà la tua guida.\n<b>Lavoro:</b> Un'idea brillante si fa strada; non esitare a presentarla, potrebbe aprire porte insperate. Collabora con fiducia per risultati inattesi.\n<b>Fortuna:</b> Un piccolo colpo di scena gioioso illumina la giornata, forse un incontro o una notizia inaspettata. Sii ricettivo ai doni del caso.",
    "Toro": "<b>Amore:</b> Il cuore trova rifugio in dolci certezze. Un gesto tenero rafforza i legami, creando un'oasi di pace condivisa.\n<b>Lavoro:</b> La tua tenacia porta frutti. Concentrazione e dedizione aprono nuove strade, consolidando ogni sforzo intrapreso.\n<b>Fortuna:</b> Un barlume inatteso illumina il tuo cammino. Sii ricettivo a piccole sorprese che addolciranno la giornata.",
    "Gemelli": "<b>Amore:</b> Oggi, il cuore si apre a nuove sfumature d'affetto, rendendo ogni incontro un'opportunità preziosa.\n<b>Lavoro:</b> La tua mente brillante trova soluzioni innovative; non esitare a condividerle con fiducia.\n<b>Fortuna:</b> Danza leggera intorno a te, pronta a sorprenderti con un dono inatteso. Sii ricettivo.",
    "Cancro": "Una corrente tenera avvolge il tuo spirito. <b>Amore</b>: Lascia che le emozioni più profonde si rivelino, creando ponti sinceri. Il cuore trova risposte nel silenzio condiviso. <b>Lavoro</b>: La tua intuizione è una bussola preziosa. Segui i suoi suggerimenti per navigare progetti e collaborazioni, portando avanti idee innovative. <b>Fortuna</b>: Piccoli gesti e inaspettate coincidenze illuminano la giornata, portando serenità e un senso di benessere interiore.",
    "Leone": "<b>Amore:</b> Il tuo cuore nobile risplende, attirando sguardi sinceri. Non esitare a condividere la tua luce, la connessione è profonda.\n<b>Lavoro:</b> Un'intuizione audace ti guida verso il successo. Afferma la tua visione, la fiducia apre nuove, brillanti strade.\n<b>Fortuna:</b> Una ventata di positività porta piccole gioie inattese. Accogli ogni momento di splendore con gratitudine.",
    "Vergine": "<b>Amore:</b> Un tocco gentile accende intese profonde. Permetti al cuore di esprimersi con dolcezza sincera, trovando armonia nelle piccole cose.\n<b>Lavoro:</b> La tua meticolosità brilla, ogni dettaglio porta a successi concreti. Nuove opportunità emergono da piani ben strutturati.\n<b>Fortuna:</b> Un piccolo colpo di scena positivo illumina il tuo cammino. Fidati dell'intuito, ti guida verso doni inattesi.",
    "Bilancia": "<b>Amore:</b> Un velo di dolcezza avvolge i vostri legami, invitando a una connessione più profonda. Ascoltate il cuore e le parole non dette.\n<b>Lavoro:</b> L'equilibrio è la vostra forza. Ogni decisione ponderata apre nuove strade, specialmente in collaborazione. Fidatevi del vostro giudizio.\n<b>Fortuna:</b> Un piccolo raggio di sole inatteso illumina il cammino, portando un sorriso dove meno lo aspettate. Siate aperti ai doni del caso.",
    "Scorpione": "<b>Amore:</b> I sentimenti affiorano, invitandoti a un legame più profondo. L'onestà aprirà nuove porte del cuore, rivelando connessioni sincere.\n<b>Lavoro:</b> La tua acutezza è una guida preziosa. Concentrati sui dettagli e affronta le sfide con strategia; una svolta è vicina.\n<b>Fortuna:</b> Un'intuizione improvvisa ti guiderà verso un vantaggio inatteso. Sii ricettivo ai segnali sottili del destino.",
    "Sagittario": "<b>Amore:</b> Un soffio gentile accende il cuore, portando comprensione e armonia. Le parole sincere creano ponti solidi con chi ami.\n<b>Lavoro:</b> La mente è acuta, pronta a cogliere nuove prospettive. Un'intuizione vincente apre strade inesplorate al successo.\n<b>Fortuna:</b> Stelle propizie illuminano il tuo cammino, suggerendo sorprese positive. Sii aperto all'inaspettato e alle nuove occasioni.",
    "Capricorno": "<b>Amore:</b> Un soffio di tenerezza riscalda l'anima, coltiva i legami autentici. La sincerità è la tua guida preziosa.\n<b>Lavoro:</b> La tua disciplina porta chiarezza, affronta le sfide con determinazione. Un'opportunità si profila all'orizzonte.\n<b>Fortuna:</b> Una piccola sorpresa inattesa illumina il tuo cammino, accogli il dono del momento con gratitudine.",
    "Acquario": "Oggi, l'aria porta sussurri d'amore; un dialogo sincero rafforza legami o ne accende di nuovi. Nel <b>lavoro</b>, le tue idee brillano, aprendo strade inesplorate; collabora per massimizzare il potenziale. La <b>fortuna</b> ti sorride con piccole, piacevoli sorprese, illuminando la giornata in modi inattesi.",
    "Pesci": "Errore API Gemini: 429 RESOURCE_EXHAUSTED. {'error': {'code': 429, 'message': 'You exceeded your current quota, please check your plan and billing details. For more information on this error, head to: https://ai.google.dev/gemini-api/docs/rate-limits. To monitor your current usage, head to: https://ai.dev/usage?tab=rate-limit. \\n* Quota exceeded for metric: generativelanguage.googleapis.com/generate_content_free_tier_requests, limit: 10, model: gemini-2.5-flash\\nPlease retry in 15.838068676s.', 'status': 'RESOURCE_EXHAUSTED', 'details': [{'@type': 'type.googleapis.com/google.rpc.Help', 'links': [{'description': 'Learn more about Gemini API quotas', 'url': 'https://ai.google.dev/gemini-api/docs/rate-limits'}]}, {'@type': 'type.googleapis.com/google.rpc.QuotaFailure', 'violations': [{'quotaMetric': 'generativelanguage.googleapis.com/generate_content_free_tier_requests', 'quotaId': 'GenerateRequestsPerMinutePerProjectPerModel-FreeTier', 'quotaDimensions': {'model': 'gemini-2.5-flash', 'location': 'global'}, 'quotaValue': '10'}]}, {'@type': 'type.googleapis.com/google.rpc.RetryInfo', 'retryDelay': '15s'}]}}"
  }
}