{
  "2025-10-03": {
    "Ariete": "<b>Amore:</b> Un soffio di passione accende i cuori, rivelando connessioni profonde. Segui l'istinto gentile che ti guida.\n<b>Lavoro:</b> La tua energia pionieristica apre nuove strade. Affronta le sfide con coraggio, la determinazione porta successo.\n<b>Fortuna:</b> Un'opportunità inattesa bussa alla porta. Sii audace, il destino ti sorride in un momento propizio.",
    "Toro": "<b>Amore:</b> Un tocco gentile risveglia affetti profondi. Cerca l'armonia nei legami, apprezzando la quiete condivisa che nutre l'anima.\n<b>Lavoro:</b> La tua tenacia costruisce basi solide. Concentrati sui dettagli, la perseveranza porta frutti inattesi ai tuoi sforzi.\n<b>Fortuna:</b> Un raggio di sole illumina piccoli piaceri. Accogli le opportunità latenti, la serenità è vicina e ti sorride.",
    "Gemelli": "<b>Amore:</b> Oggi, un velo di romanticismo avvolge i vostri legami, favorendo intese profonde e sorrisi complici. Ascoltate il cuore.\n<b>Lavoro:</b> La vostra mente brillante trova soluzioni innovative; un'idea può sbocciare, portando frutti inattesi. Non temete di esplorare nuove strade.\n<b>Fortuna:</b> Una scintilla inaspettata illumina il cammino, siate pronti a cogliere un piccolo, dolce dono dal destino. La vostra intuizione è la guida.",
    "Cancro": "<b>Amore:</b> Un dolce sussurro di tenerezza accarezza il vostro animo, invitandovi a connessioni profonde. Aprite il cuore senza timore.\n<b>Lavoro:</b> L'intuito è la vostra stella polare; fidatevi di esso per navigare con successo tra gli impegni e cogliere nuove opportunità.\n<b>Fortuna:</b> Una piccola sorpresa illumina la giornata, portando con sé una piacevole sensazione di serenità e benessere inaspettato.",
    "Leone": "<b>Amore:</b> La tua fiamma interiore risplende, accendendo passioni e donando calore sincero. Non temere di esprimere il tuo cuore.\n<b>Lavoro:</b> Con coraggio leonino, affronta le sfide. Le tue idee brillanti apriranno nuove strade, portandoti il meritato riconoscimento.\n<b>Fortuna:</b> Un'onda inaspettata di buona sorte ti eleva. Segui l'intuizione, un'opportunità brillante ti attende dietro l'angolo.",
    "Vergine": "<b>Amore:</b> Un filo invisibile lega i cuori, portando comprensione e dolci intese. Ascoltate il partner, troverete armonia in un gesto inatteso.\n<b>Lavoro:</b> La vostra precisione sarà la chiave. Un dettaglio curato aprirà nuove prospettive, consolidando la stima altrui. Procedete con fiducia.\n<b>Fortuna:</b> Un piccolo raggio di sole illumina il cammino. Una coincidenza fortunata o una parola amica vi guideranno verso una serena risoluzione.",
    "Bilancia": "<b>Amore:</b> Il cuore danza in armonia, un dialogo sincero rafforza i legami più cari. Lasciati guidare dalla tenerezza e dall'intesa profonda.\n<b>Lavoro:</b> Le collaborazioni fioriscono, la tua diplomazia aprirà nuove vie. Trova l'equilibrio nelle scelte, il successo è a portata di mano.\n<b>Fortuna:</b> Una piccola, piacevole sorpresa illumina la tua giornata. Sii ricettivo, un'opportunità inattesa potrebbe bussare alla porta.",
    "Scorpione": "Il cuore sussurra segreti profondi; un legame si intensifica nell'ombra. Nel <b>lavoro</b>, la tua intuizione affilata svela percorsi inattesi, portando chiarezza dove regnava l'incertezza. La <b>fortuna</b> danza inaspettata, un velo si solleva rivelando un'opportunità nascosta, forse un dono del destino. Sii ricettivo ai messaggi silenziosi che ti circondano.",
    "Sagittario": "<b>Amore:</b> Un soffio di novità accende il cuore, la comprensione reciproca fiorisce, portando armonia e serenità inattese.\n<b>Lavoro:</b> La mente è acuta, pronta a cogliere opportunità. Le vostre idee trovano terreno fertile. Un piccolo rischio può premiare.\n<b>Fortuna:</b> Le stelle sorridono, guidando i vostri passi. Un pizzico di audacia apre porte inattese. Ascoltate l'intuizione.",
    "Capricorno": "<b>Amore:</b> Nel cuore, un sussurro di tenerezza rafforza i legami, creando armonia in momenti di intesa profonda e sincera.\n<b>Lavoro:</b> La costanza apre nuovi orizzonti; la visione chiara guida verso successi concreti, premiando l'impegno costante.\n<b>Fortuna:</b> Un vento propizio porta piccoli doni inattesi. Sii ricettivo, la sorte sorride alle opportunità che nascono.",
    "Acquario": "<b>Amore:</b> Un soffio di novità ravviva legami esistenti o accende scintille in incontri inattesi. Sii aperto alle intese profonde.\n<b>Lavoro:</b> La tua mente brillante trova soluzioni innovative. Non temere di proporre idee audaci; il successo è a portata di mano.\n<b>Fortuna:</b> È un vento favorevole che spinge le tue vele. Un'intuizione improvvisa potrebbe rivelarsi preziosa.",
    "Pesci": "<b>Amore:</b> Le correnti del cuore portano armonia profonda. Un gesto inatteso o una parola sincera rafforzano i legami, creando comprensione.\n\n<b>Lavoro:</b> La tua intuizione è una bussola preziosa. Segui i lampi di genio; una soluzione creativa emergente trasforma le sfide in opportunità.\n\n<b>Fortuna:</b> Le stelle sorridono. Piccole sincronicità positive illuminano la giornata con un tocco discreto ma significativo, apri gli occhi."
  },
  "2025-10-04": {
    "Ariete": "<b>Amore:</b> Un'intesa profonda illumina i cuori, avvicinando anime con dolci parole non dette. La sensibilità regna.\n<b>Lavoro:</b> La tua energia creativa fluisce, aprendo strade nuove; osa proporre le tue idee brillanti. La perseveranza paga.\n<b>Fortuna:</b> Una coincidenza inaspettata porterà un sorriso, un piccolo dono dal destino. Sii ricettivo ai segnali.",
    "Toro": "<b>Amore</b>: Sentimenti profondi affiorano, invitandovi a nutrire i legami con tenerezza e comprensione. Cercate l'armonia interiore.\n<b>Lavoro</b>: La vostra dedizione brilla, aprendo nuove prospettive o consolidando successi recenti. Siate pazienti e costanti.\n<b>Fortuna</b>: Un velo di inaspettata buona sorte si posa sul vostro cammino, siate pronti a cogliere le opportunità che si presentano.",
    "Gemelli": "<b>Amore:</b> Un soffio di complicità avvolge il cuore, favorendo intese profonde e sorrisi condivisi. Lasciatevi guidare dall'istinto.\n<b>Lavoro:</b> Le idee brillano, la comunicazione è la chiave per superare ogni ostacolo con arguzia. Condividete i vostri pensieri.\n<b>Fortuna:</b> Piccoli doni inattesi o incontri fortuiti rendono la giornata più leggera e promettente. Accogliete le sorprese.",
    "Cancro": "<b>Amore:</b> Il tuo cuore sensibile trova armonia, le parole non dette si trasformano in dolci melodie. Connettiti profondamente, lasciandoti avvolgere da affetti sinceri.\n<b>Lavoro:</b> La tua dedizione illumina percorsi creativi. Un'intuizione sottile ti guiderà verso decisioni fruttuose; non esitare a fidarti della tua saggezza interiore.\n<b>Fortuna:</b> Le stelle allineano eventi inaspettati a tuo favore. Cogli ogni segnale, una piccola gioia ti aspetta dietro l'angolo, portando un sorriso inatteso.",
    "Leone": "<b>Amore:</b> La fiamma interiore risplende, portando calore e intesa profonda. Un gesto inatteso potrebbe accendere nuove passioni o rafforzare legami esistenti.\n<b>Lavoro:</b> La tua leadership naturale emerge. Sii audace nelle decisioni, le stelle favoriscono la crescita e il riconoscimento dei tuoi sforzi.\n<b>Fortuna:</b> Un vento propizio soffia sulla tua strada. Mantieni gli occhi aperti per un'occasione inaspettata che può cambiare il corso della giornata.",
    "Vergine": "<b>Amore</b>: Un soffio gentile ravviva le fiamme, nutrendo intese profonde con gesti sinceri. L'armonia sboccia nel dialogo.\n<b>Lavoro</b>: La tua meticolosità brilla, aprendo nuove vie alla creatività e al riconoscimento. Progetti avanzano con passo sicuro e precisione.\n<b>Fortuna</b>: Una sincronicità inattesa ti guida, offrendo un piccolo vantaggio quando meno lo aspetti. Cogli l'attimo, è favorevole.",
    "Bilancia": "Oggi, il cuore si accorda a melodie sommesse; troverai intesa profonda in uno sguardo o riscoprirai la bellezza di un legame. L'armonia ti guida. Nel tuo operato, la <b>diplomazia</b> è chiave; affronta le sfide con grazia, cercando soluzioni eque. Le collaborazioni fioriscono. Un soffio leggero di buona <b>sorte</b> ti accompagna. Sii aperto a piccole, inaspettate gioie che colorano la tua giornata.",
    "Scorpione": "<b>Amore:</b> Il cuore sussurra segreti, invitando a connessioni profonde e autentiche. Le emozioni si intensificano, rivelando legami insospettati.\n<b>Lavoro:</b> La tua acuta intuizione guida scelte sagge. Affronta le sfide con determinazione, cogliendo l'attimo per consolidare posizioni.\n<b>Fortuna:</b> Un'onda di opportunità si avvicina, portando chiarezza e nuove prospettive. Sii ricettivo ai segnali del destino.",
    "Sagittario": "<b>Amore:</b> Il cuore danza al ritmo di un nuovo incanto, portando dolci promesse di connessione profonda.\n<b>Lavoro:</b> Idee brillanti aprono sentieri inesplorati; la tua audacia segna la via del successo.\n<b>Fortuna:</b> Un raggio inatteso di sole illumina il tuo cammino, portando opportunità sorprendenti e inattese.",
    "Capricorno": "<b>Amore:</b> Un'eco gentile risuona nel cuore, portando momenti di tenerezza e una condivisione sincera che fortifica i legami.\n<b>Lavoro:</b> La tua tenacia tesse successi; una visione acuta rivela nuove opportunità e meritati riconoscimenti per l'impegno profuso.\n<b>Fortuna:</b> Un vento propizio soffia, regalando piccole gioie e una serendipità inattesa a chi ha il cuore aperto.",
    "Acquario": "<b>Amore:</b> Un soffio d'armonia accarezza i vostri legami, favorendo intese profonde e sorrisi sinceri. Lasciatevi trasportare dall'onda emotiva.\n<b>Lavoro:</b> Le idee brillano come stelle, illuminando nuove vie. Cogliete l'attimo per proposte audaci e costruttive, avranno risonanza.\n<b>Fortuna:</b> Una brezza favorevole muove le vele del destino. Siate pronti a riconoscere opportunità inattese celate nella quotidianità.",
    "Pesci": "<b>Amore:</b> I sentimenti affiorano come perle dal profondo; un legame si rafforza nel silenzio. Ascolta il cuore, ti guiderà.\n<b>Lavoro:</b> La tua creatività è una bussola, un'idea luminosa porta successo inatteso. Naviga con fiducia.\n<b>Fortuna:</b> Un'onda benevola ti culla, il momento è propizio per un piccolo, dolce desiderio."
  },
  "2025-10-05": {
    "Ariete": "<b>Amore:</b> Un soffio gentile ravviva intese profonde, o accende dolci scintille. Lascia che il cuore guidi i tuoi passi con rinnovata fiducia.\n<b>Lavoro:</b> La tua energia è un faro. Progetti in sospeso trovano slancio, e nuove idee germogliano con potenziale di successo.\n<b>Fortuna:</b> Piccoli colpi di scena positivi illuminano la giornata. Fida il tuo istinto, ti guiderà verso doni inattesi.",
    "Toro": "<b>Amore:</b> Il tuo cuore trova pace in affetti sinceri. Momenti di tenerezza rafforzano legami, portando armonia e stabilità emotiva.\n<b>Lavoro:</b> La perseveranza è la tua alleata. Ogni sforzo, per quanto piccolo, getta solide basi per successi futuri. Sii paziente e metodico.\n<b>Fortuna:</b> Un'opportunità inattesa, celata nella routine, potrebbe svelarsi. Rimani ricettivo; una sorpresa discreta illumina la tua giornata.",
    "Gemelli": "<b>Amore:</b> Un soffio di novità accende i cuori, le parole volano leggere, creando ponti inaspettati. L'intesa si rafforza con dolcezza e comprensione.\n<b>Lavoro:</b> La mente è agile, le idee brillanti. Collaborazioni fruttuose emergono, portando a successi inattesi. Sii proattivo, la strada è chiara.\n<b>Fortuna:</b> Una piccola sorpresa allieta la giornata. Affidati all'intuito per cogliere le occasioni fugaci. Un sorriso illumina il cammino.",
    "Cancro": "<b>Amore:</b> Sentimenti dolci e sinceri si intensificano. Un'onda di tenerezza avvolge il cuore, portando calore e profonda intesa nei vostri legami.\n<b>Lavoro:</b> La vostra creatività è al culmine. Le idee germogliano come fiori; dedicatevi ai progetti con cura, i frutti della vostra dedizione non tarderanno.\n<b>Fortuna:</b> Una piacevole sorpresa illumina la giornata. Una piccola gemma brilla nel sentiero, segno di un inatteso favore che vi dona un sorriso.",
    "Leone": "<b>Amore:</b> Il tuo cuore generoso irradia, attirando connessioni profonde. Un gesto inatteso accenderà nuove scintille, rafforzando i legami con passione.\n<b>Lavoro:</b> La tua leadership brilla. Le idee audaci trovano terreno fertile, portando riconoscimenti meritati. Non temere di osare con fiducia.\n<b>Fortuna:</b> Una piccola coincidenza fortunata ti sorride, illuminando il cammino. Sii ricettivo ai doni inattesi del destino.",
    "Vergine": "<b>Amore:</b> Un filo sottile unisce i cuori, tessendo intese profonde e silenzi complici. Ascolta l'eco dell'anima gemella, trovando armonia in gesti semplici.\n<b>Lavoro:</b> La mente acuta trova soluzioni innovative. Un piccolo successo illumina il percorso, valorizzando la tua dedizione e precisione.\n<b>Fortuna:</b> Un inatteso raggio di luce filtra tra le nubi, portando serenità interiore e una piacevole sorpresa che alleggerisce la giornata.",
    "Bilancia": "<b>Amore:</b> Oggi, il cuore trova armonia in sguardi condivisi e parole non dette. Un legame si rafforza con dolcezza inaspettata.\n<b>Lavoro:</b> La tua diplomazia brilla, sbloccando situazioni complesse. Idee innovative portano a progressi significativi e riconoscimento.\n<b>Fortuna:</b> Un vento leggero soffia a tuo favore, portando piccole gioie inattese e un senso di serena abbondanza.",
    "Scorpione": "<b>Amore:</b> Un velo di mistero avvolge i vostri sentimenti, rendendovi irresistibilmente magnetici. Ascoltate il cuore, la passione attende una connessione profonda.\n<b>Lavoro:</b> Con determinazione incrollabile, affronterete ogni sfida. L'intuito vi guiderà verso soluzioni efficaci, portando frutti inaspettati.\n<b>Fortuna:</b> Un'opportunità celata si palesa; la vostra acuta percezione interiore vi permetterà di coglierla al volo, trasformando il potenziale in realtà.",
    "Sagittario": "Il cuore si apre a nuove melodie, un sussurro d'intesa ravviva vecchie fiamme o accende nuove. Nel <b>lavoro</b>, la tua visione chiara illumina sentieri inesplorati, portando frutti inattesi se la dedizione è sincera. La <b>fortuna</b> ti sorride con un tocco lieve, un'opportunità fugace da cogliere al volo. Ascolta l'intuizione, è la tua guida.",
    "Capricorno": "<b>Amore:</b> Il cuore sussurra segreti dolci. Un tocco gentile o una parola sincera accenderanno fiamme inaspettate. Sii aperto alle emozioni che sbocciano.\n<b>Lavoro:</b> La tua dedizione professionale brilla. Nuove idee germogliano; presentale con fiducia. La perseveranza aprirà porte verso successi meritati.\n<b>Fortuna:</b> La sorte ti sorride con discrezione. Piccoli gesti di generosità o un aiuto inatteso possono trasformare la tua giornata. Cogli il barlume di gioia.",
    "Acquario": "<b>Amore:</b> Un'onda di connessione sottile accarezza i tuoi sentimenti; apri il cuore a nuove risonanze.\n<b>Lavoro:</b> La tua mente acuta trova soluzioni originali. Un'intuizione vincente apre nuove strade.\n<b>Fortuna:</b> Un piccolo, inatteso favore illumina la tua giornata, portando un sorriso sereno.",
    "Pesci": "Le correnti del cuore fluiscono dolci, tessendo un'intesa profonda. Permetti alle emozioni di guidarti, rafforzando legami o aprendo a nuove, tenere connessioni. <b>Lavoro:</b> Nel mare delle sfide, il tuo intuito è la bussola. Un'idea luminosa emerge dalle profondità, portando soluzioni innovative. <b>Fortuna:</b> Un velo di serendipità ti avvolge delicatamente. Piccole coincidenze favorevoli punteggiano la giornata, rivelando sprazzi di pura armonia."
  },
  "2025-10-06": {
    "Ariete": "<b>Amore:</b> Un soffio gentile accarezza il tuo cuore, portando chiarezza in relazioni significative. Un sentimento inatteso potrebbe sbocciare, o una vecchia fiamma ritrovare vigore.\n<b>Lavoro:</b> La tua energia è un faro: illumina nuove prospettive e spinge progetti avanti con audacia. Non temere di osare.\n<b>Fortuna:</b> Una piccola, luminosa stella guida i tuoi passi, offrendo un dono inatteso o una soluzione a un vecchio dilemma.",
    "Toro": "Oggi, l'<b>Amore</b> sussurra armonie delicate; i cuori si trovano in un'intesa profonda e rassicurante. Nel <b>Lavoro</b>, la tua dedizione è chiave; semina con cura le tue idee, i frutti matureranno. La <b>Fortuna</b> ti sorride con opportunità inaspettate; apri gli occhi a nuove, brillanti direzioni che si rivelano sul tuo cammino.",
    "Gemelli": "Un vento di freschezza soffia sulle tue energie.\n<b>Amore:</b> Le conversazioni fioriscono, tessendo legami più profondi. Ogni parola un passo verso l'intesa.\n<b>Lavoro:</b> La mente è acuta, pronta a generare nuove idee. La condivisione apre porte inattese.\n<b>Fortuna:</b> Un guizzo d'intuizione rivela una piccola opportunità nascosta. Cogli l'attimo con leggerezza.",
    "Cancro": "<b>Amore:</b> Un'onda di tenerezza avvolge il tuo cuore, invitandoti a condividere emozioni profonde. Le stelle sussurrano promesse dolci.\n<b>Lavoro:</b> La tua intuizione è una guida preziosa. Progetti delicati fioriscono, la dedizione ripaga con risultati inattesi. Sii attento.\n<b>Fortuna:</b> Un piccolo raggio di sole illumina la tua giornata da un gesto inatteso. Cogli la magia nelle cose semplici.",
    "Leone": "<b>Amore:</b> Il cuore ruggisce, pronto a donarsi. Un gesto sincero accende la fiamma, portando calore e intesa profonda nel tuo cammino.\n<b>Lavoro:</b> La tua luce guida le decisioni. Affronta le sfide con audacia, il tuo impegno sarà notato e premiato con successo.\n<b>Fortuna:</b> La dea bendata sorride al coraggioso. Un'occasione inaspettata bussa, cogli la sua mano con fiducia e ottimismo.",
    "Vergine": "<b>Amore:</b> Un soffio gentile accarezza il cuore, tessendo fili di comprensione e tenerezza. Lasciatevi guidare dall'intuito emotivo.\n<b>Lavoro:</b> La vostra meticolosità sarà una risorsa preziosa. Nuove prospettive si aprono, richiedendo attenzione ai dettagli e creatività.\n<b>Fortuna:</b> Un piccolo, inatteso raggio di luce illumina la giornata, suggerendo opportunità nascoste da esplorare con fiducia.",
    "Bilancia": "<b>Amore</b>: Un soffio gentile accarezza il vostro cuore, portando armonia. Ascoltate l'altro con profonda empatia, rafforzando i legami esistenti.\n<b>Lavoro</b>: L'ingegno fiorisce, guidandovi verso soluzioni innovative. Collaborate con fiducia, i vostri progetti prenderanno forma concreta e positiva.\n<b>Fortuna</b>: Una luce benevola vi avvolge. Piccoli gesti inattesi illuminano la giornata, portando serenità e qualche piacevole sorpresa inaspettata.",
    "Scorpione": "<b>Amore:</b> Un velo si solleva, rivelando intese profonde. Ascoltate il cuore, la passione guida verso legami autentici e rivelatori.\n<b>Lavoro:</b> La vostra acuta intuizione è la chiave. Superate ostacoli con astuzia, ogni sfida si trasforma in un trionfo silenzioso.\n<b>Fortuna:</b> Energie nascoste affiorano, offrendo inattese opportunità. Fidatevi del vostro istinto, vi condurrà a scoperte preziose.",
    "Sagittario": "<b>Amore:</b> Un soffio gentile accarezza il tuo cuore, portando armonia e intesa. Apriti ai dolci sussurri che il destino ti riserva.\n<b>Lavoro:</b> La tua mente è un faro, le idee brillano chiare. Un progetto attende la tua energia creativa. Agisci con fiducia.\n<b>Fortuna:</b> Un raggio di luce illumina il tuo sentiero. Piccole gioie inattese colorano la giornata, cogli l'attimo.",
    "Capricorno": "<b>Amore:</b> Un soffio di tenerezza accarezza il tuo cuore, invitandoti a condividere emozioni sincere. Un gesto inatteso porta armonia.\n<b>Lavoro:</b> La tua determinazione illumina il percorso, risolvendo ostacoli con saggezza. Nuove idee germogliano, pronte a fiorire.\n<b>Fortuna:</b> Un'opportunità inaspettata si affaccia all'orizzonte, portando un raggio di sole. Cogli l'attimo con fiducia e ottimismo.",
    "Acquario": "<b>Amore:</b> Un soffio gentile di comprensione avvolge i legami, portando chiarezza e un calore inaspettato al cuore. Apriti.\n<b>Lavoro:</b> Le tue idee brillanti trovano terreno fertile; la collaborazione apre porte inattese verso progressi significativi. Sii audace.\n<b>Fortuna:</b> Un vento favorevole soffia verso di te, portando piccole, ma preziose opportunità da cogliere al volo. Resta vigile.",
    "Pesci": "<b>Amore:</b> Onde emotive profonde accarezzano l'anima, promettendo un'intima risonanza. Lascia che il tuo intuito guidi il cammino amoroso. <b>Lavoro:</b> Nel regno professionale, la tua creatività è una bussola. Affidati alle visioni interiori per cogliere brillanti opportunità. <b>Fortuna:</b> Un sussurro del destino porta una sorpresa inattesa. La fortuna danza leggera intorno a te, sii pronto ad accoglierla."
  },
  "2025-10-07": {
    "Ariete": "<b>Amore:</b> Il cuore si apre a nuove intese, un ponte invisibile unisce anime. Lasciatevi guidare dalla tenerezza, riscoprendo la bellezza dei legami sinceri.\n<b>Lavoro:</b> Un lampo di genio illumina i progetti. La vostra determinazione porta riconoscimenti meritati. Nuove prospettive e collaborazioni fruttuose sono all'orizzonte.\n<b>Fortuna:</b> Un soffio leggero del destino porta inattese gioie. Siate aperti ai doni che la giornata offre, un sorriso illumina il cammino.",
    "Toro": "<b>Amore:</b> Un soffio gentile accarezza il cuore, rafforzando legami e promettendo dolci intese. Apritevi alla tenerezza sincera.\n<b>Lavoro:</b> La vostra dedizione porta frutti maturi. Un passo ponderato oggi consolida la strada verso il successo futuro e riconosciuto.\n<b>Fortuna:</b> Un piccolo, inatteso favore illumina la giornata, portando un sorriso dove meno lo attendete. Cogliete l'attimo propizio.",
    "Gemelli": "<b>Amore:</b> Un sussurro del cuore rende l'intesa più profonda. Il dialogo sincero apre nuove, delicate vie per rafforzare i legami.\n<b>Lavoro:</b> La mente agile trova soluzioni inattese con brillantezza. Collaborazioni fruttuose spingono avanti i vostri progetti con rinnovata energia.\n<b>Fortuna:</b> Una scintilla inaspettata illumina il percorso. Cogli l'attimo, un piccolo gesto può fare la differenza e portare un sorriso.",
    "Cancro": "<b>Amore:</b> Il cuore palpita leggero, donando e ricevendo affetto sincero. Aperture inaspettate vi attendono, accoglietele con grazia e tenerezza.\n<b>Lavoro:</b> La creatività fiorisce nelle mansioni quotidiane. Fidatevi del vostro istinto per superare ogni ostacolo, il successo è vicino.\n<b>Fortuna:</b> La buona sorte sorride in dettagli inattesi. Un'onda di serenità vi avvolge, ricaricando lo spirito e l'ambiente domestico.",
    "Leone": "<b>Amore:</b> Oggi il cuore arde di un fuoco gentile; concediti la gioia di condividere, l'amore ti sorriderà con gesti inaspettati.\n<b>Lavoro:</b> La tua luce guida illumina il cammino; non temere di mostrare la tua visione, il successo è a portata di mano.\n<b>Fortuna:</b> Ti bende gli occhi, ma non il tuo spirito audace; cogli l'attimo, una svolta inattesa è vicina.",
    "Vergine": "<b>Amore:</b> Nel cuore, un sussurro gentile invita all'apertura; lasciatevi guidare dall'intuito nelle connessioni.\n<b>Lavoro:</b> Al lavoro, la vostra mente analitica brilla, trasformando sfide complesse in successi organizzati.\n<b>Fortuna:</b> La fortuna si cela in dettagli inattesi; cogliete l'attimo, un piccolo gesto può aprire grandi porte.",
    "Bilancia": "<b>Amore</b>: Un soffio gentile accarezza il tuo cuore; condividi pensieri profondi, l'armonia sboccia nel dialogo.\n<b>Lavoro</b>: La tua innata diplomazia ti guida. Collaborazioni fruttuose emergono, portando a soluzioni eleganti e risultati apprezzabili.\n<b>Fortuna</b>: Una piccola, inaspettata brezza favorevole ti sospinge, rivelando un'opportunità o una soluzione proprio quando meno te l'aspetti.",
    "Scorpione": "Nel cuore, <b>Amore</b> svela profondità inattese; le connessioni si intensificano. Sul fronte <b>Lavoro</b>, la tua perspicacia è la chiave: affronta ogni sfida con strategia e visione. La <b>Fortuna</b> sorride discreta, celata in piccoli momenti di serendipità che illuminano il tuo percorso con una luce sottile ma potente.",
    "Sagittario": "<b>Amore:</b> Un calore avvolge il cuore, invitandovi a condividere emozioni sincere. Un dialogo profondo può rafforzare legami esistenti o aprirne di nuovi con grazia.\n<b>Lavoro:</b> La vostra mente acuta trova soluzioni inaspettate. Siate audaci nelle idee; un'opportunità di crescita si manifesta per chi sa cogliere l'attimo.\n<b>Fortuna:</b> Una brezza leggera porta un'occasione imprevista. Fidatevi dell'intuito; una piccola gioia illumina la giornata con un tocco di magia.",
    "Capricorno": "Errore API Gemini: 429 RESOURCE_EXHAUSTED. {'error': {'code': 429, 'message': 'You exceeded your current quota, please check your plan and billing details. For more information on this error, head to: https://ai.google.dev/gemini-api/docs/rate-limits.\\n* Quota exceeded for metric: generativelanguage.googleapis.com/generate_content_free_tier_requests, limit: 10\\nPlease retry in 12.15387379s.', 'status': 'RESOURCE_EXHAUSTED', 'details': [{'@type': 'type.googleapis.com/google.rpc.QuotaFailure', 'violations': [{'quotaMetric': 'generativelanguage.googleapis.com/generate_content_free_tier_requests', 'quotaId': 'GenerateRequestsPerMinutePerProjectPerModel-FreeTier', 'quotaDimensions': {'location': 'global', 'model': 'gemini-2.5-flash'}, 'quotaValue': '10'}]}, {'@type': 'type.googleapis.com/google.rpc.Help', 'links': [{'description': 'Learn more about Gemini API quotas', 'url': 'https://ai.google.dev/gemini-api/docs/rate-limits'}]}, {'@type': 'type.googleapis.com/google.rpc.RetryInfo', 'retryDelay': '12s'}]}}",
    "Acquario": "<b>Amore:</b> Un filo invisibile lega i cuori, portando comprensione profonda e sguardi complici. Apri il tuo spirito alla connessione.\n<b>Lavoro:</b> Idee brillanti emergono, trova alleati per concretizzarle. La collaborazione apre porte inattese verso il progresso.\n<b>Fortuna:</b> Una scintilla di buona sorte illumina il tuo percorso. Affidati all'istinto, ti guiderà verso opportunità velate.",
    "Pesci": "<b>Amore:</b> Un'onda gentile di comprensione avvolge il cuore, portando dolci sussurri e connessioni profonde. Lascia che l'emozione guidi i tuoi gesti.\n<b>Lavoro:</b> L'intuizione è la tua bussola; segui il flusso creativo per risolvere enigmi inattesi. Evita la fretta e fidati del tuo istinto.\n<b>Fortuna:</b> Una stella benevola ti sorride, promettendo piccole gioie inaspettate e una ritrovata serenità interiore. Abbraccia la magia del momento."
  },
  "2025-10-08": {
    "Ariete": "<b>Amore:</b> Un soffio di passione risveglia i sensi, portando intese profonde o un nuovo, frizzante incontro. Ascolta il tuo cuore ardente.\n<b>Lavoro:</b> La tua energia è magnetica. Nuove sfide si presentano, pronte ad essere affrontate con la tua audacia innata. Non temere di osare.\n<b>Fortuna:</b> Un piccolo, piacevole imprevisto rallegrerà la tua giornata. Sii aperto alle dolci sorprese che il destino ti riserva.",
    "Toro": "<b>Amore:</b> Nel cuore, armonie inattese fioriscono, portando dolci intese. Un sussurro d'anima gemella rasserena le tue giornate.\n<b>Lavoro:</b> La tua tenacia modella il successo. Idee solide trovano terreno fertile, consolidando posizioni con pragmatismo.\n<b>Fortuna:</b> La sorte ti sorride con discrezione, suggerendo percorsi benefici e inaspettati vantaggi materiali.",
    "Gemelli": "<b>Amore:</b> Un'intesa profonda illumina i vostri legami, con un tocco di giocosa leggerezza. Lasciatevi guidare dal cuore per connessioni sincere.\n\n<b>Lavoro:</b> La vostra mente vivace trova soluzioni ingegnose. La comunicazione fluida aprirà nuove vie, superando ostacoli con brillantezza.\n\n<b>Fortuna:</b> Un piccolo, inatteso dono dal destino allieta la giornata, portando un sorriso e una scintilla di speranza.",
    "Cancro": "<b>Amore</b>: La luna tesse fili sottili, invitandovi a un abbraccio sincero o a un ascolto profondo. Il cuore si apre, cercate conforto nella vicinanza.\n<b>Lavoro</b>: L'intuito è la vostra bussola migliore. Affrontate le sfide con delicatezza, le soluzioni emergono da un approccio calmo e riflessivo.\n<b>Fortuna</b>: Un piccolo gesto inatteso o una coincidenza felice illuminano la giornata. Accogliete la serenità che vi circonda.",
    "Leone": "<b>Amore:</b> Il cuore ardente trova risposte in sguardi profondi, accendendo nuove fiamme con passione sincera.\n<b>Lavoro:</b> La tua luce guida progetti audaci; non temere di brillare, le tue idee sono oro.\n<b>Fortuna:</b> Sorride in un inatteso dono o una svolta propizia, rivelando opportunità celate. Abbraccia la tua magnificenza.",
    "Vergine": "<b>Amore:</b> Il cuore oggi sussurra dolci melodie; ascolta l'eco per intime connessioni e armonia.\n<b>Lavoro:</b> La tua meticolosità brilla, rivelando soluzioni inaspettate e proficue opportunità. La dedizione ripaga.\n<b>Fortuna:</b> Un piccolo, ma significativo dono del destino ti sorriderà, portando leggerezza e un inatteso barlume di gioia.",
    "Bilancia": "<b>Amore:</b> Un soffio gentile accarezza i vostri sentimenti, favorendo intesa e armonia profonda. Condivisione e dolcezza vi guidano.\n<b>Lavoro:</b> L'equilibrio è la vostra arma segreta. Affrontate sfide con grazia diplomatica, trovando soluzioni innovative e riconosciute.\n<b>Fortuna:</b> La sorte vi sorride con piccole, inaspettate coincidenze che aprono nuove vie. Fidatevi del vostro intuito per coglierle.",
    "Scorpione": "<b>Amore:</b> La passione sorge dalle profondità, chiedendo sincerità. Un legame si rafforza con la verità condivisa, non temere l'intensità del momento.\n<b>Lavoro:</b> La tua intuizione è una guida infallibile. Svela opportunità celate, affrontando con astuzia ogni sfida. I tuoi sforzi saranno notati.\n<b>Fortuna:</b> Un vento favorevole soffia da direzioni inattese. Ascolta il tuo sesto senso, ti condurrà a una scoperta preziosa.",
    "Sagittario": "<b>Amore:</b> Un soffio gentile accarezza il cuore, portando intesa e nuove prospettive. Lasciati guidare dall'autenticità. Nuovi incontri promettenti.\n<b>Lavoro:</b> Le tue idee brillano, aprendo strade inesplorate. Agisci con fiducia, il successo è a portata di mano. Un'intuizione vincente.\n<b>Fortuna:</b> Il destino sorride, tessendo fili di inaspettate coincidenze che ti guidano verso la gioia. Un dono inatteso.",
    "Capricorno": "<b>Amore:</b> Un tocco gentile riscalda il cuore, svelando connessioni profonde. Lasciatevi avvolgere dalla tenerezza, la sincerità apre nuove porte dell'anima e rinnova i legami.\n<b>Lavoro:</b> La vostra dedizione brilla, attirando sguardi ammirati. Una sfida si trasforma in trampolino, portando riconoscimento e fertili opportunità di crescita inattese.\n<b>Fortuna:</b> Una brezza inattesa porta un sussurro di buona sorte. Fidatevi dell'intuito; una piccola sorpresa rallegrerà la giornata, illuminando il cammino con leggerezza.",
    "Acquario": "<b>Amore:</b> Un soffio gentile riscalda i legami, accendendo nuove intese. Condividi emozioni sincere, troverai riscontro.\n<b>Lavoro:</b> La tua visione unica trova terreno fertile. Non esitare a proporre idee innovative; il successo è a portata di mano.\n<b>Fortuna:</b> Un piccolo colpo di scena positivo illumina la giornata, portando un sorriso inaspettato. Sii aperto alle sorprese.",
    "Pesci": "<b>Amore:</b> Un velo di magia avvolge i legami; l'intuito guida il cuore verso intese profonde. Lasciati trasportare.\n<b>Lavoro:</b> La creatività fiorisce, portando soluzioni inaspettate. Sii pratico nelle scelte, ma segui l'ispirazione.\n<b>Fortuna:</b> Un piccolo dono del destino si palesa, cogli l'attimo con gratitudine. Sii aperto alle sorprese."
  },
  "2025-10-09": {
    "Ariete": "<b>Amore:</b> Un soffio gentile accarezza i sentimenti, invita a nuove connessioni o a riscoprire la magia di quelle esistenti. L'ascolto è la chiave.\n<b>Lavoro:</b> La tua energia è una fiamma guida. Progetti e idee trovano terreno fertile, ma la pazienza è un alleato prezioso.\n<b>Fortuna:</b> Una scintilla inattesa illumina il cammino. Sii pronto ad accogliere piccole sorprese che addolciranno la giornata.",
    "Toro": "<b>Amore:</b> Il cuore sussurra dolci intese, accendendo la fiamma della tenerezza in momenti inattesi.\n<b>Lavoro:</b> La tua costanza porta frutti inaspettati; un progetto prende la giusta direzione.\n<b>Fortuna:</b> Ti sorride con un piccolo segno, una coincidenza fortunata che rischiara la giornata. Sii aperto ai messaggi del destino.",
    "Gemelli": "<b>Amore:</b> Le stelle sussurrano armonia, portando chiarezza ai sentimenti. Un dialogo sincero rafforza i legami, accendendo nuove scintille di comprensione.\n<b>Lavoro:</b> La mente è un vulcano di idee fresche. Nuove prospettive emergono, valorizzando la tua innata versatilità. Sii audace nelle proposte.\n<b>Fortuna:</b> Un'onda lieve di buona sorte ti accompagna. Presta attenzione ai piccoli segnali del destino, nascondono opportunità inattese e vantaggi insperati.",
    "Cancro": "<b>Amore:</b> Un'onda di tenerezza avvolge il cuore, favorendo intesa e dolcezza. Ascolta l'anima gemella con profonda empatia.\n<b>Lavoro:</b> L'intuito guida le tue azioni con saggezza, trasformando ogni compito in un'opportunità creativa e proficua.\n<b>Fortuna:</b> Sorrisi inattesi ti raggiungono da luoghi sereni, portando piccole gioie e un senso di profonda pace interiore.",
    "Leone": "Il cuore brilla di una luce intensa: un gesto inatteso accende la passione. Nel <b>lavoro</b>, la tua determinazione apre nuove strade; affronta le sfide con coraggio. La <b>fortuna</b> sorride con un piccolo ma significativo aiuto, un soffio di vento favorevole che spinge le tue vele verso orizzonti promettenti. Sii audace.",
    "Vergine": "<b>Amore</b>: Un filo invisibile lega cuori, portando tenerezza e comprensione profonda. Ascolta il sussurro dell'anima gemella che ti circonda.\n<b>Lavoro</b>: La precisione è la tua alleata; un'intuizione acuta apre nuove prospettive, consolidando ogni sforzo con risultati tangibili.\n<b>Fortuna</b>: Un piccolo dono inatteso o un'opportunità velata si rivela, guidandoti verso un sereno benessere e nuove realizzazioni.",
    "Bilancia": "<b>Amore:</b> L'amore soffia una brezza gentile, portando armonia nei legami. Un dialogo sincero rafforza ogni intesa, avvicinando i cuori con delicatezza.\n\n<b>Lavoro:</b> Nel lavoro, la tua diplomazia apre nuove vie inattese. Cerca l'equilibrio nelle scelte, la chiarezza premia i tuoi sforzi.\n\n<b>Fortuna:</b> La fortuna ti sorride con piccole, inattese gioie. Segui l'intuizione, una stella guida ti illumina il percorso.",
    "Scorpione": "<b>Amore:</b> Un velo si solleva, rivelando profondità insperate nel cuore del tuo legame. Ascolta il silenzio eloquente.\n<b>Lavoro:</b> La tua acutezza strategica è un faro; affronta le sfide con determinazione, il successo è nel dettaglio.\n<b>Fortuna:</b> Un sussurro del destino ti guida. Apri la mente a opportunità inattese che portano luce e nuove prospettive.",
    "Sagittario": "<b>Amore:</b> Un soffio di passione accende il cuore, avvicinando anime in un dolce abbraccio. Lasciatevi guidare dal sentire profondo che vi unisce.\n<b>Lavoro:</b> Nuove prospettive si svelano, chiamando la vostra energia creativa. Agite con fiducia, la strada verso il successo si apre chiaramente.\n<b>Fortuna:</b> Una stella benevola illumina il vostro cammino, portando piccole gioie inattese. Apritevi alle sorprese, sono dietro l'angolo.",
    "Capricorno": "<b>Amore:</b> Nel giardino del cuore, un fiore sboccia, portando armonia e comprensione profonda nei vostri legami.\n<b>Lavoro:</b> L'impegno costante illumina il vostro percorso, le sfide si trasformano in scalini verso un successo meritato.\n<b>Fortuna:</b> Un soffio leggero di buona sorte vi accarezza, aprendo porte inaspettate a piccole, dolci sorprese.",
    "Acquario": "<b>Amore:</b> Un dialogo sincero illumina i sentimenti, rafforzando legami o aprendo a nuove, sorprendenti affinità. Lascia che il cuore ti guidi.\n<b>Lavoro:</b> La tua inventiva è al top. Idee originali risolvono ostacoli, portando riconoscimenti o nuove prospettive professionali. Non temere di osare.\n<b>Fortuna:</b> Piccoli eventi fortuiti colorano la giornata. Sii attento ai segnali, potrebbero indicare una via inaspettata. La leggerezza è tua alleata.",
    "Pesci": "<b>Amore:</b> Le acque del cuore fluiscono con tenerezza, accogliendo un'onda di comprensione profonda. Un gesto inatteso accende la scintilla.\n<b>Lavoro:</b> L'intuizione è la tua guida, svelando percorsi creativi. Affidati alla tua visione interiore per superare ogni ostacolo.\n<b>Fortuna:</b> Una serendipità sottile ti sorride, portando un dono inatteso. Apri gli occhi ai piccoli miracoli del giorno."
  },
  "2025-10-10": {
    "Ariete": "<b>Amore:</b> Un soffio gentile accarezza il tuo cuore, portando armonia o un nuovo, dolce calore. Sii aperto alle connessioni profonde.\n<b>Lavoro:</b> La tua energia brillante illumina la via. Progetti e idee trovano terreno fertile; agisci con audacia e determinazione.\n<b>Fortuna:</b> Un barlume inatteso ti guida. Cogli le opportunità che si presentano, anche le più piccole, perché nascondono grandi potenzialità.",
    "Toro": "<b>Amore:</b> Un tenero abbraccio scalda il cuore, rafforzando legami preziosi. Momenti di profonda intesa fioriscono, nutrendo l'anima con dolcezza.\n<b>Lavoro:</b> La tua perseveranza è la chiave. Ogni sforzo costante porta frutti tangibili, assicurando stabilità e riconoscimenti meritati.\n<b>Fortuna:</b> Una quieta armonia ti avvolge. Piccoli dettagli inattesi portano gioia, illuminando la giornata con serena abbondanza.",
    "Gemelli": "<b>Amore:</b> Le parole del cuore danzano, trova il momento giusto per esprimere ciò che senti. Un dialogo sincero può rafforzare un legame o accendere una nuova scintilla.\n\n<b>Lavoro:</b> La tua mente è un faro luminoso, pronta a cogliere idee innovative. Sii aperto alla collaborazione; un confronto inatteso può svelare nuove strade promettenti.\n\n<b>Fortuna:</b> Un soffio lieve di buona sorte ti accompagna. Presta attenzione ai piccoli dettagli e alle intuizioni fulminee, nascondono opportunità inaspettate.",
    "Cancro": "<b>Amore:</b> I fili del cuore si intessono con dolcezza, donando rifugio e comprensione. Ascolta le melodie più intime, un abbraccio scalderà l'anima.\n<b>Lavoro:</b> La tua intuizione illumina i percorsi. Collabora con sensibilità, trovando soluzioni creative nel gruppo. La calma ti premia.\n<b>Fortuna:</b> Un piccolo dono inatteso o una quiete domestica ti avvolge, portando una serena armonia e un sorriso spontaneo.",
    "Leone": "<b>Amore:</b> Il cuore ardente trova risonanza, un legame si rafforza con inaspettata sincerità. Osate esprimere la vostra fiamma interiore.\n<b>Lavoro:</b> La vostra luce guida decisioni importanti, un'idea brillante cattura l'attenzione. Mostrate il vostro valore intrinseco.\n<b>Fortuna:</b> Un raggio di sole illumina un percorso inatteso. Il destino sorride, cogliete l'attimo propizio con fiducia.",
    "Vergine": "<b>Amore:</b> Un tocco gentile riscalda il cuore, tessendo intese profonde. Ascolta le emozioni che sbocciano, portando armonia e vicinanza.\n<b>Lavoro:</b> La tua dedizione illumina il percorso, rivelando soluzioni ingegnose. La mente è lucida, pronta a cogliere dettagli preziosi.\n<b>Fortuna:</b> Un soffio discreto del destino apre porte inattese. Sii ricettivo ai piccoli favori che ti sorridono con grazia.",
    "Bilancia": "<b>Amore:</b> Il cuore sussurra dolci armonie, invitando alla comprensione reciproca. Un gesto inatteso accende la fiamma della connessione.\n<b>Lavoro:</b> Nel regno professionale, la tua innata diplomazia apre porte inattese, trasformando sfide in opportunità collaborative. Sii audace e giusto.\n<b>Fortuna:</b> La sorte ti sorride con piccole, inaspettate coincidenze che allineano il cammino, portando serenità e un senso di giusta ricompensa.",
    "Scorpione": "<b>Amore:</b> Un velo si solleva, rivelando profonde connessioni. Condividi sentimenti, la tua anima risplende in intime armonie.\n<b>Lavoro:</b> L'intuizione è la tua bussola. Ogni sfida nasconde un'opportunità preziosa, affrontala con acuta strategia.\n<b>Fortuna:</b> Il destino sorride da angoli inattesi. Segui il tuo istinto, sarà la tua guida più fedele e sicura oggi.",
    "Sagittario": "<b>Amore:</b> Il cuore danza in armonia, trovando dolci intese che nutrono l'anima con calore e comprensione. Un sorriso svela un legame profondo.\n<b>Lavoro:</b> L'ingegno splende, aprendo nuove rotte. Affronta le sfide con audacia: le tue idee migliori trovano oggi fertile terreno.\n<b>Fortuna:</b> Un'eco gentile dal destino ti sfiora, portando un inatteso dono o un'opportunità che illumina il tuo percorso. Sii ricettivo.",
    "Capricorno": "<b>Amore:</b> Un tenero raggio illumina i tuoi affetti, portando armonia. Ascolta il cuore, le connessioni si approfondiscono con dolcezza inattesa.\n<b>Lavoro:</b> La tua dedizione è una bussola sicura. Nuove opportunità emergono, fidati del tuo istinto e sii proattivo con saggezza.\n<b>Fortuna:</b> Piccoli doni del destino allieteranno la giornata. Un inatteso sorriso della sorte ti avvolge in una serena aura positiva.",
    "Acquario": "<b>Amore:</b> I venti portano sussurri di intesa; apri il cuore a connessioni inattese e sincere. La complicità fiorisce nella condivisione intellettuale.\n<b>Lavoro:</b> La tua mente brilla, guidando progetti innovativi. Condividi le tue visioni; saranno accolte con entusiasmo, portando avanti grandi idee.\n<b>Fortuna:</b> Un'intuizione improvvisa ti aprirà una porta segreta verso un'opportunità inattesa. Fida il tuo istinto.",
    "Pesci": "<b>Amore:</b> Le tue emozioni fluttuano come onde, portando dolci messaggi. Lascia che il cuore guidi, la tenerezza trova risposte inaspettate.\n<b>Lavoro:</b> L'intuito è la tua bussola oggi. Ascolta quella voce interiore, ti guiderà verso soluzioni creative e successi nascosti.\n<b>Fortuna:</b> Un raggio di luce illumina il tuo cammino, portando piccole sorprese. Sii aperto ai doni inattesi del destino."
  },
  "2025-10-11": {
    "Ariete": "<b>Amore</b>: Un'onda di tenerezza avvolge il tuo cuore, portando armonia e comprensione profonda. Ascolta le sfumature.\n<b>Lavoro</b>: La tua energia è magnetica. Progetti audaci trovano terreno fertile; non esitare a guidare con decisione.\n<b>Fortuna</b>: Una scintilla inattesa illumina il cammino, rivelando opportunità nascoste. Segui quell'intuizione audace.",
    "Toro": "<b>Amore</b>: Un abbraccio sincero rinsalda legami preziosi, il cuore trova stabilità in affetti consolidati. Sentimenti radicati portano gioia.\n<b>Lavoro</b>: La tua dedizione costante apre nuove opportunità. La pazienza nel dettaglio si rivela una virtù premiante.\n<b>Fortuna</b>: Una piccola, inattesa grazia allieta la giornata, portando un senso di benessere e gratitudine. Sii ricettivo.",
    "Gemelli": "<b>Amore:</b> Un soffio gentile anima il cuore, portando intese profonde. Siate aperti a nuove connessioni sincere, il dialogo vi arricchisce.\n<b>Lavoro:</b> Le idee brillano come stelle, guidando scelte astute. Collaborazioni fruttuose sono all'orizzonte, cogliete le opportunità con prontezza.\n<b>Fortuna:</b> Un velo di serendipità vi avvolge, rivelando piccole gioie inaspettate. Seguite il vostro istinto, vi condurrà a piacevoli scoperte.",
    "Cancro": "Un'aura di tenerezza avvolge il tuo spirito, rendendo le connessioni più profonde. In <b>amore</b>, un'intesa speciale si consolida, regalando momenti di pura armonia. Nel <b>lavoro</b>, la tua innata intuizione è una guida preziosa: ascoltala e vedrai progetti sbocciare con successo. La <b>fortuna</b> sorride da gesti inaspettati e dalla serenità domestica, portando gioia e un senso di pace interiore che illumina il tuo cammino.",
    "Leone": "<b>Amore:</b> La tua fiamma interiore riscalda i cuori, portando armonia e intesa profonda. Connessioni sincere fioriscono sotto il tuo sguardo radioso.\n<b>Lavoro:</b> Le tue idee brillano con forza leonina, guidando progetti verso il successo. Riconoscimenti meritati sono all'orizzonte.\n<b>Fortuna:</b> Un tocco inaspettato di buona sorte illumina il tuo cammino, aprendo porte e rivelando opportunità preziose. Abbraccia il cambiamento.",
    "Vergine": "<b>Amore:</b> Un tenero sussurro del cuore accende nuove intese. Ascolta con dolcezza, rafforzando legami o scoprendo dolci connessioni inattese.\n<b>Lavoro:</b> Il tuo ingegno brilla, illuminando dettagli cruciali. Progetti prendono forma con passi sicuri, portando un meritato progresso.\n<b>Fortuna:</b> Una brezza favorevole porta un sorriso inatteso. Cogli il momento, un piccolo dono del destino è pronto a sorprenderti.",
    "Bilancia": "Un soffio gentile accarezza il tuo <b>amore</b>, portando armonia e intesa profonda. Nel <b>lavoro</b>, la diplomazia è la tua stella guida; soluzioni eleganti aprono nuove porte. Una scintilla di <b>fortuna</b> illumina le tue scelte più ponderate, guidandoti verso esiti felici. Fidati del tuo intuito.",
    "Scorpione": "<b>Amore:</b> Un velo sottile si solleva, rivelando l'intensità di un legame. Lascia che il cuore guidi la tua profonda connessione.\n\n<b>Lavoro:</b> La tua perspicacia è la chiave. Ogni sfida si trasforma in opportunità se la affronti con astuzia e determinazione.\n\n<b>Fortuna:</b> Un'onda inaspettata porta doni. Abbraccia il cambiamento, la sorte ti è propizia, specialmente nelle scelte audaci.",
    "Sagittario": "<b>Amore:</b> Il cuore danza su note inattese. La comunicazione sincera rafforza legami o ne accende di nuovi, lasciando spazio alla spontaneità.\n<b>Lavoro:</b> Le tue idee brillano come stelle. Mostra iniziativa; l'ingegno porta frutti inaspettati e nuove strade si aprono.\n<b>Fortuna:</b> Un raggio di sole illumina sentieri nascosti. Cogli ogni opportunità, anche la più piccola, con spirito d'avventura.",
    "Capricorno": "<b>Amore:</b> Un tenero gesto o una parola sincera rafforzano i legami, creando armonia nel cuore.\n<b>Lavoro:</b> La tua concentrazione metodica porta frutti. Un'idea chiara emerge, guidandoti verso nuovi orizzonti produttivi.\n<b>Fortuna:</b> Un'intuizione sottile ti guida. Abbraccia l'inatteso, una piccola sorpresa rischiara la giornata.",
    "Acquario": "<b>Amore:</b> Il cuore vibra su frequenze inattese, cercando connessioni profonde e autentiche. Un dialogo sincero illumina la via, portando chiarezza e vicinanza.\n<b>Lavoro:</b> La mente è fertile, pronta a seminare idee brillanti. Collaborazioni innovative portano frutti inaspettati, favorendo progressi significativi.\n<b>Fortuna:</b> Una stella benevola sorride da angoli insoliti. L'intuizione guida verso opportunità nascoste, premiando l'apertura al nuovo.",
    "Pesci": "<b>Amore:</b> Un velo di intesa avvolge i cuori, rivelando sussurri d'anima. Lascia che la tenerezza guidi ogni gesto, approfondendo legami preziosi.\n\n<b>Lavoro:</b> L'intuizione si fa stella polare tra le onde delle mansioni. Segui il tuo istinto creativo; una soluzione inattesa emergerà dalla nebbia.\n\n<b>Fortuna:</b> Un piccolo, sereno imprevisto allieterà la giornata. Sii aperto ai doni del caso, essi portano un sorriso inaspettato."
  },
  "2025-10-12": {
    "Ariete": "<b>Amore:</b> La tenerezza fiorisce in conversazioni sincere. Il cuore si apre, rafforzando legami preziosi e inaspettati.\n<b>Lavoro:</b> Un'intuizione brillante illumina il tuo percorso. Affronta le sfide con audacia, il successo è a portata di mano.\n<b>Fortuna:</b> Un piccolo, inatteso gesto del destino ti sorprende, portando gioia e una ventata di leggerezza.",
    "Toro": "<b>Amore:</b> Un soffio gentile accarezza il cuore, rivelando intime armonie. Condivisione e dolcezza tessono fili di una intesa profonda.\n<b>Lavoro:</b> La tua tenacia apre varchi inaspettati. Ogni sforzo, meticoloso e paziente, ora fiorisce in stabili successi e riconoscimenti.\n<b>Fortuna:</b> Un piccolo dono del destino ti attende, un conforto che nutre l'anima e arricchisce il quotidiano.",
    "Gemelli": "<b>Amore:</b> Un soffio gentile ravviva le fiamme, le parole creano ponti. L'armonia si tesse con gesti inattesi.\n<b>Lavoro:</b> La mente agile coglie opportunità, le idee fioriscono con successo. È tempo di brillare in nuove direzioni.\n<b>Fortuna:</b> Un piccolo dono del destino illumina il tuo percorso. Sii ricettivo, una sorpresa positiva ti attende.",
    "Cancro": "<b>Amore:</b> Il tuo cuore sensibile danza in armonie sottili. Condividi la tua tenerezza; un legame prezioso si rafforza, un nuovo affetto sboccia.\n<b>Lavoro:</b> L'intuizione ti guida verso soluzioni inaspettate. La tua dedizione porta frutti dolci; non temere di mostrare la tua luce.\n<b>Fortuna:</b> Un piccolo dono del destino ti attende. Affidati ai tuoi presentimenti, ti indicheranno la via verso una serena opportunità.",
    "Leone": "<b>Amore:</b> Il cuore, un fuoco ardente, cerca calore e risposte sincere. Un gesto inaspettato scioglierà ogni dubbio, portando chiarezza e passione.\n<b>Lavoro:</b> La vostra visione chiara guida passi decisi. Un'idea brillante illumina il cammino, portando riconoscimento meritato e nuove opportunità.\n<b>Fortuna:</b> Una stella propizia veglia su di voi, offrendo un piccolo dono inatteso o la soluzione a un quesito a lungo cercato.",
    "Vergine": "<b>Amore:</b> Un soffio di tenerezza inatteso ravviva le fiamme, portando armonia. La sensibilità guida dolcemente le parole, rafforzando legami preziosi.\n<b>Lavoro:</b> La tua meticolosa attenzione ai dettagli si rivela vincente. Un'idea brillante emerge, illuminando nuove prospettive e garantendo successo.\n<b>Fortuna:</b> Una piccola sorpresa ti attende, un gesto inaspettato porta gioia. Il destino ti sorride attraverso un dettaglio quasi invisibile.",
    "Bilancia": "<b>Amore:</b> Oggi le stelle sussurrano dolci intese, trova l'equilibrio perfetto nel dare e ricevere affetto. Ascolta il cuore.\n<b>Lavoro:</b> Un'opportunità si presenta velata, la tua innata diplomazia aprirà nuove vie al successo. Sii perspicace.\n<b>Fortuna:</b> Un raggio inatteso di buona sorte illumina il cammino, portando un sorriso inatteso e leggerezza.",
    "Scorpione": "<b>Amore:</b> Le profondità dell'anima si rivelano, unendo i cuori in comprensioni silenziose e ardenti. Ascolta l'eco del desiderio.\n<b>Lavoro:</b> La tua perspicacia acuta svela opportunità nascoste. Agisci con strategia; la chiarezza porta a successi inattesi.\n<b>Fortuna:</b> Fidati del tuo istinto, è la tua guida più fedele. Un dono inatteso emerge dall'ombra, illuminando il tuo cammino.",
    "Sagittario": "<b>Amore:</b> Il cuore si apre a nuove melodie, un'intesa profonda attende la tua anima libera. Connettiti con gentilezza e passione.\n<b>Lavoro:</b> L'ingegno brilla, nuove strade si rivelano. La collaborazione porta frutti inaspettati. Sii audace nelle idee.\n<b>Fortuna:</b> Una stella propizia veglia su di te, portando un soffio di magia dove meno lo aspetti. Abbraccia l'inatteso dono del giorno.",
    "Capricorno": "<b>Amore:</b> Un soffio gentile accarezza il vostro cuore, favorendo intese profonde e sguardi complici. L'affetto si consolida in gesti inattesi.\n<b>Lavoro:</b> La vostra dedizione incrollabile porta a nuove conquiste. Un progetto riceve la giusta attenzione, pavesando il cammino.\n<b>Fortuna:</b> Piccoli doni del destino illuminano la giornata. Ascoltate l'intuizione, vi guiderà verso opportunità inaspettate.",
    "Acquario": "Oggi, il cuore trova risonanze inattese, tessendo fili d'intesa profonda. Nel <b>lavoro</b>, la mente vola alta, portando innovazione e chiarezza dove serve. La <b>fortuna</b> sorride con un sussurro gentile, guidandoti verso scoperte inaspettate. Abbraccia l'originalità che ti definisce.",
    "Pesci": "<b>Amore:</b> Le maree emotive ti accarezzano, portando dolci sussurri al cuore. Un incontro inatteso o un’intesa profonda illumina la sera.\n<b>Lavoro:</b> La tua intuizione è una bussola preziosa; fidati dei presentimenti per guidare scelte professionali sagge e innovative.\n<b>Fortuna:</b> Un velo di serendipità ti avvolge. Piccoli gesti o un colpo di fortuna aprono porte inattese, offrendo inaspettate ricompense."
  },
  "2025-10-13": {
    "Ariete": "<b>Amore:</b> Un soffio gentile ravviva fiamme antiche o ne accende di nuove. L'intesa fiorisce con dolci parole non dette. Il cuore palpita.\n<b>Lavoro:</b> Energie fresche favoriscono la creatività. Un'intuizione acuta sblocca ostacoli, portando chiarezza e progressi inaspettati. Sii proattivo.\n<b>Fortuna:</b> Un piccolo colpo di vento favorevole spinge le tue vele. Ascolta l'istinto, ti guiderà verso opportunità velate e sorrisi inattesi.",
    "Toro": "<b>Amore:</b> Nel giardino del cuore, un fiore sboccia, portando intesa profonda e calore avvolgente. Le anime si cercano con dolcezza, trovando rifugio.\n<b>Lavoro:</b> La tenacia tesse trame di successo. Progetti concreti prendono forma, e la dedizione apre vie inaspettate, portando riconoscimenti meritati.\n<b>Fortuna:</b> Una brezza leggera porta serenità inattesa, un piccolo tesoro nascosto. La buona sorte sorride con gesti semplici, donando pace e benessere.",
    "Gemelli": "<b>Amore:</b> Parole leggere e un sorriso complice accendono scintille, rafforzando i legami con delicata armonia. Dialoghi profondi aprono nuove vie.\n\n<b>Lavoro:</b> La mente è agile e vivace, pronta a cogliere sfumature e nuove prospettive. Idee innovative trovano terreno fertile.\n\n<b>Fortuna:</b> Un piccolo, inatteso gesto di gentilezza allieta la giornata, portando un raggio di luce dove meno l'aspetti.",
    "Cancro": "<b>Amore</b>: Un soffio di tenerezza avvolge il cuore, avvicinando anime con dolci parole. L'empatia è la vostra guida.\n<b>Lavoro</b>: La creatività fiorisce, portando soluzioni inaspettate. Fidatevi del vostro intuito per le decisioni importanti.\n<b>Fortuna</b>: Un piccolo raggio di sole illumina un angolo nascosto, portando una gradita sorpresa. Siate aperti al nuovo.",
    "Leone": "<b>Amore:</b> Il tuo cuore ruggisce con passione, un'intesa profonda rafforza legami o accende nuove, vibranti scintille.\n<b>Lavoro:</b> La tua innata leadership brilla. Idee audaci trovano terreno fertile, portando stima e forse un inatteso traguardo.\n<b>Fortuna:</b> Una piccola, luminosa coincidenza si profila. Sii ricettivo, un colpo di fortuna illumina la tua giornata.",
    "Vergine": "<b>Amore:</b> Un velo di tenerezza avvolge, suggerendo dolci intese. Ascoltate il cuore con gentilezza.\n<b>Lavoro:</b> La vostra precisione è una gemma preziosa. Le intuizioni guidano al successo, non temete di proporre.\n<b>Fortuna:</b> Un raggio inatteso illumina la strada, portando piccole gioie e una quieta serenità interiore.",
    "Bilancia": "<b>Amore:</b> Un soffio gentile di comprensione avvolge il tuo cuore, rafforzando legami e portando dolcezza in ogni incontro. La sintonia è palpabile.\n<b>Lavoro:</b> La tua innata diplomazia è la chiave: gestisci sfide con grazia, aprendo nuove vie al successo e all'armonia professionale.\n<b>Fortuna:</b> Piccoli, luminosi doni inattesi ti attendono, portando un sorriso e un senso di pace che illuminerà la tua giornata.",
    "Scorpione": "<b>Amore:</b> Emozioni profonde affiorano; un dialogo sincero rafforza legami. Apri il tuo cuore con coraggio.\n<b>Lavoro:</b> La tua mente strategica brilla, svelando soluzioni innovative. Affronta le sfide con astuzia.\n<b>Fortuna:</b> Un vento favorevole soffia inaspettatamente. Riconosci l'opportunità, agisci con la tua solita intensità.",
    "Sagittario": "<b>Amore:</b> Un soffio di novità accende il cuore, pronto a esplorare sentieri inesplorati con chi ami. La sincerità sarà la vostra guida.\n<b>Lavoro:</b> Le stelle favoriscono audaci iniziative. Non temere di proporre le tue idee più brillanti; un'opportunità inattesa ti attende.\n<b>Fortuna:</b> L'universo sorride alle tue scelte coraggiose. Un piccolo gesto di generosità tornerà a te moltiplicato.",
    "Capricorno": "<b>Amore:</b> Il cuore trova armonia, le parole delicate rafforzano i legami più profondi, tessendo affetti sinceri.\n<b>Lavoro:</b> I tuoi sforzi costanti attirano l'attenzione, nuove porte si aprono sul tuo percorso, promettendo frutti inattesi.\n<b>Fortuna:</b> Un velo si solleva, rivelando inaspettate occasioni che illuminano la giornata, cogliendo l'attimo fuggente.",
    "Acquario": "<b>Amore</b>: Le stelle tessono trame sottili, un'intesa profonda illumina i legami. Cogliete ogni sfumatura di affetto che vi circonda.\n<b>Lavoro</b>: La vostra inventiva è un faro; idee brillanti emergono, aprendo nuove opportunità. Fidatevi del vostro intuito.\n<b>Fortuna</b>: Un velo di serenità vi avvolge, alleggerendo il passo. Piccoli eventi fortunati rallegrano la giornata.",
    "Pesci": "Errore API Gemini: 429 RESOURCE_EXHAUSTED. {'error': {'code': 429, 'message': 'You exceeded your current quota, please check your plan and billing details. For more information on this error, head to: https://ai.google.dev/gemini-api/docs/rate-limits.\\n* Quota exceeded for metric: generativelanguage.googleapis.com/generate_content_free_tier_requests, limit: 10\\nPlease retry in 30.885638959s.', 'status': 'RESOURCE_EXHAUSTED', 'details': [{'@type': 'type.googleapis.com/google.rpc.QuotaFailure', 'violations': [{'quotaMetric': 'generativelanguage.googleapis.com/generate_content_free_tier_requests', 'quotaId': 'GenerateRequestsPerMinutePerProjectPerModel-FreeTier', 'quotaDimensions': {'location': 'global', 'model': 'gemini-2.5-flash'}, 'quotaValue': '10'}]}, {'@type': 'type.googleapis.com/google.rpc.Help', 'links': [{'description': 'Learn more about Gemini API quotas', 'url': 'https://ai.google.dev/gemini-api/docs/rate-limits'}]}, {'@type': 'type.googleapis.com/google.rpc.RetryInfo', 'retryDelay': '30s'}]}}"
  },
  "2025-10-14": {
    "Ariete": "<b>Amore:</b> Un soffio di passione ravviva scintille sopite. Lasciatevi guidare dal cuore, un incontro inatteso potrebbe fiorire con dolcezza.\n<b>Lavoro:</b> Energie fresche illuminano nuove prospettive. La vostra determinazione aprirà porte inattese, attenzione ai dettagli.\n<b>Fortuna:</b> Un piccolo dono del destino vi sorride oggi. Seguite l'istinto, vi condurrà verso una gioia inaspettata.",
    "Toro": "<b>Amore</b>: Il cuore si apre a dolci sussurri, cercando intesa e calore. Un gesto sincero rafforza legami, portando armonia profonda e vicinanza.\n\n<b>Lavoro</b>: La tua dedizione porta frutti concreti. Concentrazione acuta e pazienza svelano soluzioni inaspettate, guidando progetti con mano ferma e sicura.\n\n<b>Fortuna</b>: Un raggio di luce illumina il cammino. Accogli piccole gioie inattese, sentendoti protetto da una benevola energia che ti accompagna con leggerezza.",
    "Gemelli": "<b>Amore</b>: Un soffio di novità accarezza il cuore. Dialoghi sinceri apriranno porte inattese, rafforzando legami o accendendo nuove scintille.\n<b>Lavoro</b>: La mente è agile e pronta a cogliere sfumature. Le tue idee brillanti trovano terreno fertile; non esitare a proporle.\n<b>Fortuna</b>: Una stella propizia illumina il tuo cammino, portando piccole gioie inaspettate. Accogli le opportunità con leggerezza.",
    "Cancro": "<b>Amore</b>: Il tuo cuore trova rifugio in dolci intese, nutrendo i legami più profondi con tenerezza e comprensione. Ascolta l'eco dei sentimenti sinceri.\n\n<b>Lavoro</b>: La tua innata intuizione è una bussola affidabile oggi. Fidati del tuo istinto per superare un piccolo ostacolo o cogliere un'opportunità nascosta.\n\n<b>Fortuna</b>: Un velo di serenità ti avvolge, portando piccole gioie inattese che illuminano il tuo cammino. Sii ricettivo ai doni del destino.",
    "Leone": "<b>Amore:</b> Il tuo cuore ardente trova risonanza profonda, accendendo passioni inaspettate. Abbraccia la connessione autentica che si rivela.\n<b>Lavoro:</b> La tua luce interiore guida i progetti. Sii audace, le tue idee brillano e attraggono il successo meritato.\n<b>Fortuna:</b> Un'onda di positività ti solleva. Cogli ogni occasione con la fiducia regale che ti contraddistingue, il destino ti sorride.",
    "Vergine": "<b>Amore:</b> Un velo di comprensione avvolge i cuori, tessendo fili di armonia inaspettata. Lasciatevi guidare dall'intuizione e dalla dolcezza.\n<b>Lavoro:</b> La vostra precisione aprirà nuove vie. Un'idea brillante o un compito ben svolto porterà riconoscimento e soddisfazione.\n<b>Fortuna:</b> Un piccolo, inatteso raggio di sole illumina la giornata, portando con sé una sensazione di benessere e leggerezza interiore.",
    "Bilancia": "<b>Amore:</b> Una brezza gentile accarezza le relazioni, favorendo dialoghi sinceri e un'armonia ritrovata. Lasciati guidare dall'equilibrio del cuore.\n<b>Lavoro:</b> La tua diplomazia è una risorsa preziosa. Le collaborazioni fioriscono e le tue idee innovative portano a progressi inattesi.\n<b>Fortuna:</b> Un piccolo, inatteso dono si profila all'orizzonte, portando gioia e una sensazione di benessere.",
    "Scorpione": "<b>Amore</b>: Le profondità del tuo cuore si rivelano, intrecciando fili invisibili che rafforzano legami o ne creano di nuovi, sotto una luce inaspettata.\n<b>Lavoro</b>: La tua visione penetrante scava oltre la superficie, scoprendo opportunità nascoste e tracciando percorsi innovativi per il successo.\n<b>Fortuna</b>: Un piccolo, fortuito dettaglio o un incontro casuale può aprire porte inattese. Osserva attentamente il fluire degli eventi.",
    "Sagittario": "<b>Amore:</b> Un soffio di passione accende i cuori, avvicinando anime lontane. Ascolta il battito, nutri la connessione profonda che sboccia.\n<b>Lavoro:</b> La tua mente vola alta, portando idee brillanti. Sii audace nelle decisioni, il successo attende chi osa esplorare nuovi orizzonti.\n<b>Fortuna:</b> Un raggio inatteso illumina il cammino. Accogli i doni del caso, potrebbero celare opportunità preziose per la tua avventura.",
    "Capricorno": "<b>Amore:</b> Un soffio gentile accarezza i legami, donando chiarezza ai sentimenti condivisi. Apri il cuore a intese profonde, un abbraccio sincero attende.\n\n<b>Lavoro:</b> La perseveranza tesse trame di successo. I tuoi sforzi saranno notati, aprendo nuove vie alla crescita professionale. Un passo solido verso la vetta.\n\n<b>Fortuna:</b> Una corrente favorevole porta piccole sorprese inattese. Sii ricettivo ai doni del caso, essi illumineranno la tua giornata con serena gratitudine.",
    "Acquario": "<b>Amore:</b> Un soffio di novità ravviva i sentimenti. L'intelletto guida il cuore verso intese profonde e inattese. Apri la mente a connessioni speciali.\n<b>Lavoro:</b> Le tue idee brillano, portando soluzioni innovative. Non temere di proporre visioni audaci, troveranno terreno fertile e apprezzamento.\n<b>Fortuna:</b> Una serendipità inattesa apre nuove porte. Ascolta l'intuito, ti guiderà verso opportunità velate che promettono sviluppi positivi.",
    "Pesci": "<b>Amore:</b> Un velo di romanticismo avvolge il cuore, guidandovi verso connessioni profonde e sincere. Ascoltate l'anima, essa vi sussurra la strada.\n<b>Lavoro:</b> L'intuizione è la vostra bussola dorata oggi. Fidatevi dei lampi di genio per superare ogni ostacolo con grazia.\n<b>Fortuna:</b> Un soffio lieve di buona sorte vi accarezza, portando piccole gioie inaspettate. Siate ricettivi ai doni del giorno."
  },
  "2025-10-15": {
    "Ariete": "<b>Amore:</b> Il cuore sussurra melodie inaspettate, aprendo varchi a nuove intese o rinnovando vecchie fiamme con dolci promesse.\n<b>Lavoro:</b> La tua energia si traduce in passi audaci. Non esitare a prendere l'iniziativa; la costanza sarà premiata.\n<b>Fortuna:</b> Un vento propizio soffia leggero, portando piccole sorprese e occasioni per sorridere. Sii ricettivo ai segnali.",
    "Toro": "<b>Amore:</b> Il cuore vibra di intesa profonda. Un gesto gentile cementa legami, o una nuova scintilla illumina l'orizzonte sentimentale.\n<b>Lavoro:</b> La perseveranza è la tua bussola. Opportunità solide emergono, chiedendo attenzione e dedizione costante. Affronta con calma.\n<b>Fortuna:</b> Un inatteso raggio di sole illumina la giornata, portando piccole gioie e un senso di serena abbondanza inaspettata.",
    "Gemelli": "<b>Amore:</b> Un dialogo sincero rischiara il cuore, portando armonia e intesa. Cogli l'attimo per esprimere ciò che senti con delicatezza.\n<b>Lavoro:</b> La mente è agile, pronta a risolvere enigmi. Nuove idee sbocciano; condividile con fiducia per progressi significativi.\n<b>Fortuna:</b> Un'intuizione improvvisa ti guida verso una piccola, dolce sorpresa. Abbraccia le opportunità inattese con leggerezza.",
    "Cancro": "<b>Amore:</b> Le stelle sussurrano dolci armonie al vostro cuore sensibile. Un'intuizione guida i sentimenti, rafforzando legami o rivelando nuove profondità.\n<b>Lavoro:</b> La vostra dedizione brilla, portando frutti. Collaborazioni si rivelano proficue; ascoltate la voce interiore per decisioni sagge.\n<b>Fortuna:</b> Un piccolo raggio inatteso illumina il cammino. Fidatevi della vostra innata sensibilità per cogliere opportunità fugaci.",
    "Leone": "<b>Amore:</b> Il cuore palpita, un fuoco gentile accende intese profonde, portando calore e armonia nei legami.\n<b>Lavoro:</b> Nel tuo regno professionale, la tua luce guida. Idee brillanti trovano eco e meritato riconoscimento.\n<b>Fortuna:</b> La sorte ti sorride con tocchi inattesi, allineando eventi propizi sul tuo cammino.",
    "Vergine": "<b>Amore:</b> Un'insolita tenerezza permea i vostri incontri, tessendo fili d'intesa più profondi. Abbracciate la vulnerabilità per autentici scambi emotivi.\n<b>Lavoro:</b> La vostra acuta osservazione vi guiderà tra compiti complessi. Un approccio metodico promette risultati impeccabili.\n<b>Fortuna:</b> Un piccolo, inaspettato dono del caso illuminerà un angolo della vostra giornata, portando un sorriso sereno.",
    "Bilancia": "<b>Amore:</b> I cuori si allineano in una danza soave. Cerca l'armonia, le parole gentili apriranno nuove porte emotive.\n<b>Lavoro:</b> Un equilibrio delicato guida le tue scelte. La cooperazione è la chiave per superare ogni ostacolo con grazia.\n<b>Fortuna:</b> Una brezza leggera porta un inatteso momento di serenità, un piccolo dono dal destino.",
    "Scorpione": "Il <b>cuore</b> svela profondità inattese, l'anima risuona. La passione arde con inusitata intensità, guida ogni tuo passo. Sul fronte <b>professionale</b>, la tua acutezza è la chiave. Ogni strategia ben ponderata apre nuove porte, garantendo un successo meritato. La <b>fortuna</b> ti sorride da angoli inaspettati. Segui l'intuizione; un piccolo gesto può innescare una grande, sorprendente fortuna.",
    "Sagittario": "<b>Amore:</b> Un soffio gentile accende il cuore, portando armonia e intesa profonda. Ascolta il battito condiviso e lasciati guidare dalla tenerezza.\n<b>Lavoro:</b> Le stelle guidano passi audaci verso nuove vette. La tua visione sarà la chiave del successo; credi nelle tue intuizioni.\n<b>Fortuna:</b> Un raggio inatteso illumina il cammino, offrendo serenità e piccole, dolci sorprese. Abbraccia la leggerezza del momento.",
    "Capricorno": "<b>Amore</b>: Un delicato filo d'intesa tesse legami più profondi. Ascolta il cuore e condividi emozioni sincere, troverai risonanza.\n<b>Lavoro</b>: La tua dedizione porta frutti. Progetti a lungo termine avanzano con passi sicuri, riconosciuti e apprezzati.\n<b>Fortuna</b>: Un inatteso raggio di sole illumina la giornata, portando piccole gioie e opportunità veloci da cogliere.",
    "Acquario": "Un'aura di comprensione avvolge i vostri legami. Un sussurro inatteso potrebbe accendere nuove scintille nel cuore, o rafforzare vecchie intese.\n\nNel <b>lavoro</b>, la vostra mente brillante trova soluzioni innovative. Condividete le idee; la collaborazione è la chiave per superare ogni ostacolo.\n\nLa <b>fortuna</b> sorride su piccole, piacevoli sorprese. Un'intuizione improvvisa potrebbe guidarvi verso un vantaggio inatteso.",
    "Pesci": "<b>Amore:</b> L'onda dei sentimenti vi culla, trovando risonanza profonda. Ascoltate il cuore, un gesto gentile parla più di mille parole.\n<b>Lavoro:</b> La vostra creatività fluisce, guidando progetti con tocco ispirato. Collaborazioni armoniose apriranno nuove vie.\n<b>Fortuna:</b> Piccoli, inattesi doni illuminano il cammino. Seguite la vostra intuizione, vi condurrà alla serenità."
  },
  "2025-10-16": {
    "Ariete": "Un sussurro dolce avvolge il tuo cuore in <b>Amore</b>, tessendo fili di profonda intesa. Nel <b>Lavoro</b>, la tua audacia è premiata; un'idea brillante apre nuove porte, cogli l'attimo. La <b>Fortuna</b> brilla su decisioni rapide, guidandoti verso esiti inattesi e favorevoli. Segui l'istinto con coraggio.",
    "Toro": "<b>Amore:</b> I sussurri dell'anima trovano eco, rafforzando legami preziosi con gesti gentili. La connessione si approfondisce in armonia.\n<b>Lavoro:</b> La tua costanza porta frutti maturi; un progetto prende forma con solida precisione e dedizione. Le basi sono forti.\n<b>Fortuna:</b> Un raggio di serena fortuna illumina il cammino, portando piccole, dolci sorprese inaspettate nel quotidiano.",
    "Gemelli": "<b>Amore:</b> Un sussurro d'intesa illumina i tuoi legami, rendendo ogni scambio particolarmente prezioso. Ascolta e sarai ascoltato.\n<b>Lavoro:</b> La mente è agile; idee brillanti emergono, aprendo nuove vie di comunicazione e collaborazione. Sii proattivo.\n<b>Fortuna:</b> Una scintilla inattesa guida i tuoi passi. Abbraccia l'intuizione, poiché l'aria porta opportunità veloci e sorprendenti.",
    "Cancro": "<b>Amore:</b> Le stelle sussurrano dolci armonie; il cuore si apre a connessioni profonde. Nutrite i legami con tenerezza e presenza.\n<b>Lavoro:</b> La vostra intuizione è una guida luminosa. Affidatevi al vostro sesto senso per plasmare progetti con sensibilità.\n<b>Fortuna:</b> Una piccola onda gentile vi porta un inatteso momento di quiete, un dono nascosto nel quotidiano. Abbracciatelo.",
    "Leone": "<b>Amore:</b> Il tuo cuore ruggisce, pronto a donare e ricevere passione ardente. Sii audace, lascia che la tua luce guidi ogni emozione.\n<b>Lavoro:</b> La tua leadership brilla. Idee innovative aprono nuove strade; la perseveranza premia ogni sforzo. Non temere di osare.\n<b>Fortuna:</b> Un vento favorevole soffia, portando inattese opportunità. Afferrale con fiducia e splendore, il successo è vicino.",
    "Vergine": "<b>Amore:</b> Un filo sottile tesse intese profonde, cerca la tenerezza nascosta in sguardi e silenzi.\n<b>Lavoro:</b> La tua meticolosa dedizione illumina percorsi, piccoli successi si manifestano con chiarezza.\n<b>Fortuna:</b> Un'eco lontana porta opportunità inattese. Segui il soffio di un'ispirazione improvvisa.",
    "Bilancia": "<b>Amore:</b> Un soffio gentile accarezza i vostri legami, donando armonia e intesa profonda. Il dialogo sincero rafforza ogni ponte.\n<b>Lavoro:</b> La vostra naturale diplomazia risolve ogni incertezza, aprendo varchi inaspettati verso il successo. Collaborazioni fruttuose all'orizzonte.\n<b>Fortuna:</b> Un raggio di luce illumina il vostro percorso, guidandovi verso opportunità celate. Abbracciate le piccole gioie quotidiane.",
    "Scorpione": "<b>Amore:</b> Il cuore sussurra segreti, l'intesa si fa profonda, accendendo fiamme inaspettate.\n<b>Lavoro:</b> Nel cammino professionale, la tua acutezza svela opportunità celate, permettendoti mosse decisive.\n<b>Fortuna:</b> Guidata da un'intuizione sottile, ti sorride da angoli inattesi, portando doni silenziosi.",
    "Sagittario": "<b>Amore:</b> Un soffio gentile accende la fiamma, unendo anime in un ballo sincero. Lascia che il cuore guidi la tua voce, rivelando connessioni profonde.\n<b>Lavoro:</b> La mente agile scopre sentieri inesplorati. Un'intuizione profonda illumina il cammino, portando riconoscimento meritato e nuove prospettive.\n<b>Fortuna:</b> Stelle propizie sussurrano opportunità inattese. Sii pronto ad accogliere doni celesti, la sorte ti sorride con leggerezza.",
    "Capricorno": "<b>Amore:</b> Un legame si approfondisce, le parole non dette trovano eco nel cuore. Dona e ricevi affetto con sincerità luminosa.\n<b>Lavoro:</b> La tua perseveranza è una roccia. Affronta le sfide con metodo, un piccolo traguardo si delinea all'orizzonte.\n<b>Fortuna:</b> Un soffio leggero di buona sorte ti accarezza. Presta attenzione ai segnali, un'opportunità inattesa potrebbe apparire.",
    "Acquario": "Errore API Gemini: 429 RESOURCE_EXHAUSTED. {'error': {'code': 429, 'message': 'You exceeded your current quota, please check your plan and billing details. For more information on this error, head to: https://ai.google.dev/gemini-api/docs/rate-limits.\\n* Quota exceeded for metric: generativelanguage.googleapis.com/generate_content_free_tier_requests, limit: 10\\nPlease retry in 25.257180425s.', 'status': 'RESOURCE_EXHAUSTED', 'details': [{'@type': 'type.googleapis.com/google.rpc.QuotaFailure', 'violations': [{'quotaMetric': 'generativelanguage.googleapis.com/generate_content_free_tier_requests', 'quotaId': 'GenerateRequestsPerMinutePerProjectPerModel-FreeTier', 'quotaDimensions': {'location': 'global', 'model': 'gemini-2.5-flash'}, 'quotaValue': '10'}]}, {'@type': 'type.googleapis.com/google.rpc.Help', 'links': [{'description': 'Learn more about Gemini API quotas', 'url': 'https://ai.google.dev/gemini-api/docs/rate-limits'}]}, {'@type': 'type.googleapis.com/google.rpc.RetryInfo', 'retryDelay': '25s'}]}}",
    "Pesci": "<b>Amore:</b> Il cuore sussurra melodie profonde, ascolta i segreti dell'anima gemella. Un velo di magia avvolge i tuoi incontri, rendendoli speciali.\n<b>Lavoro:</b> L'intuizione è la tua guida più fedele; lasciati ispirare e vedrai fiorire i progetti con grazia. La creatività ti eleva.\n<b>Fortuna:</b> Un vento benevolo soffia, portando sorprese inaspettate. Sii ricettivo, un piccolo dono ti attende all'orizzonte."
  },
  "2025-10-17": {
    "Ariete": "<b>Amore:</b> Oggi, l'amore danza su corde vibranti; un incontro inatteso o una profonda connessione rinvigorirà il tuo spirito.\n<b>Lavoro:</b> La tua audacia è premiata: abbraccia nuove sfide, la leadership ti si addice, portando successi inattesi.\n<b>Fortuna:</b> Sussurra segreti al tuo orecchio, offrendo un'opportunità. Segui l'intuizione, un piccolo rischio paga grandi dividendi.",
    "Toro": "<b>Amore:</b> Un'intesa profonda illumina i tuoi legami, nutrendo il cuore con tenerezza. Nuove connessioni o vecchie fiamme si rafforzano.\n<b>Lavoro:</b> La tua tenacia è premiata; progetti e sforzi costanti portano frutti concreti. Consolida le tue posizioni con fiducia.\n<b>Fortuna:</b> Un soffio gentile ti accompagna, portando piccole gioie inattese o un senso di serena abbondanza. Afferra l'opportunità.",
    "Gemelli": "<b>Amore:</b> Un vento leggero soffia su cuori e parole, favorendo intese brillanti o nuove scintille. Ascolta e fatti ascoltare con grazia.\n<b>Lavoro:</b> Le idee fioriscono rapide; la tua agilità mentale apre porte inaspettate. Sfrutta la tua versatilità.\n<b>Fortuna:</b> Trova la tua chance nell'incontro, nella risata, in un inatteso scambio di vedute che illumina il cammino.",
    "Cancro": "<b>Amore</b>: Un'intesa profonda si tesse nell'aria, invitando il tuo cuore a fiorire in dolci confidenze e gesti sinceri.\n<b>Lavoro</b>: L'intuito è la tua stella guida; fidati delle tue percezioni per navigare con successo tra le sfide quotidiane.\n<b>Fortuna</b>: Un velo di serenità scende inaspettato, portando un piccolo raggio di luce su un sentiero finora nascosto.",
    "Leone": "<b>Amore:</b> Il cuore splende, attraendo con calore regale. Un'intesa profonda illumina la giornata, regalandoti momenti preziosi e passione ardente.\n<b>Lavoro:</b> La tua energia creativa brilla. Guida con audacia, le idee si affermano e la leadership naturale apre nuove vie al successo.\n<b>Fortuna:</b> Una ventata d'oro ti accarezza. Cogli al volo opportunità inattese; la buona sorte è al tuo fianco, pronta a stupirti con doni.",
    "Vergine": "<b>Amore:</b> Un soffio di tenerezza accarezza il cuore, invitando a gesti gentili. Le parole non dette trovano oggi la loro dolce melodia, rafforzando legami.\n\n<b>Lavoro:</b> La precisione è la tua alleata. Un dettaglio apparentemente minore può rivelarsi la chiave per sbloccare progressi significativi. Focalizzati.\n\n<b>Fortuna:</b> Le stelle sorridono discretamente. Un piccolo imprevisto si trasforma in un'opportunità inattesa se colta con saggezza e flessibilità.",
    "Bilancia": "<b>Amore:</b> Un soffio d'armonia avvolge i vostri legami; cercate l'equilibrio nelle intese più profonde.\n<b>Lavoro:</b> La collaborazione è la chiave. Ogni decisione, se condivisa con equità, porterà frutti più abbondanti e giusti.\n<b>Fortuna:</b> Una scintilla inaspettata di buona sorte brilla attraverso incontri o riconoscimenti meritati.",
    "Scorpione": "<b>Amore:</b> L'intensità guida il vostro cuore; un legame si approfondisce o una verità affiora, chiedendo coraggio.\n<b>Lavoro:</b> La vostra acuta percezione svela opportunità nascoste; siate strategici e pazienti.\n<b>Fortuna:</b> Vi sorride con inattese svolte, beneficiando chi sa adattarsi e credere nel proprio intuito.",
    "Sagittario": "<b>Amore:</b> Il cuore danzerà al ritmo di intese inattese, un filo d'oro lega anime affini. Apriti alla dolcezza.\n<b>Lavoro:</b> La mente acuta svela percorsi nuovi; la perseveranza aprirà porte insperate. Affronta le sfide con slancio.\n<b>Fortuna:</b> Un soffio gentile porterà doni celati, sii pronto ad accogliere il favore del destino. Opportunità inaspettate ti attendono.",
    "Capricorno": "<b>Amore:</b> Un soffio di tenerezza riscalda il cuore, rendendo ogni legame più profondo. Cerca la sintonia nelle piccole attenzioni.\n<b>Lavoro:</b> La tua dedizione porta frutti inaspettati. Una strategia lucida apre nuove vie, sii costante e vedrai risultati.\n<b>Fortuna:</b> Un piccolo colpo di scena positivo illumina la tua giornata, forse un aiuto insperato o una piacevole scoperta.",
    "Acquario": "<b>Amore:</b> Un vento di novità accarezza il cuore, portando dolci intese e comprensione reciproca. Apri la mente a nuove connessioni.\n<b>Lavoro:</b> Idee brillanti emergono dall'ombra, pronte a illuminare il tuo percorso. Non temere di presentare soluzioni originali.\n<b>Fortuna:</b> Una scintilla inaspettata accende la via, suggerendo opportunità da cogliere con fiducia e un pizzico di audacia.",
    "Pesci": "<b>Amore:</b> I sentimenti danzano leggeri, portando dolci armonie e comprensione profonda. Un incontro inatteso può svelare nuove emozioni sincere.\n<b>Lavoro:</b> La tua intuizione è una bussola preziosa. Segui il flusso creativo; nuove idee fioriranno con facilità, guidando i tuoi passi.\n<b>Fortuna:</b> Un piccolo segno, una felice coincidenza, illumina il tuo cammino, offrendo un inatteso spiraglio di speranza."
  }
}